{"review-url":["http://www.imdb.com/title/tt0445336/reviews"],"review-text":["The Swedish filmmaker Roy Andersson's latest film You, the Living is not easy to review. One of the reasons is that in his own words he has broken with the Anglo-Saxon tradition of story-telling, in all essence the template of most Western film productions. Another reason might be that although Roy Andersson is somewhat heavy on symbolisms, his, unlike those of, say, Andrei Tarkovsky, are of a more elusive nature. It took him 3 years to complete this 86 minute long film and it wasn't because he was forced to have long breaks between shootings due to financial troubles or problems with the actors. The film consists of 57 vignettes shot mostly by a still camera, and it was the careful design of each of these scenes which required much time. The imagery of this film which is closely related to the director's previous film Songs from the Second Floor is of utmost importance to the story, thus this story is told to a great degree by the surroundings and the environment in which the characters of Andersson's universe dwell and interact. Before each scene was finally shot, there would have been no less than 10 different test shootings with different actors, colors, dialog etc. The result is a dreamlike version of the surrounding world which most of us would recognize and if the setting is like a dream, why not dream a little? Just like in Bunuel's The Discreet Charm of the Bourgeoisie, when somebody says \"Last night I had a dream\", you get to watch it. But then again, what is perceived as reality here is not very much different from the dreams.Despite the fact that the film lacks a plot in the traditional sense of the word and there are no main characters as such, the different characters who appear and reappear in different scenes still meet each other and their stories are inevitably intertwined. What most of these characters have in common is their apparent loneliness despite being surrounded by other people. The trailer trash chain smoking and binge drinking woman who dreams of having a motorbike so that she can get away from \"all this crap\", her corpulent and mostly silent boyfriend and his frail and seemingly gentle but rather absent-minded mother, members of a brass band whose skill improving efforts at home aren't getting a favorable reception neither from their families nor their neighbors, the depressed Middle Eastern hairdresser and his arrogant customer on his way to \"a very important business meeting\", an elderly man having a nightmare about bombers in the skies, a young girl dreaming about marrying the young rock star that she is so madly in love with. It's all about dreams and nightmares versus reality but it works as much as a statement in support of the Austrian philosopher Ludwig Wittgenstein's claims that \"all human communication is miscommunication\". People speak to each other but it is as if they speak past each other. They try to reach out to the others but shut the others out when those try to reach them.You, the Living is a poetic film set physically in Stockholm but yet universally applicable. The society it portrays is Sweden, its artistic language and the people displayed are generally unmistakably Nordic. Yet, the subject it deals with, namely, the misery of the humankind in a selfish world, reaches far beyond this hemisphere. Despite the seriousness of its theme, the film itself seems a lot more cheerful and laden with humor than one might have expected. But in the words of the director himself \"living is so complicated to each one of us that the only thing that saves us is our sense of humor\". Hence, this film is a tragic comedy or a comic tragedy, depending on your sensitivities, and not a depressing black reality tour of the human nature. It is unusual in its language and structure, but if you can think outside the box and enjoy it, you will certainly find this film both entertaining and meaningful at the same time. It was shown at this year's Cannes festival as part of the Un Certain Regard program which offers \"original and different works\" outside the competition. After the film was shown in the Salle Debussy, the 1,000 strong audience gave it a standing ovation for several minutes. Do I need to say more?","There is no plot. There are no central characters. There are no moving cameras or close-ups. In fact, this film does not follow any of the conventional storytelling techniques used by mainstream film. However, Roy Andersson's Du Levande is a remarkable piece of cinematic storytelling. It is a touching look at the human psyche.Comprised of a series of vignettes, Roy Andersson gives us an intimate insight into what makes us all human. In perfectly framed static shots, added with the perfectly in tune, yet quirky, music, Roy introduces us to a host of characters as they undertake their daily existence. Some bordering on tragic, others hilarious, we are taken on a Nordic journey like no other.It is a journey into the little things that make us human. Instead of over-the-top storytelling or visual techniques, everything is stripped down to the bare minimum so that our sole focus is on the characters themselves. It focuses on the insignificant points of our lives that make us who we are; our dreams, our desperation. It's through this simple observation of others that we can accept who we are as individuals.The washed out colours and deathly-pale makeup of the characters only seems to emphasize their individual stories and remind us that unlike them, we are all alive. There is no happy ending or light at the end of the tunnel in this film, yet you walk out of the cinema with a sense of life. Much more accessible than his earlier film, Songs from the Second Floor, Du Levande, is a truly inspiring piece of cinema.","Roy Anderson's film 'You, The Living' comprises a series of fifty-odd sketches, snapshots and vignettes set in a Swedish city. Some characters are on screen for just a few second, whilst others appear in numerous scenes and are sometimes seen loitering in the background while another story unfolds. Many scenes are drawn from the dreams, nightmares and fantasies of the strange but believable characters inhabiting this world. It is a fascinating approach: each of the scenes could be enjoyed in isolation, but together they contain a powerful portrait of what it is to be human.For the first half hour or so, 'You, The Living' is gloriously funny. Much of the humour centres on the members of a brass band, whose music practice infuriates the neighbours in their apartment block. The comic highlight, however, is provided by a dinner-party track gone horribly awry. After this hilarious introduction, however, the mood of the film darkens considerably. The dinner-party dream turns grim when the hapless protagonist is put on trial for his life, setting a mixed tone of absurdity and despair for the rest of the film.In the subsequent scenes, the unhappiness of the cast of characters becomes increasingly apparent. Theirs is a world where people are unable to connect with one another, where talk of dreams, nightmares and fantasies is widespread, but where no person can be comforted, even when others reach out to help them. The despondent woman with the 'nobody loves me' refrain and the young girl with unrequited love for the rock guitarist, Micke, are archetypal characters.The world of 'You, The Living' is also blighted by selfishness. An elderly professor is called away the warmth of a vast banquet to answer a phone call from his impetuous money-grubbing son; a thief steals the wallet of a ruthless executive; an arrogant and impatient businessman insults a Muslim barber and receives his comeuppance. In the film's bleakest moment, a woman in church recounts the long list of human sins as her fellow parishioners shuffle out at closing time.And yet, for all dark moments in this film, the shared refrain of 'tomorrow is another day' points to the ability of people to go on living in spite of many miseries. The soundtrack provided by Benny Anderson (of ABBA fame) seems inappropriately jovial at first but makes more and more sense as the film realises this human capacity to persevere.'You, The Living' has an extraordinary visual style. The same washed-out, pale-green colours recur throughout, and there is nary a shadow in sight; this makes the characters appear exceptionally pallid and creates the sensation that human life is being laid bare for examination. Almost every scene is captured in a static camera frame, as if these are photographs being brought to life. The few occasions where the camera does move are all the more extraordinary; the contrast between the life and movement of the great banquet form a startling contrast with the deadness of the cloakroom scene. In the most intense moments of longing and despair, the characters transfix the viewer by directly facing the camera  they know that they are being examined and have a few moments to pour out their hearts to us, the viewers.This is a wonderful, human film.","The large bell in a bar intermittently rings for last orders and the inevitable rush to queue forms at the counter  do we want what we need only when it's too late? Or is the irony of the opening scene's wailing Cassandra a more resonant reflection of our perceptions on individual existence? There's an endless fascination about where writer-director Roy Andersson wants to take us in his fourth feature, \"You, The Living\". With fifty or so semi-related vignettes strung together by a penchant for tragicomic hyper-reality, its wistful interpretations and symbolic instances of life that bind us all in this great big cosmic Sisyphean struggle. The sheer simplicity of these vignettes act to dramatise the tenuity and immense preciousness of being apart of the symbiotic relationships we have with one another. Andersson might whittle down the complexity of the human condition through harsh and fast cynicism more than he should, but he also reminds us of the inherent, reassuring glory of waking up each morning to a new tomorrow when we're all aware of our own distinct forms of arrested development.","\"With all the misery in the world, how can we not get drunk?\"  MiaA lovely aerial view of a major city turns ominous with the approach of a fleet of airplane bombers; an irate hairdresser reacting to a perceived racial slur cuts a road through a businessman's bushy hair; a man dreams of being dragged to an electric chair after a failed magic trick and a teacher breaks down in front of her grade school class because her husband called her a hag. These and about fifty other vignettes that run the gamut from the outright depressing to the wildly humorous to the joyously uplifting populate Roy Andersson's You, the Living, his first feature since his critically acclaimed if commercially unsuccessful Songs From the Second Floor.You, the Living is filled with the same kind of imaginative set-pieces as Songs, replete with black humor, surreal situations, and strange looking characters. Though a bit overlong and less focused than his earlier work, what remains constant is Andersson's unmistakable style with its stationary camera, sterile-looking backgrounds, and precise attention to detail. If there is a theme that ties the sketches together, it is that our time on Earth is limited and \"tomorrow's another day', so let's treat each other with kindness. Along the way, we are entertained by tuba and drum music from the Louisiana Brass Band, dinner guests at a banquet hall standing on their chairs singing a rousing song, and a house that turns into a moving train.The emotions range from the gloom of a daughter attempting to communicate with an Alzheimer's patient to a young woman's ecstatic dream about marrying a handsome guitar-player named Micke to the cheers of a crowd of onlookers. While there is no continuous narrative thread, the theme of greed and desperation appears in several sketches. The first of these threads features two corpulent individuals and their tiny dog sitting on a park bench, the woman bewailing the fact that no one understands or loves her, yet she blithely ignores the man's comforting and reassuring words.There is also a hefty admixture of irony. During what seems to be an executive luncheon, one man tells another on the phone that workers don't appreciate quality and how nice it is to appreciate money and the things that it can buy such as fine wine. When he is not looking, however, a man at an adjacent table calmly lifts his wallet from his jacket on the back of his chair. Though Andersson's cynicism is at times not very well hidden, You the Living has an underlying humanism that shows compassion for the human condition. It is a cautionary tale that looks at the mess we humans have gotten ourselves into but suggests there is still time to turn it around, if we heed the warning of the poet Goethe that opens the film, \"Be pleased then, you the living, in your delightfully warmed bed, before Lethe's ice-cold wave will lick your escaping foot.\"","I really didn't see this one coming. Roy Andersson had me pegged out, I am the perfect sucker for a static camera (long live King Borowczyk!) and I was laughing hysterically for the first fifteen minutes of the film, he hit me straight between the eyes. You have to be a brilliant man to make self-pity hilarious. Andersson reminds me of the third mate on the Pequod in Moby Dick, Flask, a man who took the whole of life to be a practical joke that the good lord Himself is playing on us. And the web of egotism in this movie is truly hilarious.The level of satire is at fever pitch, you have one deluded self-pitying dreamer harp on about the cruelty of the world and then totally ignore a spiritual self-reflection crying out in agony. The very depths of egotism are plumbed. I really never thought it possible to go further than Bergman's \"The Silence\" in this respect. However the grotesqueness of the self-love and self-regard, by every single character in this film, is staggering. We are shown an existence where the talentless and the idle rail against a world they believe has been unjust towards them, they truly are legends in their own living rooms. The human beings in this film make self-deception and self-delusion a great artform! Only one woman in the film appears to have any sort of understanding of what is going on. An old woman who refuses to leave a chapel, knelt down praying for the forgiveness of all mankind, her speech is the most electrifying condemnation of the modern world I have ever heard. She reveals through her prayers that what is wrong with the world is not to be fixed by mere tinkering, there are not a just a few faults, there is an abyss of corruption that can only be mended by immolation, and judgement day. Watching this movie puts me in the mind of a naked monk, stood waist deep in a cold river at midnight screaming out a thousand Kyrie eleisons for the sins of humanity. Another grand jape is that it is clear that her prayers are futile, and in fact she is stopping everyone going home at closing time.This is not a film for the smug, no-one is spared, no idols are left on the altar, no one group of humans is harangued to the glory of another group. Never has there been a greater more transcendent more astonishingly beautiful summation of our sins. It is a film for the end of the world, it is the grand jest, the great hideous practical joke of human life! From the catalogue of images it is too difficult to pick a favourite, I slapped my thigh and almost fell off my chair in the cinema, screaming with laughter as a man attempted to pull the tablecloth from under a set service. I won't spoil what happens, but the suspense builds up, and something truly unexpected occurs. It is probably the funniest thing I have ever seen in a cinema. I am quite reserved and I just couldn't control myself: that is the measure of the greatness of this film.The shooting of \"You, the Living\" is impeccably formalist. We are shown the palette of an artist, dingy browns, yellows, greys, and sky blues set alive by the shock of luminous brass textures. There is never a tone out of place, it's like an hour and a half of symphonic Whistlerian colour-meld. The obsession that must have gone into putting that colour scheme in place is extraordinary. And no shot is wasted, as with all great movies, there is not a spare inch of celluloid.Perhaps the best film I've ever seen.","A short review without any spoilers follows.I saw this movie yesterday at the Cannes Film Festival. My initial reaction is one of wonder and happiness. I'm so happy films like this are being made in our age of blockbusters. Roy Andersson's new movie \"You, The Living\" is nothing less than a complete masterpiece. You, The Living is composed by some 50 vignettes filmed with a static camera. I will not give away the content of the scenes here, because I hate when people spoil even the smallest details. But, yes, most of the scenes made the 1000 people in the Claude Debussy theatre absolutely baffled and amazed. When the film was over we applauded for several minutes, we had no other choice.So what's the score with \"You, The Living\". Hm, Andersson isn't afraid to take on the heavy questions; History, guilt, gand The Holocaust during WW2 are big subjects (and these themes work very well together).The images created are brilliant, the depth sometimes surpasses \"Songs from the Second Floor\". Well, sorry for this ranting, praising review. Look out for the Flying House in the beginning folks!10/10 stars - A Masterpiece (I never throw this grade out).","Minor Spoilers will follow.This movie is even more odd and unconventional than \"songs from the second floor\". There is no main character we follow around. There is no \"plot\" in the conventional way. There is no emphasis on an happy end. There is no crowdpleasing. In other words Roy Andersson is back with a vengeance. Instead of falling back on convention and fixed formula Roy Andersson concentrates his film around an idea. I will not go into what that idea is, but even if you don't \"get it\" i promise that you will see the greatest visual depth ever put to film. The majestic scenes from \"songs\" pale in comparison here. A work of visual splendor.So be kind to your fellow man, because after all \"we are the living\", and only you and I have the power to change our lives. That is at least what I thought when I saw the final scene in the movie, with the inhumane bomber planes sweeping in over the city in the film to take our lives away. And of course don't forget to see this movie when it gets a limited release near you. This is one of those movies that actually have the power to make you a better person, like de Sica's \"Bicycle Thieves\". A very warm and humanistic film.","This film isn't supposed to be funny, but it made me laugh.It isn't designed to be sad, but my heart felt heavy through a number of the vignettes.It isn't written as action adventure, but my pulse raced more than once.Just like life, this movie doesn't manipulate your emotions and tell you how to feel. It simply is, and you react.If you don't find it funny or sad or moving, I suspect that says more about you than the film.It amazing and refreshing to see a director so wholeheartedly celebrate that we are all human, and embrace that we are all trapped here, doing this \"life\" thing, over and over for as long as we must.Tomorrow is another day.","You can't really call Roy Andersson prolific, (6 films in 37 years). Nor can you accuse him of being conventional; he doesn't do 'straight-forward', at least when it comes to narrative. \"You, the Living\", his first film in seven years, is like a surreal documentary in which a large number of characters are observed doing nothing very much and if that sounds off-putting, let me assure you it isn't. This is a funny, accessible and surprisingly warm-hearted movie, a slice-of-life far removed from that which we normally see on the screen.Of course, 'slice-of-life' is hardly the proper moniker to apply to this movie since most people's lives are unlikely to be anything like this. The incidents on the screen run the gamut from the almost terrifyingly ordinary to the downright wacky and while characters may flit by, sometimes never to be seen again, others to reappear as if anxious for approval, Andersson bestows on them all a kind of benign affection. That, and some rollicking music, ensure the time we spend with them is time well-spent.","I laughed out loud several times during this film though give it a cursory glance and you would think it was something else altogether. I adore the pace and the way it slowly burns into you as you are presented these gobsmackingly beautiful tableaux. Andersson gives us something else here. Shows us something I had not seen since his last film. He is compositionally exceptional and via his method of fixing the camera and allowing action to take place before us, he opens the door on humanity and we peer into a place that reflects our own lives, our little lives. It is powerful stuff. It is the simplicity with which he allows the events to take place that creates the opposite feeling of complexity. Everything in front of the camera is anything but simple. Andersson's attention to detail is extraordinary. I believe most scenes, if not all, are sets built from scratch according to his designs. I cannot recommend this film highly enough. For me it took me to a place and I came out of it having witnessed a world frayed and beautiful, starched and pained, barren and splendid. At once alien and familiar. This film is brilliant and life affirming. I know because I came out smiling feeling wonderful. It has taken him seven years to make this. If he only made this one film he would still be up there with the greats.","The Swedish film is billed as a comedic meditation, but for me it was just too arty, cold and a study from a warped artistic mind. There are apparently 50 ironic vignettes in this film, whereby a mainly muted story made from rolling scenes of uncomfortable nonsense combines visions of bored individuals, with a link to musical instruments. The film could be interpreted as deep, meaningful and different but most will see it for the art for arts sake tripe study of expression that makes art so subjective and personal. Be in the mood, for enlightenment, and see what you can draw from this piece of film.Here, filmmaker Roy Andersson draws the viewer into the world of a woman whose most uplifting moments are always balanced by tragedy, and whose joy is constantly offset by sorrow. This comic tragedy of life manifests itself in a manner that all can surely relate to, it's just whether YOU GET IT","No film has captured the essence and opulence of existence like You, the Living a 2007 Swedish film written and directed by Roy Andersson. You, the Living cuts to the core of what it means to be human and the existential dread that plagues society. The characters portrayed are everyday people each with their own caricatured personality trait that makes them identifiable as plagued by some facet of the human condition. The composition of the film is masterfully accomplished with a finesse and style that exemplifies the brilliance of Roy Andersson as a director. Arguably the most prominently apparent theme is that of existentialism. The opening sequence immediately sets the tone of the film with the lamentations of a middle-aged woman who tearfully proclaims that nobody loves her to the dismay of her boyfriend. She rejects his condolences and even shuns the love of her dog. Despite her boyfriend's attempts to console her and assure her that things are not as bad as she believes them to be, she is determined to be miserable. As her boyfriend stalks off she sings a song about how a motorcycle would make her happy to the tune of a swinging jazz band. Her requirement for material possessions in order to be happy is a fundamental flaw that pervades modern society. As the film progresses it introduces a carpenter who is executed for botching a magic trick, a pickpocket who robs a pompous wealthy man, a psychiatrist who has given up on counselling people and now just prescribes pills, a girl who dreams of marrying her rock star idol, and a couple dwelling on an argument throughout the day. The profound discontent of the portrayed people is framed by the juxtaposition of the psychiatrist's monologue. The immense unhappiness exhibited by each of the characters is clearly self-inflicted; they fail to recognize and appreciate everything they have going for them.The sets in the film are bleak and minimalist, almost devoid of colour, in order to draw attention to the lives of the characters. The vast emptiness and geometric simplicity of the scenes is a visualization of the way the discontented characters view their world. Andersson's consideration and removal of all distractions from the core of the piece make the message of the film that much more clear. Furthermore, the stationary camera shots and complete lack of any sort of change in perspective during a scene is nigh unique amongst mainstream films. Consequently, every aspect of every scenes is focused on the characters. The camera work combined with the washed out colours gives the audience the perspective of a third party observer with the exact same outlook on life as the characters portrayed. When combining the cinematographic styling and the lack of any sort of plot to speak of the film takes on a sort of breadth of humanity discourse. Roy Andersson goes a step further than just a discursive portrayal of self-inflicted human suffering. In a brilliant series of cuts Andersson shows each character stop their daily routine of feeling sorry for themselves as they look to the sky. What is a common sign for a search for redemption in American film becomes a dark and poignant scene when the film cuts to a shot from above the wing of a bomber flying over the city. The miserable lives of the characters is symbolically brought to an end illustrating Andersson's resentment of the pitiful and self-absorbed lifestyle that was rampant throughout the film.You, the Living is a masterfully rendered machination of Roy Andersson. His control of the creative process engenders a complete and unified work that at its core thrusts at a single point and never wavers. You, the Living is a film that forces viewers to think about the manner in which they live their lives. The lifestyles portrayed in the film are rejected as unfulfilling and proposes that instead we enjoy and appreciate as the title card suggests \"Therefore rejoice, you, the living, in your lovely warm bed, until Lethe's cold wave wets your fleeing foot.\"","I enjoyed You, the Living(Du levande), 2007, 90-minute long collection of 50 short vignettes so much that I've re-watched the whole movie as soon as I finished it and I keep coming back to some of my favorite sketches over again. I highly recommend the film to the fans of truly original, defying classification and definitions independent movies that mix in perfect proportion tragedy and comedy while explore the different aspects of modern human existence. In his less than 90 minutes long movie, Swedish director-writer Roy Andersson attempted to look closely at all humankind while not leaving for a moment a rather gloomy rainy Stockholm and its unremarkable, often miserable and complaining, depressed and misunderstood, inhabitants. Their lives can be described as disharmony in the faded gray, green and beige, the palette that Andersson has chosen for the film which creates the atmosphere of quiet desperation and misery. The dreams and reality of the characters substitute each other effortlessly. It seems that three of the greatest filmmakers from the past, Luis Bunuel, Ingmar Bergman and Krzysztof Kieslowski, might have inspired Anderson to make this extraordinary film, because their impact is difficult to deny. With all the existential subjects and non-sentimental outlook, You the Living manages to be very funny, finding humor, poignancy and tenderness in the absurd situations beneath the minimalistic style and remoteness. As always in a movie with great deal of intertwined short stories, some were more memorable than the others. For me, the funniest was the sex scene –it has to be seen to believe. The best, most memorable, gentlest, the most optimistic in the pessimistic world, perfectly constructed, with the best cinematic surprise and the most beautiful music was a dream sequence told by Anna, the young girl desperately in love with a rock musician Micke Larsson (Eric Bäckman (\"Cat Casino\", a guitarist for Deathstars). This miniature has become one of my favorite film scenes ever. The choice of music in You the Living is fascinating and adds so much to the film appeal. The best scenes (or are they just my favorite?) are filled with music: Louisiana Brass Band playing Mozart Lullaby which sounded like a marching tune and made me smile. The woman in a bathtub singing beautifully the old Russian folk song Odnozvuchno gremit kolokol'chik /Monotonously Rings the Bell that was popular in many European countries by the different titles. Actually, this short, less than one minute long scene seems one of very few depicting happy people, a singing woman in the bathtub and a man who dresses in the room and sings along with her. When people are happy, they often sing, just for themselves. When they are not happy, they also sing, and there is a hilarious motorcycle song in the beginning of the film performed by one of the funniest characters, a middle aged lady, wannabe biker, and the embodiment of annoyance and nagging. I already mentioned the Anna's dream sequence that I watch every day and can't get enough of. Comparing to faded and for the lack of the better word muted colors, the music is lively, expressive and catchy. This contrast works very well for the film. You The Living is the second film in the reflection on existence trilogy that consists of Songs from the Second Floor (which is on the top of my Netflix queue right now) and A Pigeon Sat on a Branch Reflecting on Existence which Roy Andersson still works on, and hopefully it will be released in 2013. I am very happy to have discovered and experienced You the Living, truly unique work of the great modern film creator and eagerly look forward to seeing the rest of the trilogy.","Advancing on the characteristic approach and satirical thematic concerns of director Roy Andersson's previous film, the excellent Songs from the Second Floor (2000), You, The Living (2007) presents to us yet another vaguely tortured, darkly-comic look into the failures of human existence; with an ironic juxtaposition between the presentation of both content and form that is disarming to say the least. Unlike his previous film, the themes of You, The Living are much less enigmatic and oblique. There is also a greater sense of structure here; and although the whole thing can be interpreted as a prolonged nightmare (or a dream of social dissatisfaction), the ultimate realisation of that final scene - which stresses subtly and a cruel sense of humour - makes the socio-political message of the film much clearer and more relevant than any of Andersson's work since the AIDs related short-feature, Something Has Happened (1987). Again, it can be seen as an extension of the director's background in commercial advertising, with any awareness of even a handful of his often fantastic TV commercials establishing his trademark use of deliberately static tableau, filled with an impeccably rich attention to mise-en-scene, and a genuinely impressive use of bold, comic-timing.This, of course, shouldn't really come as a surprise; throughout his career - stretching as far back as even his second feature film, the critical and financial failure Giliap (1975) - Andersson has used elements of cruel, social-satire to draw on the notion of human fragility, and often in the attempt to mine an almost absurd comedy of errors motif that seemingly grows from routine, everyday-like misadventures, into full-blown comic-tragedies. At its most simplistic, his work could be interpreted as a series of sketches that attempt to parody the seeming futility of everyday existence in such a way as to find humour and hope in even the most despairing of situations. The aesthetic then is to document the harsh-realities of the world in the form of an ironic stylisation - once again capturing despair, loneliness and alienation with all of the designer gloss of an IKEA commercial - with the sly implication that modern consumer society wants us to aspire to the level of middle-aged suicide, alcoholism and tragic desperation being close to genius in its presentation. Nonetheless, there is much more to the film than such a glib description might suggest; with Andersson structuring these scenes in order to show the escalating sense of desperation, selfishness, worthlessness and self-pity of these bemused and befuddled characters, as their shallow hopes and dreams are exposed against a literal, last-minute offering of swift, apocalyptic despair.As ever with Andersson, the design of the film is rich and exquisite from one scene to the next, with the director and his crew going to great lengths to create these locations (including all but one of the exterior shots) on the sound-stages of Andersson's Studio 24. Even though the world of the film is plausible to the point that we forgot the film was even shot in a studio, there still remains a continual off-kilter quality of wily exaggeration that becomes more and more notable as the film progresses. This sense of creative abstraction finally achieves its full potential during an apparent dream-sequence; in which a house moves through the countryside on a railroad track before finally pulling into a local train station to the cheers of the supporting cast. It perfectly captures the bleakly beautiful spirit of the film and the depth of Andersson's imagination as a filmmaker, here at the height of his creative abilities. Once again, we can argue the merits and the meaning of the film as we did with the more obviously downbeat Songs from the Second Floor, seeing it as either a stark, Godardian satire on the nature of consumerism and a comment on how the wheels of everyday existence conspire to grind us into place, or as a work of high-concept design intended to parody the slow grind of everyday existence - and the even greater weaknesses and despair - hidden beneath the already drab facade of day to day life.Unfortunately, many will no doubt see the film as plot less or formless even, and, to an extent, it is. However, there is a real meaning here that is expressed through images that - even in spite of Andersson's ironic detachment and occasional mocking of his own characters and the directions they follow - offer us a number of moments that are emotionally affecting, and indeed, entirely memorable. Regardless of such interpretations - which are ultimately there for the individual to discover and interpret by themselves - the film works as a result of its keen sense of humour - which is continually dark and again reminiscent of the work of Aki Kaurismäki; in particular films like Hamlet Goes Business (1987) and The Man Without a Past (2002) - and of course, Andersson's uniquely defiant and immediately iconic style. As with \"Songs\" (and indeed, all of Andersson's work over the course of the last twenty-years) the episodic nature of the film can be a strain at first; however, it is worth sticking with, as the more obvious characters soon become apparent and their individual strands of the narrative become compelling in an oddly affecting way.","You, the Living (2007)Mordant. I've never written that word before but it comes to mind here. Let me look it up. Well, it's part of it--corrosive, but also funny as heck. So corrosively funny. This is a dour film, for sure, with so much dry dry dry wit and quirky humor it's impossible not to like it on some level. Filmed in a very spare style, often with a static camera and really balanced, stable compositions, like theater stages, we see a short enactment occur.But that makes it seem ordinary--which it is not. Ordinary life is shown to be frumpy, ironic, delightful, coy, and depressing. And impossible. We, the living, must live, and since we're alive, we may as well take note. Something like that. I think it was Ebert who said you find yourself laughing and don't know why. Exactly. And the promo material somewhere said it was a cross between Bergman and Monty Python, and what they mean is it has the dry, silent, probing look of Ingmar Berman's famous Swedish films, but it has the zany, somehow touching elements of the British comedians. I'd say, definitely, definitely watch at least half an hour of this. There is part of me that thought I was through by then--the rest continues in a similar assemblage of little skits and moments, and they do gradually evolve, but there is no great plot to follow or climax of the usual kind. There are some great moments later, even just the attention to the thunderstorm, which takes us out of the mundane human events nicely. The filming is gorgeous in its classical control, almost like a series of Gregory Crewdson scenes (and outdoing the photographer, actually). And the acting, with all its very ordinary, non-glam folksiness, is right on. A startling, beautiful, odd experience.","I enjoy the National Anthem. I enjoy the National Anthem if for nothing else then, just before the Midnight News, I imagine I'm playing the cymbals in the band. Not as easy as you may think! One, two, three, four; One, two three, four; but then what? So I have sympathy with the practising bass drum player in Roy Andersson's wonderful film, patiently waiting for his cue listening to a very 70s cassette player.The 70s motif seems to continue throughout, with some classic, soulless furniture. Moreover, every scene has an eerie jade wash which emphasises the minute nuances of the subtlest of acting.Which brings me to Jessika Lundberg's outstanding purple boots. Boots which otherwise would have inspired a Silk Cult advertising campaign.But then the difficult bit. Someone asked me what it was about. Well there is a scene where the opening line as \"I don't have that length in green\" Brilliant. Straight out of a Gary Larson carton.I can't say what it's about. Go see yourself.Ron PlasmaHmm. Larson! Sounds Swedish(Viewed 15Apr08)","This, which was shown dubbed in Italian at a Rome cinema (not as bad as it sounds) after being presented at the Rome Film Festival, is very much an art film and a festival film, guaranteed to charm and delight such audiences for its distinctive style, droll humor; ability to draw comedy from the suffering of others; appealing, cheery music; spot-on performances; overriding sweetness and humanity--but doomed, because of its oddity and lack of a compelling story line, to leave average audiences wondering what they're watching it for and why anyone admires it, how it even got made.Andersson gives us almost a series of dry skits. Running through them are various themes. Money: a guy at the next table (Waldemar Nowak) nicks the wallet of a rich bore talking on a cell phone in a restaurant over a glass of brandy, then goes and orders a set of posh suits made to order; a deadbeat son calls his celebrated father away from an elaborate gathering to beg him for one more loan. A shrink worries aloud about his depleted investments while his wife humps him in bed wearing only a shiny Viking helmet.Depression: an elementary teacher (Jessica Nilsson) breaks down in class because her husband has called her a \"harpy;\" the rug salesman spouse (Pär Fredriksson) collapses before clients because he's called her that. Several men have depressing dreams. But hey--this is Sweden. Isn't everybody depressed? Love problems: a fat bohemian couple is perpetually breaking up; a girl groupie has fantasies about a lead guitarist, Micke (Eric Bäckman). Wives slam doors when their husbands start to practice their instruments. (Music too is obviously a unifying theme. Besides the dashing guitarist there's a tuba and a drum player who're in a Dixierland band and also play in marches and funerals. Every scene has an added lilt from the music, which niftily links one sequence with another.) A raging storm outside the window of many scenes, violent rain, people out in it, thunder so loud it sounds like a battle raging across the land. This also unifies the tone and gives the impression various scenes are happening on the same dauntingly tempestuous day.Andersson is a master of visual composition and the static middle-distance shot and the film has a foggy gray-green look engineered by DP Gustav Danielsson that's perfect because it evokes the gloom of a Swedish winter but also twinkles with the subtle colors of the director's wit, which ends every scene with a smile. One almost never knew drabness could be so beautiful. (Or perhaps one did: Alexcanr Sokurov creates such effects sometimes in very different contexts.) Within scenes and in the film as a whole there's a kind of stillness that comes out of the visual style, the pacing of scenes, and the detached humanism of the overall outlook. There's something about a fully mastered style that's calming, reassuring.Not everything works equally well. One may feel impatient with the succession of barely related scenes, which read too much sometimes like the work of a Saturday Night Live writer in need of Prozac. Since some scenes plainly move you or draw a laugh, it's obvious that others fall a little flat.But some scenes are real zingers, and one obviously triumphant climax of pure magic is a dream--described and then visualized dreams being another important thread) in which the girl groupie imagines herself in a wedding dress newly married to her fey guitarist ideal, who plays a delicate series of riffs while a crowd of admirers gathers outside a big window. The viewpoint switches to outside and the window slides slowly away as if the building the dream newlyweds look out of were a train moving out of a station to take them to their honeymoon. It's a fresh, subtle, and rather sublime effect.Eventually one may feel everything in You the Living (Du Levande) is a dream, including the recurring scene where the barman is always striking a bronze bell and announcing last order time, whereupon all the torpid customers rise from their tables and go up to get one more drink.An Italian reviewer called this \"a small, great film,\" and that's right. It limits itself in a dozen ways, but there is greatness in it. Roy Andersson is a little master (like some medieval miniaturist) of the inner comedies of Scandanavian gloom, and this is a film unlike any other. Shown this year as a Cannes \"Un Certain Regard\" selection, this is also the Swedish entry for the 2007 Best Foreign Oscar. Hard to say what Bergman would think, but Andersson worked with him; is famous for his elaborately produced TV commercials, some of which one can see on YouTube. Bergman called them \"the best commercials in the world.\" It will be interesting to see if this director, whose craft is as subtle as his viewpoint, will start working in longer segments some time. Meanwhile, any good film buff really needs to get a look at this.\"Schadenfreude\" isn't quite the right word. That means delight in the misery of others. Andersson is teaching us to delight in the misery of all of us.","You will learn few things about what cinema (and you) can be until you learn to train and practice your perception against the flux of images, and this means to be the still point from which everything else is viewed to be in motion, letting it be what it is as it makes its journey to reach you.This is comic, at first sight, tragic, about modern alienation, failure, ego, compromise, desperation. People die. Lose their pension fund. Lose love. All for no real reason that we see of so just the way life strikes us most days. A gloom because it's all faced dead-on, simply the pain without story-drama that justifies. The same as his previous film except a little lighter even, with actual songs this time.But if you are still long enough, then what? A woman sings in a funeral about a next world without grief, loss, want. But of course the funeral itself like every other vignette here is not filmed to sadden or crush. There is a distance here from which all this gloom is filmed which is the distance in which whatever real grief, loss, want, we would normally perceive in these lives (say, in a melodrama) evaporates as if absorbed by the dingy walls.The same woman repeats the song a little later but now casually in a bathtub, her husband is putting on a shirt in the background, a window looks out to bright day. There is a routine in what we do, yes. Elsewhere characters measure a carpet, rehearse their bass drum for parade, shake hands for a business meeting. They all look like they haven't had a good day in years, none of them a hero, all of it inglorious. But just what of all this we see isn't a world without grief, loss, want? Characters suffer, or seem to, but do we as we watch? The whole thing was like a breeze of air lifting human pettiness and desperation and showing them to be flimsy curtains that can flutter and let air and light through rather than just hang.Where you put in life to always have a lover or a pension fund? If any of these go, like the guitarist lover the girl searches for, they have been returned. Something lingers in the air, a beautiful dream here of a moving house. And when you are negligent of the 200 year old china that you smash trying to perform an impossible tablecloth trick because it was a boring dinner-party (a hilarious moment in the film), does anything prevent you, if it comes to that, from taking punishment with the same smile as part of only another absurd game?Some poignant satire, but even better, the mind that would fret and despair over suffering is not here, a stoic mind is.A marvelous image encapsulates this worldview, a brass band is rehearsing in an empty room, one of them is standing before huge windows playing his clarinet while outside a storm is heard booming and roaring. We are small, yes, and the outside is vast. But what prevents him from playing his music against the storm? If something does, he will stop then.","I've been wracking my brain to figure out a good comparison in popular media to Roy Andersson's dark comedy You, the Living or Du Levande (2007). The best parallel I can draw is to Tom Wilson's comic strip Ziggy. If you are familiar with the comic, it revolves around a rather mundane little man, Ziggy, who always winds up being the butt of his own jokes. Luckily, Wilson's comic only appears once a week and is four short newspaper frames at most. You, the Living sadly perseveres for an hour and a half.The film is made up of dozens of vignettes. Some are very brief glimpses while others last uncomfortably too long. Almost every scene is taken in a single shot with a wide angle, with the camera positioned in one spot. Occasionally there are slow zooms, or pans that shift so slowly that the viewer is unsure whether the camera is actually moving or if they are just becoming drowsy from staring so long at an unchanging scene. I have never seen anything filmed like this before, with so few shots and perspectives. Most filmmakers try to engage the audience with diverse composition; this felt more like I was watching a play because of the static angle. It also had a theatrical quality because of the set. I found the set to be very pleasing to the eye. It reminded me a lot of Wes Anderson's films because everything in it seemed very deliberate, like it was in exactly the right place. This contrasted with the subject matter; the majority of characters were disheveled and were going through existential crises. They seemed not to belong to the pristine world of this elaborately constructed set. Many of the vignettes began with a character breaking the fourth wall and addressing the viewer, \"Last night I had a dream,\" and the set successfully created the dreamy quality that many of the characters described. Andersson used colors that were very bright, vibrant shades and vibrant, but they were all washed out shades and seemed to be watered down. The fact that this film took place in contemporary time in an urban setting (an imitation of Stockholm) but all of the scenery was designed also added to the dreamy quality in which you know that you are in a specific place but it is different for some reason than the way you know it in reality.Though it was aesthetically well put together, when it comes down to it, I think this is a film that you'll either love or hate. I happened to hate it. It had aspects of the absurd in which there were scenes that could certainly happen, but they never actually would because they are far out. All of the characters were caricatures whose actions were disgruntling. They found themselves in awkward situations which were laughable and pathetic. It was like Family Guy because it was so stupid that I felt bad laughing, though that is not the strongest comparison because that humor is slapstick, whereas Andersson makes you cringe and chuckle at other people's misery. Usually, what began as humorous lasted half a minute too long, leaving me as a viewer anticipating the next bizarre event, tapping feet hoping to escape the current misery. Andersson admits that he has an expressionist influence, which I saw come through in this piece. The film was not so much plot driven as theme driven. It never focused on one character for too long but would switch between characters whose lives vaguely intersected. If any take away from You, the Living it would be, \"when something is bad, it can only get worse.\" In one of the early scenes, a man is practicing the tuba in his apartment. It cuts to the man in the apartment below, frustrated with the noise bleeding through the ceiling. He bangs a broom against the ceiling to signal the tuba player to stop, but his broom banging ends up knocking down his chandelier. This pretty much sums up the \"heads you win, tails I lose\" motif. You don't get to really learn any intricacies of the characters. Instead they are all seen as one dimensional and are defined by a certain type of action rather than as multi-faceted. There is no passion for any of them, and ultimately, you don't really care that they are in miserable predicaments because none of them have depth. This is ultimately a very bleak film and even if you find it more amusing than I did, it will likely still leave you disheartened.","You, the Living (Sweden, 2007) captures every day life's sorrows, joys, and regrets through the world's best medicine, humor. Roy Anderrsson, the director and writer of You, the Living, uses off beat sarcasm similar to that of Monty Python to portray short clips of unglamorous people from all different walks of life. Although many of the characters appear to be in the dumps, the whimsical comments and random actions in the background make for a somewhat lighthearted film.Within You, the Living there is no clear plot line nor do all of the characters have an actual name but they all a story to tell. The film opens with a frumpy middle-aged man snoring and fast asleep on a sofa. In the background you can see that there is a fake skyline out the window, which added a humorous touch on the set. The man suddenly awakes and states: \"I just had a nightmare\". This first scene set the anticipation for odd and out of place interactions.In addition to the snoring man on the sofa there are several other absurd and rather interesting characters. For example, there's the tuba player that announces he lost his retirement money while having unexciting sex with his wife, the teacher that cries in front her class because her husband called her a hag, the man that gets invited to a dinner party and sent to an electric chair shortly after etc. Collected together these characters create a theme of the common man's life and how dismal yet silly it can be.A way that these strange characters escape their dismal lives and find deeper meaning is through music. Some of the characters are members of a Louisiana music band that plays at rather strange venues. Each individual member of the band is given their own independent life snapshot; showing them practicing their music while having rather boring lives. Though their lives are unexciting they're band is a offbeat and quirky. For example, the band plays upbeat New Orleans music at a funeral, which at first appears inappropriate. That is until a woman accompanying the band sings a song about living in a land without tears or sorrow. The song combined with the place and circumstance added to the nature of the film as I found it comedic, touching and somber.Intertwined with music there is a theme of desiring to be loved and feeling unloved. Anna, a hopeless purple boot-wearing romantic, desires to be with, Micke Larsson, the lead singer and guitarist of a punk rock band. Anxious to see him, she practices telling him that she thinks, \"he sounded great\" at the show, she wishes he called her, and ultimately that she loves him. None of these words are actually spoken to him, which reveals her desperate nature and desire to be loved by him. Towards the end of the film, Anna describes a dream in which she marries Micke. The dream has Micke and Anna post wedding relaxing in a moving house. The house comes to a standstill in front of a crowd of random people that congratulate them on their marriage. The scene was rather bittersweet because the dream was whimsical and charming but the reality is that Anna will always long for his love.Though all the characters faced quite different hardships one consistency was having random people with blank stares scattered throughout the majority of scenes. Literally almost every scene had a random nurse or bystander in the background that would stare directly at the camera as someone talked. At first I thought the stares were just to add comedic effect but it also brought attention to those in the background. This effect made me wonder who the main subject was of each scene. Additionally, it showed that extras could have an impact on the scene greatly when in a position to stick out.The director, Roy Andersson, used many camera techniques to make the scene comical yet bleak. For example, he used dark colored lens to show the baseness of the plain character's lives. In contrast with these colors he had fake painted skylines that made it hard to take the scene seriously. The majority of Andersson's scenes were used with a tripod and showed the entirety of the scene. This made me feel as though I was an additional bystander observing these people's lives whether it was from across a street, through a door, or against a wall.Overall the film was quite absurd and mildly entertaining in some scenes. I would recommend this film to anyone that like's Monty Python's humor and doesn't need an in depth story line to be entertained.","Roy Andersson has become known for his deadpan, surrealist, and often-dark humor. You, the living is a great example of that. It deals with the lives of ordinary strange people with no real connections until you look closer and notice the details. For me, that is what makes this movie funny, sad, and artistically impressive. Andersson is known for tending to use unprofessional actors in his film, which add to both the realness of the reality he has created and the offsetting surrealist feel of the film. Thought You, the Living, Andersson has the actors monologue about their lives (often breaking the fourth wall) with whatever grievance or happiness is afflicting them. One woman (in a very famous scene) reflects on a dream she had in which she married her crush. Another woman cries as her class watches because her husband called her a name. The acting is atrocious, but the sets are absolutely incredible, so that there is a strange disconnect between the actors and their surroundings. At the same time, their slightly off looks, pale dead-like faces match the sad, dreary, sterile feeling of the environment they are placed. The humor in this film tends to be completely oblivious to the characters, which is a sad commentary on the reality we find ourselves in. A great example from the film is the very sweet looking man who is practicing his drums. He is alone in a very simple room listening to music while keeping beat with his drum, which has been muffed. Partway through the scene, the door shuts behind him in a seemingly angry way, while the man notices, does not seem bothered and continues to play. Another example is when a man is recalling a dream he had while slowly passing the camera in his car (he is stuck in traffic) The entire dream is emotionless for him until the very end when he has the realization that the electric chair is a terrible invention.Andersson uses steady, long shots to capture this humor. Because of this, he has created a style that is entirely his own with no imitators or followers. This is partly because the shots and construction of the set are so detailed that other directors cannot possibly think of doing it in this way because it is so time (and money) consuming. When the woman talks about marring the guitarist. Andersson built that large set on a functional rail so it could be moved around and leave at the end of the scene. While digitally altering the film may have been more feasible, knowing how much work went into that one scene is incredible and makes watching it again, that much more impressive. In this sense I can really see the artistry in this film, even if I did not particularly enjoy watching it, I can appreciate the effort, time, and thought that went into each scene.For all its humor and incredible artistry, the overall message of the film is rather sad and depressing. Andersson tears about the way we think we fit into this world with his mockery of our feeble attempts to be something special. He even troughs the title in our face with a bit of sarcasm and perhaps contempt, You, the Living. With the sad monotonous way we live our life and pointing out the humiliation of our existence. Though Andersson has been critiqued for his seemingly blaming stance of society, he says he does it with a sad heart, and that his films are not meant to anger, but are done with understanding and sadness.You, the Living is supposed to be the second in a trilogy of films, the first being Songs from the Second Floor. His next and third film for this series is anticipated to come out soon. What I find interesting, is with his great success of his first movie, A Swedish Love Story, he was depressed about being pegged for a certain type of style and refused to make a sequel. After years of work (not with feature films) he has finally been pegged down to a style, but it entirely his own and of his own making. In today's world, even with a relatively new industry like film, that originality and creativity is what I find most impressive; especially with his work in You, the Living.","\"You the Living\" is quite unlike other movies. It is more like a series of quasi-comic sketches, or perhaps even a series of photographs of animated paintings. It opens with a man sleeping, for what seems an eternity. You must relax into the slow pace, that proceeds much the way real life does with long periods of the same thing happening, with what's interesting confined to a tiny dot of the screen, like watching a plane wreck from great distance. It is set in a very bleak, rainy, cold foggy Norway where interiors are painted shades of hospital green, and lit with cold fluorescent light. The actors are nearly all overweight or over 65. Only a tiny handful of the enormous cast could be considered photogenic. Nearly everyone is unreasonably grumpy and seriously depressed. The theme is selfishness results in ordinary cruelties. People create their own misery with their self-absorption. You have to stand back and see the humour or you too could be smothered in the gloom.","Some people are happy with a Matt Damon thriller, as well they might be; some folks want a weeper, a well-made tear-jerker like Hachi, which is well and good. Those of us who have lived long enough and seen enough films sometimes crave a new approach, not merely for newness itself, but because the challenge of a new viewpoint, the exposure to a cinema world unlike any other, is often fascinating and fulfilling.In his time, Griffith did created a new vision, as did Fellini, or Bergman, or Bunuel, most of their films not always huge at the box office, but leaving a mark simply because they changed the way people look or thought about things. Roy Andersson does just this, painting an extraordinary world without a conventional plot line, without the usual throbbing soundtrack, without even professional actors--but if you allow yourself an immersion into his strange, lonely world where all those folks suffer miserably like so many other desperate souls, you will experience something in its own way like Chaplin and Keaton, often weirdly hilarious and sometimes terribly sad. Andersson's world is distinctively unusual, sometimes appearing static and monochromatic, often springing briefly to live only to sputter out suddenly, leaving the viewer contemplating what might have just been before being taken into the next field, the next room, the next life. Both distressing and oddly hopeful, experiencing Andersson's You, The Living and it's match, Songs From The Second Floor is unlike any ordinary narrative but vividly memorable.","Some people think of Sweden in a negative way: too neat, too clean, too serious, too organized and too Northern. A people tortured by their own religious fate and history, sometimes leading to depression and compulsive heavy-handedness. This need not be a problem for a filmmaker, as for example the late Bergman has shown us what can be cinematic possible under these conditions. Bergman used his identity as a starting point and did not explicitly comment on this identity as such.Andersson however does the reverse: He comments only on this identity hereby dissecting his people to the bone: In his world Sweden is equivalent for hell on earth. But he does not take this any further and for me this is just not art but merely annotation. Despite the exceptional amount of time it took to make this filmmaker has serious limitations he clearly cannot step out of.Compared to his previous movie Sånger från andra våningen / Songs from the Second Floor, there is also not much progress to be observed. The intention was that this was more accessible, but the difference is minimal and the few scenes that try to please a larger audience aren't the best in the movie. The same absurdism and minimalism also still apply, there is the one-shot camera position and the (lack of) action in front of this shot. Yes, the stills are well done, some of the scenes actually work and the coloring and positioning is amazing. But does that make an interesting movie? Thinking in a negative way, this is cinema taken a step backwards.Andersson's background as a maker of commercials shines through in the elaborate setup, but I find his movies about as empty as those commercials. There is a message about mankind, but it is trivial and without much depth."],"review-user":["andrejs-visockis","carinaroo","Robert_Woodward","movedout","howard.schumann","oOgiandujaOo_and_Eddy_Merckx","Cris_Kelvin","Apollinaire","sioenroux","MOscarbradley","ellkew","tombrookes2007","scottt-941-965183","G_a_l_i_n_a","ThreeSadTigers","secondtake","Ron Plasma","Chris Knipp","chaos-rampant","paynemcm","pretzelqueen880","joyce-944-386139","roedyg","museumofdave","diand_"],"review-date":["11 September 2007","6 October 2007","25 May 2008","6 April 2008","30 September 2007","31 March 2008","25 May 2007","11 July 2007","14 November 2007","20 May 2008","13 June 2008","7 September 2011","6 May 2014","18 June 2011","26 August 2008","15 January 2010","20 April 2008","5 November 2007","5 January 2015","5 May 2014","3 May 2014","2 May 2014","31 March 2013","4 March 2013","21 January 2008"],"review-rating":["10","10","9","7","9","10","10","10","9","8","10","2","9","10","8","7","9","5","7","7","10","5"],"review-title":[" A dreamlike reality or a realistic dream?\n"," An intimate insight into what makes us all human\n"," This is a wonderful, human film.\n"," There's an endless fascination about where the film wants to take us\n"," Another cautionary tale in Andersson's unmistakable style\n"," ...and smash us all to bits!\n"," Perfect Cinema; an amateurs review.\n"," Better and more complicated than 'songs from the second floor'\n"," a beautiful glimpse of humanity\n"," A slice of life unlike any other\n"," Life as we don't know it\n"," This is a wild, weird, ARTY, foreign, pointless trip.\n"," Piddling their lives away\n"," \"Man is man's delight\"...or is he?\n"," A worthy and occasionally very funny continuation of Andersson's typical cinematic approach\n"," dry, uproariously funny at times and ticklish at others, and stately...a rare one\n"," Eclectic Dreams\n"," Schadenfreude\n"," What prevents you?\n"," Bleak at Best\n"," The Wonderful and Terrible Snipits of Life\n"," You, the Dying\n"," Unique -- truly one of a kind\n"," A Different World Seen Through Distinctive Eyes: A Modern Masterpiece\n"," Tableaux non-vivants\n"]}