{"review-url":["http://www.imdb.com/title/tt0409878/reviews"],"review-text":["A few bratty kids unwittingly unleash an evil that has lain dormant for the past twenty years and have to reap the ill fortune that comes with that.The Campbell Brothers' film before this \"Midnight Skater\" was fun & their picture after \"the Red Skulls\" was all right. So why is \"Demon Summer\" so mind-numbingly bad? I really don't know, it IS better then their \"Splatter Rampage Wrestling\" but not be much as the basement level of acting is cringe-worthy and when a 'horror' film is as talky as this one is, that's not a good thing. The story's been done to death in many other better films, so why waste your time on this one? My Grade: D-","I understand that the budget was low on this film, but come on this is really terrible film-making. The script is just plain awful and that was the free part. The effects aren't bad, but this film plays out like a conventional R-rated movie with lame scares and cut-away violence rather than a no holds barred unrated gore-fest that was intentionally made for video. Who were these guys kidding? Like this would have been released in theaters.The acting is terrible. The editing, another free aspect of the film, is beyond amateur, and the plot, as I said before, leaves little to be desired. There's nothing original about the film. Gore fans, avoid this one. To the filmmakers: try for something original next time, or stop making movies all together. You're not good at it. People hate a trashy rehash, especially one of such low caliber. AVOID! It isn't even worth making fun of.","I own this movie. I am actually from the same town as the brother directors. But that doesn't make the film any better. But, if one night you wanna watch something not serious, and don't have and high expectations, I strongly recommend Demon Summer. Yes, the lines are cheesy and the plot is corny. But it contains key elements of a horror/comedy. I just wanna see some small-town kids make a movie full of effects. And I say \"bravo\" to the Campell brothers. They are now making more movies and continuing a long dream. Demon Summer was one of the movies that are gonna help them start a great career with a great future. Speed Freak Productions and Compound Pictures described in one word: POTENTIAL","Aimless teens on summer break in a small Ohio town can't find any meaningful ways to fill their time. Some consider driving to Chicago; others are content to drink and bully their peers. In a random act of alcohol-fueled arrogance, the bullies rough up a homeless man and steal a strange book. The handwritten text turns out to contain archaic spells designed to summon demonic forces. A night or two later, one of them reads an incantation and is quickly possessed. He turns into a vicious killer and begins to quietly prey on his former peers.\"Demon Summer\" is an amateur production with a microscopic budget. The production values are low, but the filmmakers were smart enough to not be ambitious. Little in the way of special props or shooting locations were needed. The acting is especially weak and there is virtually nothing original in the screenplay. On the positive side, the special makeup effects are surprisingly good by low budget film standards. Despite this, the gore is minimal. Makeup effects aside, there is little going for this film, even for die-hard gore-hounds. Not recommended.","I understand that these are just kids, but come on. There's nothing in this movie worth seeing other than a few moderately attractive bad actors. Horrible actors, really. Here's my impression of how the writing sessions went: \"You know that movie Evil Dead? That's a great movie. Let's make a movie just like that one, but different in various transparent ways so most people won't realize we ripped it off! Yeah! *high-fiving*\" There's even a demonic book with strange ancient writing that calls forth demons when passages are read aloud. The production values are beyond poor and the acting is so bad that you'll wish you had gone to your niece's 4th grade school play instead of watching this turd of a film. If that's not bad enough, the only likable character in the whole movie dies at the end (the girl in the red shirt), ruining the potentially uplifting ending. Of course this is an attempt at a \"surprise ending,\" but it only serves to make the audience wish even more that they hadn't taken the time to pop this one in. If you want to see a good low-budget zombie movie, check out Undead or, better yet, dust off your VHS copy of Evil Dead (we all have one). Don't waste your time on Demon Summer.","I have seen so many horror flicks up to now, must be a few thousands. I started in 1982. I always liked the independent more than the Hollycrap productions. And of course some people do hate the ultra low budget ones. I always try to have a look to them because sometimes a gem is made. This flick here is not a gem and the acting is as wooden as it can be but somehow I kept watching until the end and enjoyed it. It's clear to see that it had no money involved, no extra lighting and I guess editing done on a computer. The editing, especially in the beginning wasn't good at all. Further on it gets better. This was made by a bunch of friends who already played together in other flicks and that reminded me of Sam Raimi and Bruce Campbell. You know, also some friends who made Within The Woods and look what they did with it, it resulted in Evil Dead. Brings me back to Demon Summer. The demon did remind me a bit of the demon in Within The Woods or even Evil Dead but than with very simple effects, I guess it was made from papier-mâché. Secondly a book is the reason why the demon(s) come alive just like Evil Dead. As I said, the acting was really wooden and exaggerated, the only one who could convince me was Ashleigh Holeman (Eva). On part of the effects, for ultra low budget they looked rather okay. So the story we we have seen a thousand times but still a nice effort for such a flick.Gore 1,5/5 Nudity 0/5 Effects 1,5/5 Story 2/5 Comedy 0/5","I rate movies on this site all the time, but I don't normally write comments. However, in this case, I felt compelled to WARN OTHERS! This movie is bad! It's probably one of only a dozen movies I have scored as '1 (awful).' I know people say this all the time, but this truly was one of the worst movies I have ever seen. It's easily on the bottom ten, anyway.When it comes to horror movies, I have very low standards. I'll overlook all sorts of shoddy film-making for a good scare. But this movie is embarrassingly bad. It looks someone bought a video camera at Sears and decided to make a movie with his buddies. (The fact that every single crew member's name appears in the cast list proves this theory, I think.) This movie has lower production standards than your average high school play. It's actually a little shocking to see a movie that looks this bad released on DVD. The special effects are somewhat effective at times, but are still amateurish at best. The best thing that can be said about the actors is that at least they remember no to look into the camera, most of the time. I can't say for certain if they struggling to remember their lines or making them up as they went along. Any and all attempts at humor are lame. This movie is such a colossal waste of time.","Did you ever think, like after watching a horror movie with a group of friends: \"Wow, this is so cool! We have got to make a splatter horror movie ourselves some day soon. I bet it isn't as difficult as it seems\"? Well, this must have been what went through the minds of the young Campbell brothers back in 2003, presumably right after watching Sam Raimi's \"The Evil Dead\" or a similar independent horror classic. This \"Demon Summer\", however, is so bad it's embarrassing! These young amateurish filmmakers obviously worship the horror genre and know their classics, but that nearly doesn't make them talented. I've seen quite a lot lousy B-movies in my years as a horror fanatic, but this honestly ranks as one of the biggest pieces of crap ever made. And it's quite sad to be this open-hearted, because the whole cast and crew clearly had good intentions. There's pretty much no script at all. A duo of thugs simply steals a mysterious book from a bum and, whilst reading some passages of it, one of them mutates into a hideous demon that starts killing off members of all the different teenager-groups: dorks, hot Catholic girls, stoners and troublemakers. That's about it, except of course for all the obligatory clichés, like the hot girl falling for the biggest dork etc etc... The performances are really painful to listen to and none of these annoying teenagers use mimicry! They just stand there motionless until the script says it's their turn to interact. I hate that! Some of make-up effects are remotely decent but still not spectacular and the soundtrack contains some of the most awful punk-songs ever. This film should never have been released... I can very well imagine that it must have been fun to be a part of the production, but it's utterly imbecile and doesn't feature the slightest redeeming element. Not even a bit of amateur-nudity, damned!","While this film might not be the next Evil Dead ( Hell who knows maybe it will, it has only been out for a year) It is worth a look. Don't expect a $10 million film. cuz you'll be disappointed. DO expect to be entertain, to laugh, and to enjoy the experience.All in all this film is MUCH better than many if not all of the low budget horror films out there. I have seen films that spent more than 10 or 20 times what this film cost to make and turned out 10000000000 times worse. The effort that was put into this film far out weighs the set backs it faces by having a limited budget. Movies are meant to entertain, and this movie sure does that. In fact this film might even open up new doors for you in movie watching. It's available on Netflix if not your local video rental store. So watch it, then decide.","Another amusing low-low budget horror movie from the brothers Campbell.Two thugs steal a 40 of malt liquor from their small town's resident drunk/crazy guy, and also steal a mysterious book from him. For fun, they use it to try to conjure up a demon, and in fact a demon possesses one of them. Meanwhile, various guys are trying to compete for various girls' affection, and vice versa.As with the Campbell's Midnight Skater, there's a fairly large cast of characters here, but they're all pretty easy to keep straight. A lot of them are quite sympathetic, so you feel bad if bad things happen to them. Acting is amateur-level for the most part, and yet in most cases better than a lot of higher-budgeted indie horror flicks. The women are all quite attractive too. I think at least some of the cast and crew will move up in the field if they want to.Gore effects are pretty good. Lighting was better than in Midnight Skater, though the camera still isn't so good at capturing night scenes.Some scenes are fairly well shot, or memorable. I liked the jogger stepping in a puddle of blood. One powerful shot had a woman backing off from her date after he was hurting her somehow, and he swung out his arm, breaking a light and plunging the room into darkness. Nice.Quite entertaining for its low budget, and recommended on that level. I saw this (and Midnight Skater) as part of Brentwood's four movie \"Skinned Alive\" DVD box. It's also available separately with extras that are not in the Brentwood set (I have not seen those)."],"review-user":["movieman_kev","trivin-2","keefey45","JHC3","lasombra_5","trashgang","spazzztic","Coventry","emulsionfilms","FieCrier"],"review-date":["17 December 2008","1 April 2005","3 August 2006","6 February 2005","14 February 2005","5 March 2012","3 February 2007","26 December 2005","3 February 2005","10 June 2005"],"review-rating":["1","1","10","2","4","1","1","10","6"],"review-title":[" awful\n"," Beyond Horrible. Do Not Watch!!\n"," A good flick if you don't expect greatness\n"," Not recommended\n"," Crappy.\n"," ultra low budget with rather good effects\n"," This movie is bad. Really, really bad.\n"," Ouch! ... Painful!!\n"," Worth a watch\n"," another entertaining low-budget gory horror flick from the Campbells and friends\n"]}