{"review-url":["http://www.imdb.com/title/tt0431418/reviews"],"review-text":["Even by the standards of most B-movies, this movie is by far the worst I've ever seen. The graphics are so poor that a man in a monster suit looks more realistic. the ocean water effects are especially laughable, including the one scene where they board the mini-sub, and the \"water\" looks like its frozen in place. The problems with this film are so numerous that I'll just stop here with the details. needless to say, I kid you not when I say that even Uwe Toilet Boll himself could do a better job. Avoid this movie at all cost, there are other B grade movies out there that, despite being horrible, are at least a good way of passing the time by.","Some giant scorpions are on a submarine and kill everybody. Two months later, some Marines and the scientists in charge of the scorpion project go to the sub to retrieve their cargo. After finding 200 dead bodies, the Marine commander tells the doctor \"I need to know if there's anything down here that could be a danger to my men\". Uh, gee...ya think? She refuses to tell him what is down there, citing \"need to know\". Yup, that pretty well sizes it up. One of the scientists is apparently some sort of idiot savant - real heavy on the idiot, light on the savant. He's given the task of fixing the lights. He finds the control panel for the lights, cuts a wire, and shrieks like a banshee. Then he does it again. Then he takes a hammer and smashes the control panel to pieces, which causes all the lights on the submarine to start working.And so it goes. Apparently this was made in Sweden; I'm not sure if the Swedes have a really weird sense of humor or if they're just really awful movie makers. I'm inclined to think they're awful movie makers. If you guessed that there's a huge explosion at the end of this thing, well, sorry, but that's on a need-to-know basis, so I can't tell you.If you've absolutely got to see a giant scorpion movie, let me suggest Tail Sting, which is a cheesy and fun movie about scorpions on a plane, or Bugs, which is a fairly descent B movie about scorpions in a tunnel. Look at this movie as an absolute last resort. Oh, it's watchable, it's hard to turn it off just because of the sheer lunacy of it, but that's about all it's got going for it.","There is so much bad to say about this movie and so little that's good!The plot has enough holes to sink the Titanic, the characters are completely unbelievable, the monsters are so unrealistic, and I'm sick and tired of seeing movies that involve an ex-husband and ex-wife being thrown together in some bizarre emergency - it happens far too often in films and it's become another bad cliché.I find it hard to believe that anybody would have invested $1 in making this garbage, never mind the $100 or so it must have cost.You could make a better movie with more convincing special effects on your home computer! I didn't think movies could get this bad! Avoid it at all costs - do something that's more fun and enjoyable, such as having a tooth pulled, or an enema!","\"Stinger\" is a real by-the-numbers creature feature affair.**SPOILERS**Following the reappearance of a thought-lost submarine containing top-secret material, a rescue team, Dr. Carly Ryan, (Michelle Meadows) Dom Paterno, (Richard Froelich) and Miss Winters, (Daniella Vesterlund) with a squad of Marines are sent to the submerged sub. Upon finding the submarine crew in pieces, they decide to get the ship's cargo before anything happens to it. As they venture further and further into the sub, they are attacked and killed one-by-one by a swarm of scorpions. Revealing them to be genetically mutated scorpions, Dr. Ryan helps the Marines to get off the ship safely.The Good News: There's some rather nice stuff here. The best part is it's undeniable charm and cheesy feel. There's not a whole lot more going on other than those two, and the five the movie a nice little feel that will surely affect the more cheese-friendly fans out there. It's all in there for them to enjoy, and it supplies it quite nicely. The setting gives the film a great, claustrophobic setting that has a great feel to it. The circumstances around it make it all the better, as we know that they're trapped and that adds a lot to the suspense involved. The film does have some rather nice action sequences later on, and they're not quite that bad. The initial sweep of the submarine features lots of good gun-play, and a couple of chases later on aren't that bad either. The rest isn't all that bad.The Bad News: There are several things in here that weren't spectacular. The fact the film offers so few shots of the creatures is a good thing, as they look so bad and unrealistic that it's almost impossible to really be frightened of them. It's not so much that they're fake, but the fact that they're so obviously fake is what's distracting. Whatever is used to depict them in whatever scenario they're used, as either the CGI ones that get the most screen-time, or the robotic versions that are around less, the creatures are uniformly fake no matter what and shouldn't cause much of a scare. They are also seen so late in the film that the first half is mostly an inconsequential bore. Nothing happens other than getting them on-board and looking around. There's no way it should've taken up that much screen time, as other films have done it before with the same storyline and their's isn't anywhere this long. To say that this doesn't have any real originality at all would be useless, as it's one large cliché after another and really shouldn't have been brought up. All the hallmarks of a traditional creature feature.The Final Verdict: A nice little cheesy creature feature that doesn't offer much new and purely rests on it's tone and atmosphere to get it's entertainment from it. The fact that it's the best part about the film means that those that doesn't this kind of film will be bored or upset through the movie, and are therefore not advised on it.Rated R: Violence, Graphic Language and Brief Full Nudity","I'm a fan of low budget B-movies and campy horror flicks, but this was too much, even for me.If you can get past the weak plot, the cheesy effects and the uninspired acting, then the horrible writing will kill you, or you'll wish it would. The dialog was most likely written by high school stoners, who thought that saying \"sir, yes sir\" over and over again, made these guys sound more military.The characters were all the typical cardboard stereotypes: Gung-ho sarge, sorta gung-ho other guy with sensitive side, evil scientist with secret agenda (bald or course), bitchy brainy chick who would be hot if she tried too, dumb sexy chick with vital piece of information, idiot \"genius\" nerd, random other sorta military dudes who die soon enough, and spoiler character alert, crazy scientist who was in charge \"until something went horribly wrong\" Oh yeah, I almost forgot, there is a secret military (navy?) submarine, sitting on the ocean floor, 5 minutes from HQ (or so it seems), full of radioactive scorpions (ok?) and dead bodies. Your mission is vague and poorly defined.....If you watch this, don't say you weren't warned.","At the very beginning, the look at a control panel that reads \"8 miles of the cost of California\", and no, I didn't misspell that, they really did not realize the put of the cost instead of off the coast. These people must have been morons.It's good if you're into terrible movies, but the sheer fact they couldn't catch a simple spelling issue make me believe they really didn't put any effort into creating the movie whatsoever. The Navy uniforms are not correct at all in any manner whatsoever.Wow, completely ridiculous, but good if you are looking for something insanely stupid to watch. How these folks made any money off this is beyond me.","Stinger starts '3 Months Ago' on the submarine the SS Newark where genetic experiments have gone awry & the crew member are brutally slaughtered by large killer scorpions... Jump to 'Camp Pendleton' a couple of months later where General Ashford (James Cagnard) brief's Lieutenant Williams (John Miranda) on his mission to board the Newark & assist genetic scientist Dr. Carly Ryan (Michelle Meadows), before anyone knows it a group of corporate scientists & marines are on-board the Newark & are shocked to discover he mutilated corpses of the crew apart from Dr. Mike Thompson (Casey Clark) who doesn't make much sense. It's not long before the scorpions attack, first to fall is Lt. Williams so Sergeant Sam Harmon (Christopher Persson) is promoted & takes the responsibility to get everyone to safety & end the menace of the giant scorpions forever...This Sweedish America co-production was directed by Martin Munthe & he also handled the cinematography & I thought this was a strictly by-the-numbers uninspiring creature feature. It's early into the new year & Stinger is the first giant genetically mutated monster/creature/insect type film I've seen in 2007, hopefully things can only get better... The script by Mat Nastos is incredibly clichéd & gets all of it's ideas from other films most notably Aliens (1986), lets see there's the isolated location in this case being a submarine, there's the hastily assembled team of marines including one who chews on a cigar throughout the entire film, there's the scientists including a blonde Sweedish one to try & explain it all & the evil money grabbing corporate villain who puts the mighty dollar above human life & the final ingredient being the monster/alien/insect or whatever, in this case there's loads of large scorpions running around but they're not utilised in any sort of unique or imaginative way so they might as well have been killer grasshoppers. Yeah, it's all here, unfortunately Stinger isn't an Aliens if you get what I mean. It's a touch long at over 100 minutes & it's throughly predictable although it moves along at a reasonable pace & as a dumb creature feature you could do worse despite what many say on the IMDb...Director Munthe doesn't distinguish himself, it's not scary, there's a lack of atmosphere & the action scenes are dull & unexciting. There's not many scorpion attacks & it's almost an hour before any significant action occurs, the special effects are at the bottom end of the scale but I have seen worse that's for sure. I mean that's not to say the effects in Stinger are good but I've seen worse. There isn't much blood or gore, there's some mutilated bodies, some decapitated heads & someone is ripped in half. The only clever & amusing moment in the entire film is when the naked Sweedish female scientist ask's her lover to turn her on by talking about all the money their going to make from the scorpions... However there was a moment which had me groaning & tearing my hair out in it's stupidity as a bloke tries to repair the submarine's circuitry & get the lights working by hitting the power supply/computer boards with a hammer & it works as well...Technically Stinger is average at best & there's the usual endless amount of dark corridors which gets monotonous. Stinger was shot in Stockholm in Sweeden if your interested. The acting was poor & there's nothing else to say.Stinger isn't a great film & it isn't a great horror film either, I can't recommend it at all but I've seen worse. If you liked Stinger (unlikely) you might like the similarly themed 'giant scorpions on the loose' films Tail Sting (2001) or Scorpius Gigantus (2006) (just as unlikely).","The submarine USS Newark has been sunk somewhere off the coast of California\nwith some valuable material for new weapons. A team of Marines and scientists\nare sent on an investigation and salvage job in Stinger.What they find when they get there is the crew all dead with one civilian\nsurvivor and a bunch of table size scorpions running around the submarine. The\nnuclear reactor is taking the place of breast feeding.The no name cast will not fear for its reputation being associated with such a\nThanksgiving special of a movie. The marines and scientists start working at\ncross purposes. One of the female scientists strips down to her panties for\nseveral minutes. Even the sight of her ample mammaria doesn't raise any\ninterest in Stinger.It's pretty laughable, the biggest laugh is reserved for the ending when we are\nsupposed to be shocked.Stinger is bad as bad can be.","The film opens with some poorly done CG graphics of a submarine. These were not the worse CG graphics out there because they top it with their CG helicopter, mini sub, gun fire, and scorpions. The film has a high camp factor. If you are a fan of Asylum films for all the wrong reasons, this film is must see. The technical aspects of a navy nuclear sub are horribly wrong, far too many to detail. They could have at least had proper styled uniforms with appropriate insignias. And why does every movie scientist wear a white lab coat when they are never in a lab?The story line was bad too. Giant Radioactive Scorpions get loose on a nuclear sub and kill everyone (almost). A crew of Marines and civilians in a mini sub hook up with the disabled sub resting at 500 feet. Dr. Carly Ryan (Michelle Meadows) is the civilian in charge of the operation. She keeps the fact that there are deadly giant radioactive scorpions on board a secret as it is classified and they don't have a need to know. Ellie Winters (Daniella Kimber) is the other female in the crew because Michelle won't take her top off. Lazlo (Jordi Almeida) is the geek civilian who is played as being border line autistic. He manages to get the sub's ventilation system working by cutting random wires and beating the unit violently to a pulp with a hammer.The acting left much to be desired. The filler dialouge had excellent camp value. In fact I really hated for the plot to progress because the necessary plot dialouge was boring by comparison. There were a lot of dark scenes (as in lack of lighting) and plot continuity issues. At one point they decided not to bring back the deadly giant radioactive scorpions. The Navy doesn't want to salvage the sub, so what do they do? a) leave the hatch open when they leave and flood the boat. b) seal the sub and let the scorpions expire from an eventual lack of food and air. c) Decide to risk life and limb on a search and destroy mission in a submarine. The sound track was haphazard as they played foreboding ominous music at random times. The scorpions made noises that sounded like they lifted it from \"The Predator\" movie. Watch at your own risk.F-bomb, sex, nudity (Daniella Kimber)","This is a bad, bad B-movie. They claim there's humor but only it's clichés and TV references. A group of Marines are assigned to escort a science team from one of those research companies that experiments without considering the consequences. An experiment involving scorpions and nuclear power goes awry (as they always do). The female (who had been kept away from the males to prevent unsupervised breeding) gets loose on a military sub resulting in carnage and chaos. With a crew for munchies and males just waiting to breed - the female has a field day. How this submarine managed to float about the ocean without being spotted for two months is remarkable. I can only conclude the military simply didn't have enough in its budget to send out search and rescue. Two months is a long time to allow scorpions to run amok on a submarine. The dialogue is ridiculous, often boarding on idiotic at points. If you like watching soldiers waste bullets on non-existing targets, this is a movie to watch. I spent most of the movie hoping the scorpions would win. None of the characters are likable except Lazlo Hollyfield, an autistic science team member who doesn't live very long. Dom Paterno is one of those idiots for hire who is willing to risk multiple lives to obtain millions to return a living scorpion and an egg to the research company. His companion Ellie is only there to supply unnecessary T&A. Dr. Carly Ryan spends too much time on the Top Secret BS line companies like to give civilians and military put in danger because of company stupidity. The obvious solution to ensure the scorpions never reach the surface is to blow up the submarine. Dr. Carly and her buddy Mike (who is seriously suffering from PTSD among other things) are the only two who reach the \"rescue\" submersible the group had taken to the submarine. When the submarine explodes, there's no shock waves. There should be shock waves which would send the submersible careening across the screen. The submersible simply glides as if nothing out of the ordinary happened. The worst CGI appears when Mike reveals PTSD isn't his only issue. I give this a 4 because people worked hard on an obviously low budget to do the best the could.","This is an excellent B-film horror movie that borders between horror and comedy. It is about a genetically mutilated scorpion in outer space. Can it get more unreal? It is a hybrid between \"Alien\" and \"Chain Saw Massacre.\" The movie was shot in Stockholm with a mixed cast of Americans and Swedes that interact beautifully. Director Martin Munthe does a great job finding the comical highlights in this script and gets a few good laughs out of the audience. The movie was shot with little or no money and it is inspiring to see what can be done with limited resources. Stinger has all qualities of a B-film horror movie. It is comical and scary at the same time and the cast and crew are dedicated to their cause. It is great to see that movies like this can still be made! I would recommend seeing it if you like this type of films.","The crew of a nuclear submarine are massacred by a horde of giant, poorly CGI-rendered scorpions. It's the job of a team of scientists, along with a few marines and an idiot-savant mechanic to secure the cargo and return with a few specimens. Of course, it wouldn't be much of a movie if everything went according to plan, now would it? The storyline itself is pretty decent; no happy ending here since no one survives. The special effects are what ruined the whole thing. When the scorpions are blasted away it all takes place offscreen, owing to budget restrictions and a severe lack of creativity. The ending, though predictable,(the lone survivor of the submarine crew ending up as a human incubator) could have been shocking if not again for the horrific CGI-it was embarrassing to watch.If your'e into the \"giant bugs attacking mankind\" genre, see \"The Mist\", or even any of Bert I. Gordon's 1950's epics. Don't waste your time or money on this crapsterpiece.Rating: * out of *****","I think this movie was made as good as it could have been. With only 4 months and a 52000$ budget - I'm surprised this wasn't worse. If you are not to care about the CG or special effects, this movie is great.Okay, the movie is not that well made (I'm sure it could have been but, you try to do better in only 4 months) but the story is good and the movie is rather exciting.DOn't trust me when I say that this movie is good, cause I also find the 1933 King Kong to be good.I must confess that I didn't watch the complete movie either... I might have fast forwarded some minutes here and there..."],"review-user":["Iacton_Qruze","gtc83","imdb-3972","slayrrr666","eah51","christopher-marolt","poolandrews","bkoganbing","nogodnomasters","dafrosts","daniella-vesterlund","r-brasher","TobyVK2"],"review-date":["10 May 2006","10 August 2006","24 August 2006","29 October 2006","17 March 2007","30 April 2009","8 January 2007","28 May 2018","17 February 2018","24 October 2017","18 June 2006","29 December 2007","16 September 2007"],"review-rating":["1","3","1","6","1","1","4","1","6","4","10","6","10"],"review-title":[" Unbelievably Dreadful!\n"," It's laughable, but I'm not sure if it's a comedy\n"," The Worst Movie I Have Ever Seen!\n"," Average Sci-Fi Channel Creature Feature\n"," If I could give this a 0, or a -5, I would.\n"," Are You Serious?\n"," \"It's like someone came in here & tore through these guys like tissue paper.\" Below average creature feature.\n"," Marines and scientists\n"," Giant Radioactive Scorpions\n"," Seriously Bad B-Movie. Horrible CGI\n"," Excellent B-film horror movie!\n"," Welcome to \"Crapsterpiece Theatre\"\n"," Excellent Done, considering...\n"]}