{"review-url":["http://www.imdb.com/title/tt0465353/reviews"],"review-text":["I saw episode one by accident while channel surfing Sunday night. After about 5 minutes, I was hooked. I can still say the same after episode three last night.The show has the feel and look of a first-class feature film. In fact, this type of cable series should make feature film producers start looking over their shoulders. With shows like this and others like The Sopranos and Six Feet Under, HBO and Showtime have given the industry something to be very worried about - and deservedly so. I go to the movies about once a week and all I can say is Hollywood better get its act together.The cast is superb, notably Michael Ealy and Oded Fehr. Ealy portrays his character, an undercover FBI agent, with just the right amount of passion, conflict, and boiling rage. Fehr is evil incarnate, although you can say that Dylan's line, \"Sympathy for the Devil\" is right on the nose here  more on that in a second. What a coup (and how ironic) to have an Israeli actor play an Arab terrorist. In an interview, this gifted actor expressed his revulsion and loathing for what \"Farik\", his character, represents. It made the part the most challenging thing he's done so far. Knowing that, as you watch him execute his nefarious plans, makes him even more compelling. Casting non-Arabs to play the other terrorists was a stroke of genius on the part of the creators of the show, Cyrus Voris and Ethan Reiff. These people are like us and live among usa disturbing thought and a very real possibility that cranks the fear factor way up.The interesting thing about the way that these Islamic extremists are presented to us is that you can't help feeling sympathy for them. They are likable and, in their own warped way, virtuous. That's another aspect of the show that pulls at the heart-strings and adds to the biting conflict that is the mark of a brilliant drama.You can bet that I'll be watching the rest of the series being broadcast back to back (there is a God!) for the next two weeks. They are replaying most of the episodes throughout this week, so if you missed the first ones, you'll have the opportunity to catch up. I suggest you start with Ep. 1 if you can although each one stands very well on its own.","Far more than anything I've watched on TV in a long time, this entire series made me uncomfortable and uneasy. It wasn't just the reality of it, though that was unsettling, especially for someone who lives in the LA area and knows a lot of those locations.But it was the way I was relating to the characters, especially the members of the cell besides Farik. I would find myself agreeing with some of the things they said, or empathizing with them in some other way -- really, just seeing them as human. The show would start taking me down that path, and then utterly ruthlessly snap me back when those same characters did something to remind me of what they are and what they've become. Each time -- as much as I should have expected it -- it came as a shock.This is a great series, but overall, watching it was a pretty unsettling experience. It forced me to ask a lot of questions I simply don't have the answers for. And I don't think anyone else does, either. The best comparisons to other material would be to the films Traffic and Syriana, but because of the length (10 hours as compared to 2.5) and the focus on just a few characters, the emotional investment in this story was a lot greater.In terms of what to expect, this is not an easy to digest, fast-paced show -- I think the analogies to 24 are off-base in that respect. Yeah, it has to do with terrorism -- so do Victory at Entebbe and Executive Decision -- but really, it doesn't have much in common with movies and TV shows in that genre. The spiritual roots of this series are in material like Wiseguy (to which there's a nice tip of the hat in episode 5), or Donnie Brasco, about the experience of an undercover agent. If you are expecting lots of things going boom -- well, this might not be what you're looking for.The performances are top-notch, especially Michael Ealy and Oded Fehr. The entire series has a sense of realism throughout that keeps the tension strong throughout. Just excellent work all around, and Showtime deserves serious kudos for upping the quality of its original offerings with a series like this.","This is an extremely involving series that is well casted and portraits a sensitive subject with great splendor. We follow Michael Ealy as the undercover FBI agent Darwyn, set to infiltrate a terror cell lead by Farik (Oder Fehr). The series is very well written, and has enough plot twists to keep you sitting at the edge of your seat waiting for whatever happens next.Michael Ealy is by my definition one of the best actors I've seen portraying an undercover agent. Icey cold on the outside, but still a good human being underneath trying his best to keep his head afloat in a highly emotional roller-coaster ride that FBI has had him embark on. Oder Fehr on the other hand comes off a guy that pretty much could fit into any social scenario. Big and strong, but yet able to disappear into the gray mass if so needed. Highly authoritative and extremely cunning. The way the two communicate on screen is nothing short of spectacular.The way the story develops, and the level of detail that the script offers makes the whole story extremely believable, and also very true to life I would imagine. It is of such magnitude that you're left with the feeling of being insecure, not knowing what might happen next in real life. We read about terror every day, and here we are given a good sneak peak into an underworld which most of us know very little about.It's a series that will for sure have you coming back for more, sitting there at the edge of your seat just waiting for next weeks episode to come on. It's a sure winner in my eyes, and I have no problems stating that this series is on my list of all time best.","I happened to catch the first episode of the drama Sleeper Cell, while flipping through the channels and got hooked in 15 minutes. Its the story of an American Muslim working for the FBI going undercover and joining a Muslim terrorist organization that is hell bent on bringing chaos and terror to America.What makes a drama tick is making the viewers involved with the characters. One must feel for the people in the story or else it just becomes a bunch of people on TV. The show gives adequate information about the main character, Darwyn Al-Hakim and his reason for going undercover. Oded, who plays the leader of the cell, gives a very chilling ice-down-the-spine performance. the rest of the team members are all non-Arabs and they have a reason to be here, or at least one of them have. They make you feel for these people at the same time make you feel bad that you are actually feeling sorry for the bad guys. THats what is called drama.I'll have to now soon get this on DVD for my collection because i feel that this is going to be one of those really good TV series that are too short but worth it, like Band of Brothers.","I read the first comment with interest and confusion. I find this series to be incredibly good. So much so that it is difficult to watch because of the feelings, mostly of fear, that it generates. Michael Ealy, as Darwyn, is performing fabulously. You can see and feel the conflict and stress his character faces as an undercover agent with the sole responsibility to uncover and prevent a major terrorist event.And Oden Fehr as the cell leader is downright frightening. He's extremely good looking, charming and very easily fits into 'Anywhere' America. His cold blooded anything for the cause attitude is so scary.What's the most frightening is that this cell isn't comprised of 'obvious' enemies. Probably very much like real life. We can only hope there are really a few Darwyn's out there as well.I'm hooked!","The only thing worse than the suspense of this program was the arrival of the closing credits.The title tells the setting. Saying more would detract and it would be nearly impossible not to be a spoiler as well.If suspense, plots twists, good acting and believable plots are your cup of tea then you are in for one fine treat.The casting was perfect, as was, on the whole, the character development. Every performer was very believable in their roles and thus I did not have to be annoyed by the usual weak performer that pulls down the entire performance.If all television was this good I would become a full time couch potato............pass the sour cream please.","I watched Sleeper Cell with a bit of trepidation worrying over whether the terrorists would be glorified. This mesmerizing series not only handled the subject matter responsibly, it created depth and substance to almost every character. Oded Fehr just gobbles up the screen in every scene he's inand even though his character is the charismatic leader of a jihad terrorist cell, he still has hypnotic appeal. Michael Ealy held his own well, though in some scenes I wondered why he wasn't shot on the spot because of the scowl he wore on his face.The pros of the series are the two leads, Fehr and Ealy, the well written characters--all of which were believable and tragic, and the disconcerting issues addressed in the story. Having been married to a Muslim myself, the atmosphere created was quite realistic. The cons, for me personally, were that the female T&A was overkillmost seemed gratuitous, as well as some of the sex scenes. Despite that, it is a raw gripping series that will make you think. Somebody give Fehr more juicy roles like this one and let him run with it. He's got incredible screen presence and a strange kind of innate power emanating off him.","This series is one of the greatest I had ever seen. It has it all , great performance , great writing , ingenious plot and the list just goes on....The very basic plot is a very genuine one, and it is something I, at least have never seen in a series, so many twists so many characters, so many morale and religious issues in just 10 episodes...I enjoyed every second watching this series, and just want more.. and I strongly recommend watching it too.10/10 - what else can I give it? watch it you'll know what I'm talking about.HellozL","First Season was gripping, edge of your seat action/adventure/mystery possibly the best TV of the year.Season two took a page out of the 24 writers book of how-to's, take a great idea with a handful of characters the audience really cares about and ruin it by adding eight handfuls of characters you could really care less about. The story gets stretched thin by the end of the first episode with eight new characters on top of the characters from the first season, plus you have Darwin not wanting to go back to UC work but as every TV cliché would have it he is pulled back in against his will.This is not what viewers of the first season signed up for, we signed up for a great story that was as realistic as it was hard hitting. Not cliché characters, a bumbling idiot boss, the hard-ass parent with whom the main character has to reconcile with, the evil character who has a softer side, the Mexican ex-con with gang affiliations, the tough guy who you find out is gay, let me see if I can think of anymore characters that could be in any number of lame TV shows from the 70's to todays crappy programming? How about the girlfriend that is asked to choose between her man and her child? Or the woman who at any moment can blow her man's cover by speaking to the wrong person.Season one main characters: the cell (4) the girlfriend (1) the boss (1) Season 2 main characters: the cell (5) old cell (2) girlfriend (1) the boss (1) dad (1) lover (1) military good cop bad cop (2)","I love the show. The acting is great and I think Alex Nesic will be one of our sexiest men in the future. Now I must note that the first show had an error that was quite blatant to me. The penitentiary in Lompoc, California is where I used to live. It is not pronounced \"Lompak\", but is pronounced \"Lompoke\". I was surprised that was not noticed and corrected. Also I wonder how Darwin gets by with carrying and using his cell phone w/o question? That I find confusing. I would think the leader would get that phone and check the calls just to keep a good check on the members. Other than that, I look forward to the episodes. Can someone tell me what nights this will be on and what channel? thanks.","I am in law enforcement and have studied terrorism and counterterrorism under instructors of the Israeli Shabaag and Turkish National police. I will tell you that this series is very accurate in its portrayal. Islamic Fundamentalists are attempting to find \"Shaheeds\" that look nothing like an arab. As a matter of fact, some blonde hair blue eyed \"Swiss?\" nationals were arrested because of their activities. This show is scary because of the accuracy it provides. The guy with a long beard, a kufi, and wearing the long robes are going to be the last guys to carry out a plot. Prisons and centers for higher education are breeding grounds for recruitment.","Maybe I'm jaded since I saw Homeland before I saw this badly acted, poorly written attempt at PC schlock, which seeks to always underscore that the religion of Islam is not the root cause of any violence...just a bad interpretation of it. They accomplish this by repeating the \"warm fuzzy\" parts of the Qur'an through the \"good\" Muslim lead character, but fail to mention that Muslims have been warring since the time of the founder of their religion, and conquered all of North Africa, much of Southern/Eastern Europe and the middle east through violence; the SAME violence happening today, only Western technology has finally trumped Islamic theology. Just bad. Watch a Mohammedan propaganda youtube video for the same level/amount of believability.","Very dull show. Whats worse, its very racist. The white guys are dumb idiots and the only romance is between a black guy and a white woman. There is nothing interesting about this romance, it is not exciting, it is not fun, they don't even seem to care for each other at all, its more like the writers and directors wanted an interracial thing going on. Why this is so popular in media today? It is social programming and will lead to no good, there is always tension when too many people want the same thing. This show is not worth the 20 bucks for the season, its a waste of time and harmful to society. At least when they use TV shows to sell products they are more discreet, selling whatever agenda here is quite obvious, and without clear thinking some may feel wrong to oppose it, but some of us know better.","I hoped for this show to be somewhat realistic. It stroke me as just another mainstream show after I watched it. I didn't feel the characters at all, is this Americas glamorized idea of how terrorism operates? The main character doesn't act like a fundamentalist at all, and how he passes for a terrorist is beyond my comprehension. Neither of the other terrorists managed to appear genuine. One of the members, a blonde all-American white boy, would never be accepted by Muslim terrorists in real life. Another member, a french ex-skinhead, doesn't quite fit in an Islamic terror movement. On top of this the terrorists have sexual relations to white American housewives, which I find very strange. This is just another stupid misguiding American TV show. It is about just as realistic as Prison Break.","The nature of the terrorist threat facing America is certainly complex and multifarious: it is also almost certainly nothing like the threat depicted in this drama series about a terrorist cell, with its Dr. Evil-like figurehead, square-jawed FBI agents, and a hero who, predictably, allows his love life to interfere with his professional one. The concept of the series is itself problematic, the premise is spelt out at the very beginning (terrorists plan a horrific attack) so one knows that any intermediate dramas are ultimately red herrings, destined to come to nothing before the big one at the end. The program also suffers from an overdose of solemnity, there's no sense of humour and very little humanity (in either the script or the characters), and the earnest attempts to balance the emphasis on Muslim fundamentalism with a show of respect for true Islam is clumsy and vaguely risible. Glossily-produced and with a pertinent subject, 'Sleeper Cell' can be considered a wasted opportunity. Steve Earle, in his three-minute song 'John Walker's Blues', offered more insights into why an American might become a terrorist than this series manages in almost eight hours.","Yeah, there's a \"sleeper\" watching Sleeper Cell and it was me. After reading comparisons to \"24\" (like on the cover of the DVD), I expected a fast-paced action romp. But nope... this series just putts along. In my groggy half-awake state I would think, \"He's gonna... \" and, poof, it would happen... \"Guess that van is gonna roll off the... \" and there she goes.And so on.And why would Darwyn, in extra-deep cover, pursue a babe? Could it be, perhaps, to provide a little T&A? Hey, that works for me, hence four stars rather than three.This show is no \"24\". I've watched \"24\". Sleeper Cell, you're no \"24\".","You can watch this show,but it's too many holes in it, FBI agent infiltrated can almost any time find a place and time to call with mobile phone (given by the leader of a group)FBI stuff,extreme caution man like Farik will never check the phones of his group and numbers?I don't thinks so. One thing made me angry - how someone can spend bunch of money for a show and don't pay attention of some little but important things,NAMES! If you wanna write about something you should learn some basic things about subject,name Ilija Korjenic is not Muslim name,it's strictly Serbian name,i never heard that any Bosnian Muslim had a name Ilija,thats a common Serbian orthodox name,surname Korjenic maybe can be surname of some bosnians muslims (long story why),but name Ilija it's ridiculous, to try to explain on some similar example - can you imagine some ordinary man from Japan,both parents are Japs and live in Japan and his name is Andreas Jacobson - i don't thinks so,Miura Takanabe sure,but Andreas Jacobson?Than also they could give the Farik name Isac or Abraham,just for fun. So if you did not make some basic research about little stuff like common names,I can imagine quality of show.","I do not reveal the \"ending\" of the show in this review, i just spoil the content of 2 episodes ;-) This show i believe is a mini series, since i have seen all 9 episodes and it appears to \"end\" on the 9th episode. It saddens me because this show had the potential to be extremely good. The strangest thing about Sleeper Cell is if you only see one episode you will have a completely warped perspective on what political message the show is trying to send. let me give an example, the first episode made the al queda sleeper cell to appear extremely non descript, 2 fluent naturally English speaking Arabic men, 3 Caucasian men, and 1 African American Muslim. The goal of the show at first seemed to be \"lets scare the Sh*t\" out of the American public by making them even more paranoid about terrorists than they already are. The terrorist cell acted like the Joe pesci, deniro, and Ray liotta in Goodfellas. In the first episode they confront a fellow member by burying him up to his head in sand and stoning him to death for bragging to his friends about their planned attack. To me it was even more charactered than a Mafia movie. So my thoughts were after the first episode were \"Wow this is definitely some sort of anti Muslim, scare American, propaganda show\" but i was extremely surprised that in a following episode the political message seemed to completely 180. A young Muslim boy from Afghanistan comes to America hoping to be recruited to the sleeper cell. Through out the episode we learn that he was wrongly accused of being a terrorist by the American, when he was actually a farmer in Afghanistan. His rival neighbor had sold him and his family out to the American army for a large cash reward. You then follow his story to the Abu Garib prison where he was tortured over and over again until he admitted he was an Al queda member. Upon his release, by this time he had harbored so much hatred against America that now he actually wanted to commit terrorism The episode almost tried to make you sympathize with this character for \"the Americans turning him into a terrorist\".very strange show indeed, although sometimes very campy and hard to take seriously, this show still makes me paranoid, question the war on terror, and realize that a terrorist attack either real or hoaxed can happen at any time.","I don't understand why this show didn't go on there could've been various ways to continue on the line of Darwin and Farik after season 2, obviously Darwin couldn't have been the UC agent infiltrating cells and sabotageing them from the inside, but still they should've given this show at least another season.The show is well casted, believable, and views the Islamic religion from both the normal and the extremist point of view. It touches controversial subjects in detail and it has a dramatic meaning that can be said of very few shows nowdays. I'm actually sad that i didn't know about this show until late 2007.","As the much anticipated final episode came and went - people began to think, is there a series in the works. In talking with Showtime Executives, they formally addressed a mini-series to captivate a general audience in the US. Since this was accomplished and since the show was nominated by the board for the Golden Globe Awards, it seems in some slight way, Sleeper Cell is spreading again one more final season. Showtime Executives told me that the show was once and for all completed and was looking to spread the cell farther into the suburbs with a DVD Mini-Series. So what if the DVD sales jump, are we seeing a trend of mini-series turning season series. For Sleeper Cell this is everyone's question. Are we going to see some of the characters one more time? Showtime said NO. This is the final season, Sleeper Cell is no more. We discussed in an open forum about the last episode and how it was telling the story of a local jihad's group quest for glory. Much of the episode's goal was to show the audiences Farikh's rise and fall and more importantly leave the mystery within. But like with all mysteries they can be solved. Heres what I gathered from the writers and actors of Sleeper Cell.Darwyn and the FBI wanted to get Farikh out and even dead. But as for the other members, Darwyn wanted them alive to keep the alert on other sleeper cells around the US. This is why it was hard for Darwyn to kill Christian in one of the scenes. It was clear that Christian's duties was self-suicide after slaughter. Darwyn was still captured in his innocence and decided to street fight him than kill him without knowing if he would take the right side. Well we know what he chose.Ilija's was the second man in the plan, he was instructed to cause the fire alarm in the stadium. But his real mission after wards was a mystery. It turns out that Ilija was to stay at the stadium and fuel the chaos. But as he found out the plan of attack did go through as he saw the MAN get shot in the stadium, he ran out. The writers wanted to show a reaction but if they did there would not be any mystery of Ilija's plan.Crazy Boy I like to call him, decided to stop in the middle of traffic and take his vengeance of his life to the innocent people. He did not tell Darwyn his plan due to the fact Darwyn was a devoted Muslim - he simply did not want him to interfere.The denouncement the writers wanted to show, was the change in IIija's self esteem to becoming more of an American. In a shot they wanted to create, IIija was to turn his belief in music to reality.As for Darwyn he finds nothing but an ordinary life.","The story itself is interesting, but is it representative of terrorists? I think not. Find just one Islamic terrorist attack that involved three westerners. There aren't any.The show is good from a dramatic point of view, but it is in no way \"realistic\". It's about as true to life as 24. But, like Kiefer does on 24, the actors on here are quite good. It reeks of too much handling from producers - you can almost hear the pitch meeting \"we can't just have a bunch of arabs. People need to identify with these characters. And we need a love interest.\" Very formulaic. Obviously a lot of time and money has been spent on this and it's very watchable, but ... HBO would have kept it truer to form. For instance, I am quite curious about the Indonesian character. If you've ever been to Indonesia, he looks about as Indonesian as an Eskimo. Would it have been that hard to find an actor from Jakarta?","Network: Showtime; Genre: Drama, Action, Crime; Content Rating: TV-MA (graphic language, strong violence, nudity, simulated sex and sequences of terror); Available: DVD; Perspective: Contemporary (star range: 1 - 4); Seasons Reviewed: 2 seasons Farik (Oded Fehr) recruits African-American Muslim Darwyn Al-Said (Michael Ealy) to be part of a brotherhood of jihadists who have fully integrated into American society out in the open and behind closed doors are planning an attack on Los Angeles. Little does Farik know that Darwyn also has a secret identity, an undercover FBI agent trying to bring down Farik's terrorist sleeper cell.The idea that terrorist sleeper cells are lying wait in America posing as our friend and neighbors is one too baffling and frightening for most people to comprehend. Every once in a while \"24\" will embrace the post-9/11 view of terrorism, but nothing on TV touches the subject like \"Sleeper Cell\". Hopefully this will change, but to date, nothing matches the intelligence, thoughtfulness and nuanced realism of \"Sleeper Cell\". Created by Ethan Reiff and Cyrus Voris, the show digs deep into every angle of every highly debatable issue surrounding Islam, terrorism, and American policy in a post 9/11 world. \"Cell\" takes all this and turns it into an immensely entertaining cinema-quality thrill-ride. You most likely won't end up more educated about terrorism or global politics and many may object to such a cavalier Hollywood approach to such a serious subject, but for what it is worth, the balance is flawless.Inside the action, \"Sleeper Cell\" depicts the war on terror as between Muslim vs. Muslim with peaceful Darwyn coming up against a group of zealots who have perverted his religion to justify murder and mayhem. While reading a description like that you might as well be listening to a presidential rallying speech, but the way \"Cell\" brings it to life is eye-opening. Armed with a versed knowledge of the religion's history and quoted passages from the Qu'ran, the show has written every angle - the pro-force right, the conspiracy theorist left and the terrorist dogma - with the same versatile rationality of a person who believes each of these views. Often shows get praised for espousing an opinion. My problem with many of them (such as Dick Wolf and David E. Kelley's stuff) is that every character espouses a single opinion, and the other side is broadly depicted or only there to be ridiculed, when the real world is more like Sleeper Cell, honest cases are made for each side - even the villain's without sympathizing with terrorism.The performances are spot on. Fehr is the picture of frightening charm as a leader should be. Elay says pages of dialog across his face, tortured by what he has to do to maintain his cover, particularly when those around him start to die. With all the talk about the culture clash between the west and the middle east, let's not underplay how riveting, exciting and purely entertaining in a rare way this show is. We watch with twisted fascination as the terrorists put their plans together and then cheer for them to be ripped apart at the same time. Season 1's strength is the way it takes us through this process - from the financing to the training to the choice of date and target. All the while actually making us want to see how far the cell will get with their plans.Having sewed up the story pretty tight at the end of season 1 (or the first mini-series, I'm not sure), Season 2 (or the sequel mini-series, \"American Terror\") does a bit of a contortion to bring them back. Like any good sequel, it succeeds by building off the characters. The show occasionally wanders off into the personal lives of cell members and looses focus, but when it ultimately gets down to business, the entire season smartly builds toward a grand wild-west-style confrontation between Farek and Darwyn, the result is as intense and satisfying as anything you'll see outside of a Jack Bauer interrogation.\"Sleeper Cell\" is one of the most criminally under-watched and underrated shows on TV and a possible headliner for Showtime. I definitely want more, but the self-contained first season and its live-wire sequel are enough to keep me content for now. TV is not a medium where a nuanced and intelligent piece of pulp entertainment is often rewarded. Don't pass up this chance. One of the very best dramas on TV.* * * * / 4","I'm not sure how this could have been better, so I gave it a 10. The acting was excellent - the main woman was so HOT - the chap who played Darwyn was a smouldering, pensive character who showed the inner turmoil he was suffering (the truck driver's death is one example)excellently. The storyline was believable and the series length was just about right (i.e. I love Lost, but will it ever end?). As a Brit i tend to think of Yanks as gung ho. The LAPD were in their ill advised attempts to arrest him, but the other agencies were portrayed positively. My main thought about programmes like this (and the also excellent 24) is - could it happen? Would it happen? Is it happening now? Possibly, probably.I hope they do another series, but after reading some of the previous comments, it would appear not.To summarise - If you haven't seen it, make sure you do.","I thought sleeper cell was interesting, and exciting to watch, up until the last episode, when nothing happens, its F****** BS, you Americans portray Muslims as terrorists, and the Americans as hero's, its the other way around, i hate it when every American TV show ends up predictable, i was hoping the bombs would go off in that stadium, but i knew it would'nt, it takes the joy out of watching it when you know that the good guys are going to save the day, yet again, Americans are the biggest terrorists, g bush the leader of them all, he is to blame for 9/11, and I'm P***** off that you keep throwing these shows at us, which are all the f****** same! i've a good show about terrorism, its called \" The Whitehorse\" and bush himself the cell leader, its the same with 24, how ever 24 was good, sleeper cell is a mock and should never make a season 2, its F***** joke! and so are you American producers.","imagine \"24\" completely uncensored, given free license to explain the situation in any detail needed and showing how and why both protagonists do what they do to kill/prevent and you have an idea of how good this TV series is. People in the US have known for a long time that Showtime is the new HBO, they are making far better cutting edge, powerful shows and this is no exception. The show takes the viewer all the way through the creation of a sleeper cell to when an attack is attempted, taking in important facets such as faith, religion, funding, means and needs. To the uninitiated, there is much to be learnt about the Muslim faith here. Unlike on mainstream shows like \"24\" where the terrorists are merely nutcases who the good guys shoot, their purpose and reasonings here are fully examined. What gives the show more credence is the latest technology the cell/FBI uses and the authentic shots in europe, the US and the middle east, no expense is spared to tell the story accurately The cast are relatively unknowns but the acting is superb with the aid of a tautly-written script that constantly keeps the viewer on edge with many unexpected twists and turns. This show has not got the credit it deserves and ironically is a bit of a sleeper hit itself, must see for anyone at all interested in this genre"],"review-user":["vincedc","LynnL999","tolecnal","mraseelak","irishbray","mikestephenson","alrakanb-1","muman33","emattos-1","Smcgivney1","boyblue4502","hddu10-819-37458","blehblehbleh","pauline_etj","paul2001sw-1","BW","derg38","videohoax","pati-balazs","countlaslo","JohnSelf","liquidcelluloid-1","brynthe_blade","cardiff_daz","pepekwa"],"review-date":["7 December 2005","26 January 2006","3 August 2006","7 December 2005","6 December 2005","19 December 2005","1 June 2006","20 December 2005","18 December 2006","17 December 2005","18 December 2005","25 August 2015","19 October 2006","31 October 2009","24 December 2006","22 May 2006","30 December 2007","19 December 2005","18 February 2008","10 January 2006","28 July 2007","30 December 2006","17 September 2006","5 September 2006","6 November 2008"],"review-rating":["9","10","5","2","1","3","5","4","6","9","6","10","1","10"],"review-title":[" Thoroughly engrossing, gripping and frightening...\n"," Groundbreaking show\n"," A well casted series that gives you the chills.\n"," gripping drama...\n"," Fantastic........and Frightening\n"," Takes you to the cliff's edge so often you will develop acrophobia.\n"," Tight, intense, and well told\n"," Unbelievably good ..\n"," Season 2 falls short of season 1\n"," Great Series!\n"," Sleeper Cell thoughts\n"," Mohammedan PC Schlock Propaganda\n"," Racist, boring\n"," A show about terrorist\n"," On how life isn't\n"," Who's sleeping now?\n"," Stupid mistake\n"," If Michael Moore and Ann Coulter wrote a show together\n"," Why on Earth did they end this?\n"," Final Episode - Mystery Solved\n"," Too real my a$$\n"," One of TV's best dramas, both a riveting Hollywood thrill-ride and a rare nuanced look at modern terrorism\n"," Wow, watch it\n"," American BS!!\n"," better than 24\n"]}