{"review-url":["http://www.imdb.com/title/tt0435687/reviews"],"review-text":["For many the hit series was ten years of pitch black humour loaded with affectionate parodies of classic films and a hilarious assortment of over a hundred characters with instantly recognisable catchphrases. Few shows have survived transition from radio to TV to stage show to film but The League of Gentlemen have achieved it with suitable aplomb.The talented writer/performers had initially envisioned a Monty Python style medieval adventure, but as soon as writing began they soon realised that the characters they have lived with had become very real and deserved better. With that, the Royston Vasey folk realise their very existence is under threat as the writers decide to disregard the fictitious town and work on a 17th Century romp instead.With the exception of Michael Sheen playing much unseen League member Jeremy Dyson, The League play pretty unlikeable caricatures of their real life personae as well as the familiar faces of Tubbs (\"I made a little brown fishy\"), nightmare inducing sexual predator Herr Lipp, butcher Hilary Briss and an unlikely hero - irate businessman Geoff Tibbs. New faces appear when the third reality appears, it's here we are treated to charming and funny cameos from veteran actors and popular TV stars. For many this will be a really enjoyable 90 minutes.'Apocalpse is not going to please everyone though. Working on this level of post modernism has been done a few times before now and may seem all too familiar to audiences raised on irony drenched teen successes kick-started by the likes of Wes Craven having a New Nightmare. It also takes a lot of confidence in an audience to keep up with a high concept story so there are moments of exposition and dialogue that serve only to confirm what most in the audience already know. Comedy as a genre is formulaic but it's now unheard of for a British film not to fall back on the huge back catalogue of TV stars to fill short amounts of screen time. It's also hard to believe the creators ever wanted their offspring killed off, which is perhaps why some of the role reversal doesn't always quite hit the mark. Would Hilary Briss have wanted to try save Royston Vasey in the series?However, while the show's deliciously dark vein has almost all but disappeared but is arguably more accessible for it. Much will be said about the character development and efforts to humanise the likes of previously one joke incarnations like Herr Lipp. It is here an impossible level of depth can be found along with a harsh streak of biting satire and throwaway put downs. Sentiment is there with a lump in the throat but not sugar coated thickly enough to intrude on the action. The music is good, performances exemplary and the animation is wonderfully seamless; a nice throwback to Terry Gilliam and Ray Harryhausen's work. In short, there's a lot to like about the Apocalypse. Like so many TV to film transfers it was never going to be easy finding the line between preaching to the converted and introducing the uninitiated to the League's slick and distinct voice. But no matter what your preference is, this last trip to the town which 'You'll Never Leave' is oddly lined with hope and ultimately very, very touching.","There are two ways to turn a TV series into a film.The first, most common, and least successful, is to basically make a feature-length TV episode- see the disasters of the Steptoe & Son movie. The second is to do something else- something quite different, à la Monty Python.Thankfully, the creators of the cult TV series have gone for the second option, and they've come up with something unique, clever and funny- it couldn't feel less like a TV episode.Try to get your head around this- the writers, playing themselves, are confronted by their Royston Vasey alter-egos, played, of course, by them, and told to continue writing the series, otherwise apocalypse will befall the village.High-concept, contrived and easy to screw up? Yes, but somehow they managed to pull it off. Not for every taste, perhaps, and the ending does drag, but fans will be delighted, and it might even win over the uninitiated.","The film was apparently spawned from an idea one of the writers had when he 'saw' one of his creations in a supermarket. The inhabitants of Royston Vasey head into 'our' world to persuade the writers not to stop writing about them and thus destroy their world.If that sounds a bit too serious, don't be put off. Within the first few minutes we get: Bernice (the vile female vicar) letting rip at an unfortunate penitent during confession; Chinnery (the vet who inadvertently destroys every animal he touches) attempting to collect semen from a giraffe; Mickey (thick beyond belief) being, ah, thick; and Tubbs (inbred sister-wife and local shopkeeper) being sweet as ever - but still disgusting.Some of the regular characters are missing, but a new idea by the Gents introduces some 16th-Century characters - and we have the Gents themselves in the action too. If you're new to The League of Gentlemen, this is an easy introduction and a lot of fun. If you're a long-standing fan, this has everything you've come to expect - including the joys of Jeremy Dyson spotting.All told, it's got the same faintly surreal humour that's the hallmark of the series, plus some moments of quite touching 'introspection'. Herr Lipp, for example, maintains a gentle dignity on learning that he's regarded by his creators as a 'one-joke character'. While most of the characters stay as they are, some develop in unexpected ways that are perfectly natural when they happen.This film is a 'swan song' for Royston Vasey, but it's also a showcase for the Gents who prove that (gasp!) they can write other stuff - and it can be very funny. (But you knew that anyway.)","After three outstanding BBC television series' and a Christmas special, the bizarre and grotesque (yet perversely lovable) characters of bleak fictional town Royston Vasey make the jump to celluloid, along with their creators - The League of Gentlemen. Mark Gatiss, Steve Pemberton and Reece Shearsmith are the more familiar three-quarters of the foursome, with the central roles shared between the trio. In an added twist, the final member of the team - Jeremy Dyson - is portrayed by actor Michael Sheen. Where to start? Dyson (Sheen) is in conversation with his writing cohorts, when - horror of horrors - he is paid a visit by two of his grisliest characters. Both Tubbs (Pemberton) and Edward Tattsyrup (Shearsmith) are unhappy at The League's decision to kill off the Vasey inhabitants. \"You're not real!\" screams Dyson in vain, as the local shopkeepers from hell exact their revenge. Mayhem ensues, as reality and Vasey converge with the vast array of characters entering our world to save theirs. Confused? You will be, as the camp, innuendo-ridden Teutonic, Herr Lipp (Pemberton) is forced to take on the daily guise of Pemberton (Pemberton), while Pemberton (Pemberton) is kidnapped by cannibalistic butcher Hillary Briss (Gatiss) and Geoff Tipps (Shearsmith). With shades of an even more demented Misery, Briss attempts to force Pemberton to rewrite the film - thus continuing his life - but leaving Geoff in charge is never a good idea. The erstwhile comedian becomes embroiled in The League's latest, post-Vasey adventure - The King's Evil - entering a typically twisted 17th century England, complete with cameos from Victoria Wood, Peter Kay and David Warner. Known as George of Asda (due to his select line of clothing), Geoff saves the day and is treated as a hero, but for the denouement of the film, he joins characters old and new at the Church of Royston Vasey to meet with their makers. For fans of the series, the film is a must-see. And yes, it does feature Papa Lazarou (albeit a little too fleetingly). Pen-loving Pauline, Mickey, Barbara and cursed vet Matthew Chinnery are some of the other favourites on show, and The League's portrayal of themselves (plus Sheen's as Dyson) is also a fascinating insight. The League of Gentlemen are the Radiohead of British comedy - they are ambitious, groundbreaking (witness the excellent Series Three) and not happy to rest on their laurels. They also divide opinion accordingly.Certainly, their macabre sense of humour is not for every palate, and while not written exclusively for 'fans', a grasp of the storyline would benefit those who have previously viewed the series. Nevertheless, Apocalypse is a film in its own right and The League will no doubt manage to attract a new breed of fan, as well as appeasing and pleasing existing ones.","I have to admit that when I first heard about the Apocalypse film it was a worry.I mean, they have a lot to live up to, don't they? When they first did a stage show they won the Perrier award and when they did radio they won a Sony award. When they ventured onto our telly's they won a Bafta award, a Royal Television Society Award and the Golden Rose of Montreux.When the first series aired in January 1999 it was mind-blowing! A real breath of fresh air in British Comedy, and when the second series aired a year later it built on that foundation and sealed the shows cult status around the world, our web stats show that we have received visitors from every single country on the planet! The 'Local show for Local People' showcased the Gents talent for live performance and opened doors for the gents to do more live performing such as 'Art' in the west end.The fans favourite has always been the Christmas Special, less of a sketch show and more a tribute to classic horror films yet still wrapped up in the delicious League style.And then of course there was the 'difficult' third series, still a hit with the loyal hardcore fans of course, but maybe a little bit ahead of its time for a mainstream TV audience.As I say, a lot to live up to.So now we have the film and...Well a film is different isn't it? It will be seen by much larger numbers than the radio or TV shows and with the third series in mind I was worried.Well as you know I was lucky enough to get to see the film yesterday at a press screening in London and all my doubts were blown away (literally) in the first few minutes! I am not going to give plot lines away as some reviewers have done, nor am I going to tell you the catch phrases (although there is really only one) but I will try to tell you what they have managed to achieve with this film! Leaving the cinema on Monday night I could only imagine writing 'Oh my god, it's brilliant, its amazing, its the best thing they have ever done, better than the first, second and specials all rolled into one!' Of course I owe my visitors a much better explanation than that! So, why is it brilliant? This is a film for everyone, the casual fan, the obsessive fan the occasional fan and even for someone who is sat in the wrong cinema! You don't have to have watched the series to enjoy this film; it works on so many levels.This film reminded me why I am a League of Gentlemen Fan! You can tell that filming was a true labour of love too; the attention to detail is incredible. The sets for the TV show were always detailed but I am going to have to watch the film again just to look at the background! The story moves at a swift pace, the action carrying us from Royston Vasey to the real world where we meet the 'Creators' who are of course the League themselves! Along the way we manage to bump into favourite characters from the show but always within the central story unlike the TV sketch show.I was glad that the film was dark in places, a little scary and a little strange...only fitting for The League of Gentlemen. The Gents also managed to get their revenge on the BBC censors, not as much slipping in the word 'Mongoloid' as screaming it from the roof tops! Some may think the Gents portrayal of themselves a little indulgent but that's the joke and with that comes my only worry, the in jokes I mention below may puzzle some viewers and they might come over a little too clever...but I shouldn't worry, there is always a poo joke waiting just around the corner and speaking of jokes, they come thick and fast, and in a mixture of clever references, wig jokes, bum jokes, visual jokes and cock gags! I haven't laughed out loud in a cinema since...well, I can't remember! The fans that have been 'with' the League since the beginning are rewarded with loads of 'in' jokes, some that work on two levels, a mainstream audience may laugh at a reference to a compact disc for one reason whilst fans of the Local show will laugh for another reason altogether! The cameos are genius! Peter Kay and Simon Pegg form the strangest double act you have ever seen, Simon getting one of the films biggest laughs just by making a noise! I was a little worried about the 1690's aspect of the film when I first heard about it but as a story within a story I was just getting into it when...but that would be telling! All I need to say is that it fits wonderfully and adds to the overall feel of the film! I am not a professional reviewer of films, so I am finding it difficult to put into words how much I enjoyed this film but for now I will just say that if the supposed benchmark for British Comedy films in recent years was the excellent 'Shaun of the Dead' then I am sorry but a new benchmark has just been set by the inventive, hilarious and sometimes a little scary...The League of Gentlemen's Apocalypse.Jason Kenny 2005","Just saw 'The League of Gentlemen: Apocalypse' at a special screening in Manchester, with Mark Gatiss and Reece Shearsmith of the League in attendance.At the back was Peter Kay (who has a brief cameo in the film) affectionately heckling at the back during the Q & A session after the film.The film was complicated (in a good way) and very very funny. It follows Geoff Tipps, Hilary Briss and Herr Lipp as they try and save fictional Rosyton Vasey from the disinterest of their creators.The League play a wide range of their characters and themselves (or character based on themselves) and are ably supported by the cream of British character and comedy actors such as Bernard Hill, Victoria Wood and David Warner.Warner is a particular stand out reminding me of his smooth and cutting turn in 'Time Bandits'.The film swims in and out of various realities and allows some of the denizen's of Rosyton Vasey some space to grow beyond their usual limits of their comedy shtick.Steve Pemberton's Herr Lipp has a great Bretchian moment near the end of the movie and has to make a decision about his purpose and meaning in life which brings a lump to the throat at an unexpected moment and surprises you with its tender affection for the characters.This echoes something Mark and Reece said in the Q & A afterwards, that the plot of the league being tired of their famous characters is spurious and that the whole film is really a love letter to them.For a format that started as a radio character-based sketch show, these guys have really evolved the idea so far as to sustain a movie which takes you on a journey through fiction, 'reality', comedy, tragedy and a pleasing journey for two of the less obvious characters to carry a long form story from their 70 odd existing creations.The fans of the show will love it. It pays off dedication and attention to detail in spades, the uninitiated may be a little lost, but the joy of the LoG was always the ability to almost instantly tune into their acutely observed characters and take the stylistic leap into farce and expressionistic movie homage.There are homages a plenty in this one including 'The Shining' and 'La Belle et la Bete', to name but two I spotted and they ably demonstrate their love for cinema and history with a segment in 1690's England that makes perfect sense when you're engaged with the movie.What can I say, I marvelled, boggled, emoted and snickered throughout and they have definitely pulled off what many have failed at. A successful British TV comedy to cinema translation.If you've watched and enjoyed 'The League of Gentlemen' in the past, go see it; you will enjoy.If you haven't, rent/buy a DVD and then go see it.Well done guys and thanks for the charming and humorous Q & A.","This movie was the result of the fantastically darkly comic BBC TV series! It's a huge pity that this movie spin-off is let down by a poor script and by production values which are below what the TV series offered. It might have been better to take this idea and implement the best parts of it as the end of another TV series but this may not have been an option for the writers. The plot is basically two stories badly tacked together. There are some comic moments but not enough to make it necessary viewing. The audience I saw it with certainly didn't crack up laughing. As it stands it's a pretty disappointing big screen farewell to the excellent characters that have provided so many laughs on the small screen! Such a pity, I really wanted to be able to say something more positive!","Being a massive fan of the TV series (even to the extent of visiting Hadfield where its filmed!) I was waiting for this to come out from the second I heard about it. Perhaps my expectations were to high, but literally 30 mins into the film and I was thinking 'what have they done?'. Some of the best characters such as Tubbs n' Edward, Pauline n' Mickey n' the bizarre Papa Lazarou had about 10 minutes screen time between them, instead a lot of the film is taken up with the real life creators (aka the league of gentlemen) and some rather poor characters from their new 17th century story. I think what made the TV series so great was all the characters of Royston Vasey, this however did not feature that many in any great detail, and wasn't even really filmed in Royston Vasey for the most part. The whole cinema sat in mostly silence throughout the film, the only highlights in my opinion were the usual sexual innuendos from Herr Lipp (the best being his one involving two scouts at the start and their 'purple skins'!).","The best British Comedy Film ever! For years English comedy television programs have turned into films and have flopped, 'Are You Being Served?' 'Dads Army', the list goes on. However the popular dark humoured BBC television show; 'The League of Gentlemen' has managed to not only create a film which has managed to not be a flop but has also managed to be the best British Comedy Film ever! With its dark and horrific twists and turns The League of Gentlemen's Apocalypse is British Talent at its best! Its intriguing demonic storyline written by the League of Gentlemen (Mark Gatiss, Steve Pemberton, Reece Shearsmith and Jeremy Dyson) matches with the Gents (and guest cameos) superb acting! This I hope is not the end of Royston Vasey, not after this great success anyway! Don't think that if you have not seen The League of Gentlemen on the telly that you will not understand whats going on. Its all well explained and by the end of the film you will be happy with the result but you are still left hungry for more... Mmmm, Special Stuff.","Don't get me wrong, I love the TV series of League Of Gentlemen. It was funny, twisted and completely inspired. I was looking forward to the movie, the premise was interesting and I looked forward to see what they had done with the characters and where the bizarre storyline would take them.It was a total disappointment, for starters the three weakest characters in the series were the leads and it only contained bit parts for the other characters (why not pick mickey & Pauline, papa Lazaro or tubs and Edward for the main parts!?). It was unfunny throughout, half baked gags and poor slapstick humour.The real clincher was the plain ridiculous period drama / comedy (and i will use the word comedy loosely). It distracted from the main storyline and felt awkward, not to mention painfully unfunny. The direction of the movie is appalling, and often feels that the lines were delivered by the characters within one take. Very rushed.Then - the three headed Plasticine-esquire monster. What the hell was all that about? plain ridiculous, it felt like the League of gentlemen tagged it on at the end.All in all I found myself looking at my watch and sighing with disappointment throughout my experience of the film. What was once an amazing Television series has been tainted by a terribly unfunny film. If i could give it 0 out of 10 i would. Do not waste your money seeing this.","\"Wouldn't it be funny,\" thought Steve Pemberton, as the League sat down to pen a film script, \"if our characters came after us, wanting to know why we wanted to kill them off?\" Well, as it turns out, no, not really. In this misguided, post-modern set up (three words: Last Action Hero), bestial butcher Hilary Briss, predatory German exchange-teacher Herr Lipp and broken businessman Geoff Tipps step into the 'real world' to try to prevent the apocalypse of Roysten Vasey and sabotage the Gents' new project - an 18th century romp called The King's Evil. And ironically, this film-within-a-film, featuring a terrific cameo from Warner, is easily the best thing about this. The creators obviously had a blast, but many devotees will wonder why they've tampered with a winning formula.","According to the blurb on the back of the DVD case; Jonothan Ross 'laughed until a little bit of wee came out'. I suspect that that has more to do with his being full of it.I never watched the series for one reason or another, so maybe I'm missing some essential cues. As to this movie; I watched the first 45 minutes or so. I laughed once, smiled once, then reached for the newspaper whilst waiting for something else entertaining to happen. Nothing did.Evidently intended to be a surreal spoof upon life in the post-Python, gross-humour style, this one falls absolutely flat. There's been a host of comedy series on television in the last few years, not the least of which were 'Bottom', 'The Fast Show' 'The Vicar Of Dibley' and 'Father Ted', each one engaging a group of bizarre but hilarious characters and sketches. Any one of these could knock this crap into a cocked hat.If the series was anything like this movie; I'm surprised they got the funding. Happily it was one of those £2 Tesco bran-tub purchases and is now in the local charity shop.The moral of the story is; don't believe the pundits, never pay top dollar.","Overall, I felt this was a wasted opportunity. I feel ever so let down by the League as I felt they had their fingers on the pulse, but this film is ever so slightly up its own backside, and you can't help but feel some of it was for their own amusement. Although I welcomed the fact that they wanted to do something different (as opposed to sending the characters off on holiday, a la Are You Being Served film version), they just don't manage to pull it off, and the irony is it probably would have been a safer bet sending the characters off on holiday.Surely they could have stretched a full length plot around a character such as Papa Lazorous (sic) or even Geoff, who has pretty much the only funny lines throughout. I could see what they tried to do with Herr Lip, in that he faces up to the fact that he is a one joke, one dimensional character, but that was as clever and interesting as got.The medieval section sucked big style, and reeked of a poor Monty Python sketch. Definitely more Meaning of Life than Life of Brian.","I am a massive fan of the LoG. I thought the first two series provided some of the best comedy this country has ever seen and the third series, though different, was wonderfully dark and imaginative. The thought of seeing Tubbs, Edward and Briss on the big screen made July 3 something to wait for. Yet, somewhere, it all went horribly wrong. The writers had no story and no real ideas. The part set in old England showed the glimmers of genius that we know the League are capable of but these scenes did not fit well with the film. Geoff provided the best of too few, largely poor jokes and Lipp and Briss's performances were big let-downs. If you love the League, save yourself the time and money and watch episodes from the TV series again. And again. A massive disappointment.","Am i right in thinking i went to see the same film as everyone else .. this film was terrible. I'm a fan of all 3 series of the league of gentelmen and have always respected the originality of the writers, even when the format changed in series 3. This film however was a blatant half effort, the plot was extremely poor having the characters going into the real world made this film see more like the last action hero. There was about 5 moments in the film that got a mild chuckle but the rest of the time i was wishing it would end. This would have been better as a 10 minute short on the DVD .. it was more of an explanation of what they planned to do, and looked like some of the writers disagreed on the fate of the characters and they made a joke of this by killing him off in the first 30 minutes.If your a true fan of the league of gentlemens ability to stay fresh then you'll hate this film. If you only watch it cause there was nothing better on TV then u'll love it.someone back me up !!","i went to see the league of gentlemen's apocalypse last night at a preview screening with a Q & A afterwards at the National Film Theatre.Having been a huge fan i was worried that the film might not live up to expectations but how wrong i was! Although much of the action is set away from the usual home turf of Royston Vasey and contains less characters than the TV series, it is undeniably every bit as good as the TV series. The film follows three lesser known characters, Hilary Briss, Geoff Tipps and Herr Lipp as they attempt to save Royston Vasey from an apocalypse being rained down on them due to the writers stopping writing the show. The film also contains favourites Tubbs and Edward as well as Papa Lazarou and Pauline but in much smaller amounts. I felt this worked well because it meant the audience didn't overdose on the extremely grotesque characters. However, of course, there are still plenty of fantastically twisted moments scattered within the film.I would recommend this film to anyone whether they have seen the TV series or not. My hat's off to the league for making such a fantastic film.","I originally watched this because I thought it was going to be the sequel to the League of EXTRAORDINARY Gentlemen and this movie is a whole different thing entirely going on here-a comedy! However, I loved it anyways! The League of Gentlemen is apparently some British TV series with some rather odd characters and some sharp humour. This is British comedy so it revolves around being very silly, dressing up in costumes and making lots of fun of Germans and french, homosexual references- in short it's very very funny!THe plot revolves around the writers of the TV show deciding to cancel some of the characters and the characters coming out of their dimension into the writer's dimension to stop that from happening. It's a fun twist and there's plenty of great scenes in this idiotic adventure. I laughed out loud numerous times and applauded the brazen style of humour. This makes Mr Bean look like the watered down wimp he is.(Rowan is much better in Black Adder series btw)This is not Monty Python, but you can never escape the comparison when you are talking British humour, and there are a few similarities but not so many as to keep it from being it's own thing and being fresh. It leans more towards the young ones and Guest House Paradiso in its' comedic style.If you liked this, check out The Young Ones series and Guest House Paradiso movie, and of course, I assume the TV series League of Gentlemen must be rather funny as well.","I watched this film in the theater in Edinbourgh along with 3 other Americans and our friend from Manchester and we all thought this was a waste of time. We would have much rather spent an extra hour to watch vapid dialog of Star wars III that was playing down the hall than all of this. Opening with one of the worst jokes I've ever seen committed to celluloid on the big screen, it did not take off with a bang. throughout the movie we got the feeling that the jokes were just trying too hard, the writers thought about the setup so much that you could see the joke coming 2 minutes beforehand, then when it came it was so lackluster that you couldn't even smile; I cite the giraffe cum-ming as a prime example. The plot itself makes for some interesting thoughts in my mind, which entertained me much more than what was going on on the screen. I think a lot more could have been done with that angle (the two different worlds, the fish-out-of-water experience of the characters, the confusion and surprise as people try to comprehend and distinguish the characters and writers from each other.) But too much time is wasted with pushing this painful plot to the end with as much 'bizarre' and 'goof' as is humanly possible. And to say the 16th century characters show any extra talent from the writers is an insult to intelligent writers and editors who possibly could have made this film a worthy 40 minute afterthought; but no, its a full length torture film of unfunniness. As we were leaving the theater, which had VERY little laughing inside it, I overheard the young hip electro-clash British couple behind me saying \"That was rather good wasn't it. You never really knew what was coming next.\" And the girl responding \"yeah, quite surprising.\" and that was it. If this is what is meant to get out of British people from watching a comedy: no laughing for 90 minutes but a teeny bit of communication between two lovers at the end, then this film succeeded. But i have more belief in British life than that.I've not not-laughed so hard at a comedy film since American Pie II.","please re-watch all 3 series and do not go see this movie, the trailer is completely misleading and the 3 weakest characters in the series stretch a badly thought out 25min TV episode into the most painful 2hrs of my life, truly an awful film. tubbs and edward are in it for a few mins, micky has 1 line, and her lipp just reels out the same tired old puns, also mr briss's accent just changes about 5 times in the film tons of badly acted extras, and really a few laughs that they seem to recycle for 2 hrs i honestly feel this series has been completely ruined by this god-awful piece of crap..........batman and robin all is forgiven","I just don't get these reviews! I can't help thinking they are written by the sort of L.O.G fan who would worship anything they ever do without questioning whether it is actually any good.I'm a massive fan of the programme but thought this film was a pointless project. I could forgive the ridiculous plot if I had come out of the cinema having laughed more than twice. At one point, I thought it might just me before I realised hardly any laughs were minting from the rest of audience.I wasn't expecting much of a plot (very few TV comedies stand up to being stretched over 90 minutes) but thought the odd bit of classic L.O.G dialogue or visual joke (like at the start of each programme) would carry a film. After 5 minutes of the 17th Century plot, I was begging for it to end (little did I know it would carry on for the rest of the film). It just wasn't funny.I was just massively disappointed and can't see history being too kind to it, even if a few die-hard fans write enthusiastic reviews.","Having only seen five episodes of the show before this, (I've been watching the repeats on BBC Two) I haven't really had much experience of the League, but as a fledgling fan as well as a massive fan of British comedy, I can say this film is hilarious. Seeing Herr Lipp, (who I had not seen on screen before the film) Briss and Geoff on the big screen was a great comedy experience. Being on screen is something that the League take full advantage of, with heads blowing up, (it'll come as a surprise who it is) and gruesome murders with random Middle Ages style battles all the way.Geoff is easily the funniest character of the three protagonists in this film, because he has the best one liners and overall behaviour, just like in the series. One of my only disappointments with the film was not hearing Geoff shout \"Well now I've got this gun\" even once, (even though there is a build-up to it in one part of the film.) The film itself overall is, to use the phrase everyone else does, Pythonesque and it's very reminiscent of films like \"Life of Brian.\" Appearances from Tubbs and Edward were welcome, but Papa Lazarou's line \"Hello Daves\" cracked me up more than anything said by them, (Lazarou's probably my favourite Vasey character after Tubbs and Edward.) It's got quite a poignant ending with one of the main character being killed off and I can only hope this is not the League's last on-screen Vasey venture. With Gatiss mentioning the possibility of another series or film, I'm now very excited. This is a film I will see again, partly because the projector died towards the end, leaving out 10 minutes or so of the film, but mainly because it's inventive and hilarious. I'm not really bothered if it's not as good as the TV series, because I loved it.One thing though, if you've never seen the League, you'll still love it, but Dave knows what you'll think about the people who make this stuff up. As Tubbs or Edward might put it, it's a local film, for local people, and a precious thing at that.**** out of ***** (4/5)","Based on the weird, wacky and at times wonderful sitcom, League Of Gentlemen's Apocalypse is a fans delight. I was a fan of the first two series myself, with the third still enjoyable but a little too out there for my liking. You could easily assume that with the Royston Vasey locals hitting the big screen and leaving behind TV boundaries of taste' that the movie would really push the darker aspects out. However the is nothing quite as disturbing as series three's sodomy scene. Of course many sitcoms don't translate all too well to the big screen, but LOG was a sitcom with a real movie atmosphere, from the style it was made to all the references, it truly felt like a long movie split into six segments each series. Similarly Spaced's unique style worked superbly for it's translation to the big screen in Shaun Of The Dead. This movie is very filmic thankfully with possibly the most strange plot ever to grace the silver screen. The four writers add plenty of film reference with little nods from everything from The Shining, Labyrinth to the old HarryHuasen films. This is in many ways a whacked out smacked up version of kids favourite The Neverending Story. With the imaginary colliding with the real world.The plot opens with the scenario that the inhabitants of Royston Vasey, who are alive inside there own little world, like Fantasia in The Neverending Story. When the town of Vasey begins showing signs of the apocalypse, due to the fact that real life writers, Mark, Steve, Reece and Jeremy are not doing any more LOG, a group of the inhabitants must venture into the real world in order to make the writers continue with the LOG otherwise Royston Vasey and its inhabitants will die out. LOG has a great advantage in translating to film and that is the fact it is set in a small universe that is so demented you can do just about anything plot-wise. This film works, it doesn't feel like a half hour skit painfully stretched out. As an example a proposed Friends movie would probably end up being a run of the mill rom-com, far too thin.As far as being a good film, this is. It's good fun, plenty of gags, while not trying to overload the film with gags. On another impressive note, the film managers to successfully incorporate some softer moments too, in the same way Shaun Of The Dead did. While this film isn't as good as Shaun, it will undoubtedly become a cult classic, even if the theatre I saw this in was shockingly sparse (it was a midday showing though).As is the case with Brit films it is loaded with cameos including Bernard Hill, Simon Pegg, Peter Kay, and Victoria Wood. The main cast of course are all good, playing a host of their recognised characters, themselves and some new creations. Also co-starring in his Time Bandits villain style is David Warner who has already become a fans favourite amongst those who have seen it. Also the film looks very polished for a budget of only £4.2 million. They have got some great cinematography and sets as well as excellent effects and something I particularly enjoyed was the stop motion monsters, very much a loving homage to the legendary Ray Harryhausen. I personally would love to see another Harryhausen movie. I'm fed up with all the CGI we have now, as much as it is a good tool when used right but I would love to see a film go back to the basics again, and I'm sure others would too.LOG's Apocalypse is great fun and very nuts. Fans will love this, as will movie enthusiasts. ***1/2","i went to a special preview of this film last night with a Q&A from Mark Gatiss and Reece Shearsmith with much trepidation. as a huge fan of the TV series i was unsure that it would transpose to the big screen well but all of my fears were completely unfounded as i loved this film. Not only was it funny, what you would expect from these guys, but it was so clever, the whole basis of the film being that the characters have left Royston Vasey and are pursuing their creators - the League of Gentlemen in reality. It was quite weird to see Edward, Jeff and Papa Lazarou talking about Reece Shearsmith who plays all of them, but it worked fantastically well. I had also read in a review that a large part of the film took place in the 1690s and was unsure of this but that also proved to be really well-written and very very funny - with cameos from Peter Kay, Simon Pegg, Victoria Wood, Bernard Hill and David Warner. Ultimately this film demonstrates the massive writing talents and acting prowess of the group (even if Michael Sheen did play Jeremy Dyson!).I can't praise this film highly enough, although my favourite characters of Mickey and Pauline weren't in it quite as much as i would have liked but then again I'm sure everyone has different favourite characters and you can't please everyone. The choice of Jeff as one of the main characters was truly inspired and the domestication of Herr Lipp proved to be humorous and poignant - a lovely transformation for a character that speaks only in innuendos. All i want to know is whats next for the League of Gentlemen????????","I never saw any of The League's work until early last year - although when channel hopping one night I caught the end of one the series three episodes. But last winter I fell in love with the show and its dark, eccentric and sometimes downright sinister characters. So when I learnt they had made a film in which the show's lovable creators met their own characters, I couldn't order the DVD fast enough and near on tore it from my postman's hands when he delivered it. I was so excited to see what the Gents had done and how they'd done it.And it was excellent! From the beginning where Jeremy (Michael Sheen) is terrorised by Edward, Tubbs and Papa (Dyson, why didn't you play yourself? He's perfectly capable as viewers of the infamous Highgate House of Horrors know!), to Bernice berating yet another one of her flock, to Geoff, Herr Lipp and Hilary discovering that THEY are characters, which is a great scene. The scenes set in 1690 are very enjoyable, with the Gents turning their hands to yet more characters and an all new plot. David Warner's turn as Doctor Pea is fantastic, slightly camp and very funny.The League have always been brilliant at blending humour with sadness and emotion - and the climax of this film, where Herr Lipp is struggling with the idea that he and the other Vasey residents are just fictional people who will never be able to change who they are or their purpose - and to witness how it's breaking him down, is really sad and beautiful to watch at the same time and that really shows the Gents' talent - something for which they are terribly overlooked for to this day.And then you have that rather clever ending - where you sit in wonder - with Joby Talbot's beautiful theme music playing. And you know you've enjoyed a very clever and funny film.","This review took longer to write than I took to watch this film. It's just plain bad. The plot is terrible in comparison to the TV shows. It is flat, unfunny and boring.It is clear that the LoG ran out of ideas long before this film was green lit. Viewers should read this as an example of not knowing when to stop.Bad editing, bad music, bad acting. Zero dynamism, zilch chemistry.A film that doesn't know what it is, made without any love to some mysterious end that leaves you depressed and feeling kind of angry that so much money was wasted.The LoG obviously were made an offer they couldn't refuse, or perhaps their egos have simply got the better of them. It's a bleak marketing push that perhaps would have been better when the LoG were fresher and more inspired.I however, did know when to stop, and did.Please! Someone try to convince me of this film's finer points!"],"review-user":["Youkilledmypine","adamtanaka","Uncle_Whippity","pjcarline","jasonakenny","stevet-14","pandabat","anthrax-6","lord_loss","skint_graduate","Ali_John_Catterall","screenman","gpshovlin","justin_uk","ihateaphextwin","matthewrose10","dilbertsuperman","natf75","mrrugby-1","russellhor","MadProphet","supertom-3","squarah1","Just_little_Ellie","graemejwalker"],"review-date":["8 June 2005","3 June 2005","4 June 2005","7 June 2005","30 May 2005","26 May 2005","7 June 2005","3 June 2005","4 June 2005","8 June 2005","2 December 2009","27 June 2009","12 June 2005","5 June 2005","4 June 2005","1 June 2005","20 December 2005","5 July 2005","14 June 2005","4 June 2005","3 June 2005","3 June 2005","26 May 2005","12 March 2008","8 July 2007"],"review-rating":["7","7","9","8","10","8","5","6","10","1","5","3","5","2","1","10","9","2","1","3","8","7","9","10","1"],"review-title":[" There's a lot to like about the Apocalypse\n"," one of the best TV series-movies\n"," Odd - but what did you expect?\n"," Hello Dave\n"," In a League of it's own!\n"," Apocalypse definitely not the end of the world\n"," A Plague Of Gentlemen\n"," Thank God for Herr Lipp....\n"," Special Stuff\n"," THE WORST film I have seen in years\n"," Pig in a pokey\n"," Yet Another Charity-Shop Express.\n"," How could they get it so wrong?\n"," A League of Gentle Jokes\n"," WARNING : If you like movies do not go and see this\n"," this film is amazing\n"," Ridiculous British Humour - watch under the influence\n"," Maybe my accent makes my brain work differently.\n"," i want my 2 hrs back, league of gentlemen u owe me £5\n"," Massively disappointed\n"," Watch out, Daves, this is a local film for local people (minor spoilers)\n"," Fans will love it!\n"," go and see this film\n"," A cult classic in my view - especially for League fans.\n"," Boo! Hiss!\n"]}