{"review-url":["http://www.imdb.com/title/tt0428427/reviews"],"review-text":["A kooky, but funny bit of diversion. You kind of have to see it from the beginning to follow what's happening, but each report to earth has it's own little joke. Pretty good special effects for a very low budget sci-fi t.v. show. It's fun to watch. Sort of in the vein of Red Dwarf, but even more low budget. For someone who's just coming in in the middle of one of the episodes, what you have to realize is that these guys are all incompetent, because they've been moved up the ladder of command, because the other officers died. Also, the main guys are from the laundry corps, which is why they have laundry in everything. If you like Red Dwarf, you'll probably like this. Slightly different t.v. concept, in that all you see is the Commander's report each day.It would be better if this were explained more, not just in the very beginning of the first episode, but then it was pretty hard to figure out what had happened in Red Dwarf too, if you hadn't been told.","After the death of all senior officers, Commander Craig-Scott, of the Laundry and Morale Corps, finds himself promoted to command of an intergalactic spaceship owned by Starcups Corporation. Its chief mission is to search for inhabitable planets and, of course, long-term coffee markets.Craig-Scott and his second in command, Chief Blather, find themselves ill-prepared for command, except insofar as they are fully able to keep the crew's undies clean--which is not to diminish the importance of clean undies, especially when incompetent commanders cause those same undies to be, well, soiled on a regular basis.The episodes are presented as a series of short, 2-3 minutes reports by the Commander to Earth. The humor is a mix of wry deadpan and outrageous physical comedy. Think Yes Minister meets Red Dwarf, but on a shoe-string budget. All the usual plot devices of sci-fi are here--aliens, nuclear weapons, computer malfunctions--but each is improved by the fresh lemony scent of high-grade laundry detergent.Commander's Log is definitely low-budget, but the somewhat cheesy effects and props fit the absurd premise of the show. Remember those hilarious hockey helmets they wore on the old Battlestar Galactica? With the \"Jofa\" brand-name still visible? Okay, there's a lot of that in Commander's Log, but it's cute.Commander's Log ain't high-art, but that's not what it's trying to be. It's just a little bit of off-kilter fun. It does a good job of being that.","It's great when an entertaining story can be effectively told in one location and with a small cast. Commander's log manages to poke fun at may science fiction clichés without becoming a cliché itself. A very creative piece.The film is a series of video \"logs\" created by the commander - much like in Star Trek - so we never see what is happening except for when the video log is active. This creates an interesting pacing throughout the film - especially when the \"log video\" is left on by accident. Surprisingly, this device never becomes tiring - this being a result of very good performances on the part of the cast.","I first heard about Commander's Log when I was on the concom for the local science fiction convention. Craig Bowlsby, Linden Banks, Sophie Banks, and Brian Oberquell came out to show the video and give a couple of panels on making TV on a shoestring budget. I have to say that I was very pleased when I finally had the chance to see the show. Comparisons with Red Dwarf are inevitable, since the first seasons of Red Dwarf were also shot on a low budget (although Commander's Log has to set some kind of record for the least amount of money spent per minute of air time), and thus have to make up for the lack of \"eye candy\" with good writing and acting. Linden Banks, who plays Chief Petty Officer Blather, does a particularly good job of presenting an earnest but clueless persona.Bowlsby's original idea was for the story to be told in two minute \"interstitials\", shown in between other shows over the course of an evening, although for some reason, Space didn't get how cool an idea this would have been, and so the interstitials were all rolled up into a one-hour show, which Space normally showed in two half-hour episodes. The existing DVD doesn't include episode 3 (which premiered at Cascadia-Con in Seattle in 2005) or episode 4 (which was previewed at VCON in Vancouver in 2006), but if you're in touch with your local fannish community, you may catch news of a showing somewhere near you.","I recently saw Episodes 1-4, and now I can't wait for 5 & 6 to be available! (I've heard they are coming soon.) Commander's Log seems destined to become a cult hit among the university crowd and all others with a taste for quirky comedy. It's obvious that the budget was small, but the care taken in crafting the script is quite evident. In fact, the simplicity of the show allowed me appreciate the writing and the acting more. Bowlsby is a master of the put-down... I just wish I could remember all the best ones for later use on unsuspecting co-workers! Let's just say that if you don't like Commander's Log, I'll personally see to it that your undies get extra starch!","This program was shown in an early morning time slot on SPACE, a cable sci-fi station. I am amazed that anyone would pay for this or broadcast it; it is incredibly amateurish.The entire show is a sequence of short monologues or scenes performed on a set that looks like a closet with a bunch of circuit boards taped to the wall. There is very little continuity between scenes, and no plot. A typical scene revolves around some lame joke or special effect and is only a minute or so long. The dialog makes little sense and the special effects look like Photoshop filters. The actors are all adults, but I have literally seen high-school plays with better writing and sets. This program is an embarrassment.Perhaps each scene would work as an interstitial; a filler between shows instead of commercials. Stringing all the scenes together makes the limitations of the material extremely obvious.","Let's be realistic here. The only reasons anyone would give Commander's Log a positive review would be if they stood to gain financially; were blindly sucking up to a friend or relative associated with the project, or are easily impressed by amateurish drivel. Severe mental illness could also be accepted as a reason for praising such claptrap in a pinch. I, too, sat through this poop on the Space Network, but only because a relative happens to be one of the \"stars\", but I refuse to respond positively to garbage to appease family. The network ran it straight without commercials for its entire painful 22 minutes - undoubtedly because they could find no sponsor foolhardy enough to waste their advertising dollar on this crackpot venture. The project was undeniably self-produced for the simple reason that no studio would look at the asinine script without reaching for the shredder. Made on a shoestring budget (and it looks like that shoestring snapped partway through production), it gives the word amateur a whole new meaning. I saw better material improvised in high school Drama classes 20 years ago. Commander's Log? It's a \"log\" all right. Somebody flush it."],"review-user":["VanMovieBuff","kevinh-15","efrat55","grga-3","burbleshabe","Corvus-9","Axelinger"],"review-date":["4 April 2005","23 December 2006","4 April 2005","23 December 2006","1 January 2007","20 February 2005","25 November 2006"],"review-rating":["7","8","7","8","3"],"review-title":[" Funny\n"," A Decent Bit of Off-kilter Fun\n"," Very, very funny.\n"," We want more!\n"," Future Cult Classic\n"," Amateurish filler\n"," Calling It Low Budget Is An Insult To All Low Budget Projects...\n"]}