{"review-url":["http://www.imdb.com/title/tt0096195/reviews"],"review-text":["Supercarrier was my favorite movie in the later part of the 80's when it came out. My Dad taped it for me & I watched it all the time until my step-mom taped Oprah over it & my heart was torn. I would love to know if or where I can get it from. I have been looking for it. I believe they even came out w/ a Supercarrier 2. It wasn't as great as the 1st, but I would like to have all of them if I could find them. I do not think @ all that it was a bad movie. It was a very interesting movie with a lot of action yet it had somewhat of a love story plot to it. The actors/actresses in the movie were great. It also helped me to understand that this is not just a man's world, but it is also a woman's world & many women can do the same things if not more than what a man can do & women deserve much respect for their duties as well.","I'll start by confessing that I tend to really enjoy action movies (military or other). I'm a guy. But this dreck was awful. I saw it for free, showtime or hbo and still feel I paid too much. It was a prolonged episode of general hospital. I gave it a 1, only because 0 or 0.1 was not possible. How or why 59 others would give it a rating of between 5 and 6 boggles my mind. Unless they are all family of the cast or crew. It might be, this movie was so bad many bailed out.......and as such, were too uninvested to bother.I'm sorry for repeating but the 10 line minimum seems silly, for what essentially boils down to a warning.........in hopes of saving others the 2 hr black hole, this movie represents. Trust me, stare at a blank wall, they'll be more action.","It is so bad, I can not tear myself away. I keep asking myself, \"Why?\" \"Why?\" with every scene.There is no continuity, but then again if you want to make a very overtly homosexual movie with a fetishistic attitude towards all things Big, Big boats, Big Boys, Big planes, then you don't have to worry about things like plot or character. I am baffled, and very concerned that the CAG looks so much like Richard Pryor. It seems wrong to put a Pryor look alike in such a terrible movie. But I can't tear myself away. This movie is the first movie I've ever reviewed. That is how phenomenally bad and bizarre it is. It motivated me to join this site. I have counted 50 main characters. Perhaps if I was stoned I could follow this, but as it is, I feel like I'm in some kind of never ending bad dream, where it is always 1988, and we were the greatest cocktry on earth.","The horror of this made for TV film was that it didn't end with this one. It spawned a regular weekly series that was even worse than the pilot/movie. Most films about various professions have some type of realism to them and of course are jazzed up to make it exciting. This had none of that. If the intent was to make in \"Camp\" then it succeeded. It resurfaced on cable a couple of years ago and failed again. Richard Jaeckels performance as the Master Chief who does it all was the only redeeming part of this film. Campier than the Batman series of the 60's.","Not only have I read the book and watched the movie, but I was stationed on the USS John F Kennedy when they filmed this. Needless to say, Film crews and actors can be trying to people trying to do their jobs. Now, about the movie. As a career Navy man, I was pretty upset on how they showed life on board an Aircraft Carrier. I could pick apart the inaccuracies throughout the movie (anyone that has lived on a carrier could), but that would take pages. One scene that stands out in particular was when they were in the CIC (Combat Information Center) and they were watching a RADAR contact move across the screen. Each time the contact moved, it beeped. Unfortunately, that equipment doesn't beep like that (I was a technician on that equipment). The book was based upon fact, the movie wasn't. The follow on TV series was just as bad and the Navy finally realized that support for this series would just make them look bad. If you're a Navy person, watch this to see how a movie about carrier life is seen from the eyes of Hollywood. If your not a Navy person, watch Midway or Top Gun, at least those movies are entertaining and based upon fact.","The negative comments in previous reviews are certainly all true. If you are looking for a movie with a storyline or characters then you won't find anything here.But if you are a fan of action movies, and particularly if (like me) you are a special fan of aircraft carrier action movies, then this is a movie for you. In that respect, this movie is much better than \"Top Gun\", which in my opinion, in trying to inject storyline or characters failed completely, and merely took away time from the flying scenes."],"review-user":["idavinelovei","uscmd","etodis","yenlo","recomer","wombat_1"],"review-date":["20 August 2006","20 August 2009","5 November 2008","2 July 1999","29 May 2005","13 June 2001"],"review-rating":["10","1","1","1","3"],"review-title":[" I loved the movie\n"," Maybe the worst military movie in years\n"," Made by a gay fourteen year old boy?\n"," Stupidcarrier!\n"," A movie based on George Wilsons book Super Carrier\n"," Bad movie, Great flying scenes.\n"]}