{"review-url":["http://www.imdb.com/title/tt0795065/reviews"],"review-text":["Assy McGee is a show that you really have to be a certain age to appreciate. Otherwise, it's likely you'll miss the references to 80's cop films and simply think it's a running gag about a walking rectum. Think it's brainless, infantile poop humor? Go watch the Stallone film 'Cobra' and you'll see what I mean. This show actually has very subtle humor, which says a lot, both for a show that aired on adult swim, and for a show about a walking ass.All the standard genre clichés are in place that made movies like Dirt Harry and Cobra so great and ripe for parody. Sanchez is Assy's partner, who is - as per the genre - level-headed and constantly apologizing for his partner's homicidal behavior. The police chief is, of course, a fire-breathing hard case who lives to scream \"I want your badge on my desk first thing tomorrow morning!\" The over-the-top, and sometimes completely nonsensical manner in which the 1980's 'Renegade Cop' film is parodied suits the subject matter well. For instance, while breaking up a bus robbery, one of the criminals stops to ask Assy, \"Hey, where are you going, asshole!?\" To which the title character snaps off the one-liner: \"I'm going... to shoot you.\" Highly recommended for anybody who loves 80's action movies, and has actually viewed enough of them to understand the humor.","It's a talking, trigger happy, alcoholic ASS COP! I have seen the first and second episodes. The artwork and animation fits very well (note the facial expressions, lol). The main character being a gun toting, badge wearing, pair of butt cheeks, shooting at whoever he thinks to be offensive or \"guilty\". So far, the episodes have had simple and followable plots that work very well with Assy's investigations. Don Sanchez, Assy's partner, play's the sobering retort to assy's A.A. antics and random \"I've got a hunch\" leads. Assy's lines are very funny and clever, here's one for example, \"I've got one bullet and its got your email address on it, don't make me hit send\" *bang* \"looks like your in-box just got some new mail.\" The think box at Assy Mcgee's headquarters are so far, consistent and on cue. As for the sound, it's perfect, the sound effects and voice work are 9/10. Assy sounds like Sylvester Stallone all boozed up, Don Sanchez, the Mayor, the Chief of Police, all have voices that \"Fit\" there persona's very well. I recommend this to anyone who wants to catch a few laughs before they go to bed, as it does air on adult swim on Sunday nights. Very funny, imaginative, visually different comedy. 10/10","Network: The Cartoon Network (Adult Swim); Genre: Animated Comedy, Parody; Genre: TV-MA (for pervasive nudity, strong language, sexual content, drug use and graphic animated violence and gore); Available: on iTunes; Perspective: Contemporary (star range: 1 - 4); Seasons Reviewed: 2 seasons The streets of Exeter, New Hampshire are a dangerous beat. It's as if they just dumped out the sewers and let the filth wash over the streets of their fair city. Walking backwards onto the scene to set things right is Assy McGee, a rogue cop who plays by his own rules. Standing about 3 feet tall, Assy is only a bare buttocks with legs. He talks in an 80s raspy jerk cop mumble, cheeks undulating with every drunken slur. Wielding a gun from a holster with what can best be described as unseen hands, Assy (voiced by Larry Murphy), unstopped and at times adored by his straight-laced family man partner Don Sanchez (also Murphy), dispenses his own brand of justice against the filth of the city as well as any innocent bystanders that happen to be in the way.\"Assy McGee\" is such a deliriously outrageous creation that it just may leave you slack-jawed at the sheer nerve of it. Which is why it is so much fun and has become one of the most reviled thing on The Cartoon Network's Adult Swim, a network that has made a schedule out of the outrageous. I've never been a fan of Adult Swim's pension for look-at-me weird for the sake of weird, where the randomness of \"Robot Chicken\" or the obvious parody of \"Venture Brothers\" passes for hip. But \"Assy\" stands out from the pack, with a focused story-driven parody of a very specific set of pop culture clichés. For the most part (I'll get to that later), the show doesn't do very much winking and nodding to the camera as many others can't help but do. Assy simply barrels forward through ridiculous stories - surrounding such originality as priests selling drug-laced cologne, the government stealing bikes off the street and trading them with terrorists, polonium-laced sandwiches and underground squirrel fights - and expects the audience to just get the meta-joke. Many may find it mean-spirited and disgusting, but my lord can it be funny. And I'm not a fan of the fart joke.In fact, the pilot, \"Murder by the Docks\", had me laughing so hard I was gasping for air, which hasn't happened since the Rick James \"Chappelle's Show\". Over 200 years ago, President John Adams' favorite whore dies of a soot allergy. Cut to present day where the body is found and from the moment our hero walks in and shoots up the crime scene he's on the case to find that whore-killer John Adams. Assy's attempts to narrow down the suspects by simply randomly calling up names in the directory and expecting someone to confess over the phone is just about the funniest single bit I've seen in a while. \"Assy\" is one of those shows that actually gets funnier the more you think about it. Just keep applying real world logic to any bit of it and you'll peal back layer after layer of different laughs. This about as smartly crafted as a stupid comedy gets.The rest of the series doesn't quite have the impossible level of lunacy the pilot does, but Assy as a character is rarely not a riot. Yes, we've seen a talking ass as a character before - on \"Family Guy\" and \"TV Funhouse\" - but \"Assy\" leaps beyond the one-joke set-up of that series with original stories and the sheer detail put into Assy's character. He hits on flight attendants, can turn a baby into a weapon and blows away a blimp with a rocket launcher that appears out of nowhere. All the while with some odd character quirks (he's illiterate, casually racist, got a bizarre sense of humor and is unbelievably stupid), an out-of-where Cuban ancestry, some strange phobias and an endless supply of puns and lame conventional cop one-liners. Just about everything said in Larry Murphy's barely intelligible Assy voice tickles me.What I also love is the way the show plays with the mechanics of Assy's physical appearance. He has to stand in the car but sits backwards in a chair without arms. His \"eyes\" opening in a POV shot. He \"chatters\" his \"teeth\". And the show makes numerous references to Assy having unseen male genitalia via his frequent patronage of the oriental massage parlor. Even better, because nobody in Exeter appears to think anything odd of taking orders from a talking ass, Assy is able to slip \"undercover\" with the greatest of ease by simply donning shirts, hats, ties, glasses and, in one case, just a bow tie (Assy complains to be \"suffocating in this penguin suit\").After season 1, Assy became something of a cult comic legend with me and my friends. Could this be the next great animated comedy? But as the show enters season 2 it falls back to Earth. It gets what I have come to call \"Family Guy\" syndrome - a show, played best as a nonsensical parody, that starts taking itself too seriously and seeks to make us care about the story and characters when it works better as unholy anarchy. In season 2, the chief is more tolerant of Assy's behavior and much of the episode's perfectly precious 10-minute running time are swallowed up in an odd, ultimately pointless storyline involving the stress and dissolving of Sanchez's marriage. Huh? \"Assy's\" gleefully excessive use of blood, guts, torture and crude sexuality as well as the generally disgusting and cruel demeanor in which Assy (and everyone else in Exeter apparently) conducts himself will turn off many viewers. The show's animation is cheap and crude. To say that \"Assy McGee\" is not for all tastes would be the understatement of the year.* * * ½ / 4","I LOVED this show. To me this series epitomizes what I like best in dark and surreal animated comedy. It's unfortunate there were only 2 seasons. This would fit nicely in a mix of episodes of Sealab 2021, Wonder Showzen, Xavier: Renegade Angel, Metalocalypse and Superjail. The used car lot advertisement between some segments were a nice touch. On that note i read rumours that one of the main reasons the show was cancelled was due to a lack of sponsors. Couldn't get someone like Hanes or Fruit of the Loom or Joe Boxer? Even though I loved the whole series, if I had to pick an episode or three as favourites I'd say \"Ring of Fire\", \"Conviction\" and i guess \"Irish Wake\".One of the recurring characters that I love because he's just so odd is the doctor (featured in episodes like \"Ring of Fire\", \"The Ballad of Blind Anthony\" and \"Mexican Rain\").I really hope one day we'll see a return of Assy, or at the very least, a decent DVD release of the series with extras.","Assy McGee is an out-of-control, hard-nosed detective based on the countless examples from late 20th century police dramas. The twist here is that Assy is literally a walking buttocks.The cheap, low-brow facade of the show belies its cleverness and hidden satire. That is not to say that Assy is devoid of fart jokes, just that the toilet humor is used sparingly enough to elicit consistent laughs, not groans and eye-rolls. The title sequence of the program demonstrates the clever, subtle humor used throughout. The sequence consists of panning photos of the city set to a jazzy 70s cop theme. In one photo, a police cruiser is shown and the \"camera\" zooms in on the front license plate holder, which is vacant. The meaningless zoom-in satirizes the production of the typical 70s-80s cop drama and, incidentally, makes me laugh every time.All the typical characters are included: the frustrated police chief who can't control Assy; the loyal, minority partner who acts as a foil to Assy's recklessness; the regular cops who detest Assy's means.... all are accounted for and all are hilarious satires of the typical police drama.The voice acting, primarily performed by Larry Murphy, is nothing less than spectacular. Assy's voice--breathy and gruff with a bit of a drunken slur--is so clever and unique that it ranks alongside all-time greats like Stewie Griffin (Family Guy) and Homer Simpson (Simpsons). Though the voice is slurred, the diction is somehow clear and easy to understand. This is a nice change from other Adult Swim program voices that often require closed captioning to understand.Besides the fantastic production and voice acting, the script is also hilarious. Assy's no- nonsense directness fuels most of the humor, particularly in his interactions with citizens outside the police force.If you have access to the Adult Swim comedies, Assy McGee is certainly worth the watching. Each episode clocks in at a mere 8-9 minutes, so you really have little to lose.","I couldn't believe that the Adult Swim guys came up with this character. I laughed for days just thinking about this show. Having finally seen the pilot I guess I will stick around for a few more episodes. Assy is pretty funny and the whole crew of police show characters are around, but Assy is hard to understand and that was a little frustrating. Most of the humor revolves around the fact that the title character is literally a walking ass with nothing else but legs that sport socks with garters and feet with traditional wing tips. Assy drinks too much and \"plays by his own rules\" as you might have guessed. The only other funny moments are Assy shooting many,many people and spending time at home - in the bathroom. It is not Squidbillies funny, but it is worth a look.","\"Please, don't kill me! I'm just an actor!\" \"Can you play dead?\" It's difficult to describe this show. It's like a crime dramedy. Where the bad cop is an ass. Literally. What's great about the show is some of Assy's perfectly awful one-liners. Cracking out such gems as \"Adios, Blimp,\" Assy Mcgee provides some great laughs at points. Sadly at other times, the show seems to drag along at a slow pace, making it almost hard to watch. This is definitely the kind of show you'll love or hate, there's essentially no middleman. It's not the best show on {Adult Swim}, but it has some strong points. It's worth looking into just to see if you enjoy it. I know I did.","Terrible. The only way I could even begin to consider it funny is if it made fun of itself. \"Amazing. It's about an ass that fights crime. And he drinks/smokes! How very funny! It's funny because where most people put things in their mouth, he puts them in himself! And now he's getting sexual service from some lady! This show is so great!\" That is what I would have to say if I liked the show, though I'm sure you can see the obvious sarcasm. I've noticed some people have been comparing this show to 12 oz. Mouse and Squid Billies. Why would you even try? There's nothing to compare. The other two shows actually have some decent character development. In conclusion, I hate Assy Mcgee. I twinge at the name of it."],"review-user":["cp_spandex","eyealone","liquidcelluloid-1","david-attic","phattan","aemery-2","Admiral_DongSmoker_III","Paranoid-Pajamas"],"review-date":["29 January 2008","11 December 2006","3 August 2008","7 November 2013","30 July 2007","27 November 2006","14 April 2008","9 December 2006"],"review-rating":["10","10","10","8","7","7","1"],"review-title":[" The Perfect 'Bad-Cop' Parody\n"," couldn't stop laughing...\n"," The Legend of Assy McGee\n"," Wishing for a return of Assy.\n"," Superb voice acting propels this clever satire\n"," Oh My - It's Assy\n"," Odd\n"," This Show is Great\n"]}