{"review-url":["http://www.imdb.com/title/tt0783328/reviews"],"review-text":["What shocked me about the COMANCHE MOON DVD (other than getting it for just five dollars at WalMart) was just how enjoyable and poignant it really was. As a serious reader who has read and reread all the classic LONESOME DOVE novels, I knew a lot was going to be left out and over-simplified, yet I wasn't prepared for how moved I was at the end.First, the bad news. The Comanche side of the story is watered down and much of the impact is lost. In the book the father-son conflict between Buffalo Hump and his son Blue Duck is literally Shakespearean, with enormous intensity and passion. As the son of a Mexican woman Buffalo Hump brutally raped, Blue Duck is a symbol of tragic retribution, and the destruction he brings on Buffalo Hump is chilling and inevitable. (\"The gods are just, and of our pleasant vices make means to plague us.\") In the movie it just seems pointless, and random. Also in the book, Blue Duck is a symbol of change. He fights better with pistols and rifles than with the bow or the lance, and he leads an army of white drifters rather than native warriors. But in the movie these changes are glossed over, so the deeper meaning is lost.On the other hand, the story of the Texans is told well and there are some amazing performances. Captain Scull and his sexy wife Inez are both annoying cartoon characters in the book, but Val Kilmer and Rachel Griffiths really succeed in making them not only charismatic and funny but strangely likable as well. It's interesting to note that in the book Inez Scull takes no part in any action outside of the bedroom, but in the movie she is far braver. During the Great Raid she actually joins the Rangers in fighting off the Comanches with a rifle! Normally I hate when these changes happen but here I felt it was right for the character and added a dimension of courage along with her cruelty.Steve Zahn and Karl Urban are both terrific as Gus McCrae and Woodrow Call, but what really surprised me was how much Elizabeth Banks did as Maggie Tilton, the mother of Call's son Newt. In the books I always visualized Maggie as sort of drab and hopeless, but in the movie she's practically radiant, full of courage and good cheer no matter what the circumstances. (Whether a real prostitute on the frontier would glow like Elizabeth Banks is another question.) But it was nice to see that Maggie was more than just a victim. And some of the final scenes with Newt leaving his mother's home and saying goodbye to a young Jake Spoon were incredibly heartbreaking. These were not characters I cared about when I read the book (I was much more interested in the Comanches) but in the movie the brilliant performances really made me care.All in all I think COMANCHE MOON the movie is really a very successful film -- if you take it on its own terms and don't compare it to the book.","I think the consensus is pretty unanimous about this recent TV miniseries: it's okay but it's a far cry from \"Lonesome Dove.\" It gets compared to the latter simply because this a prequel to that famous story. \"Commanche Moon\" is definitely worth a watch for any fan of westerns. Just don't expect it to be as intense as \"Lonesome Dove.\" Steve Zahn and Karl Urban are not Robert Duvall and Tommy Lee Jones, and the characters they play aren't as strong as how Duvall and Jones portrayed the same two guys. Some say it's unfair to criticize this movie because of the comparison but you have to compare it - it's the story of the same two leading Texas Ranger characters: \"Woodrow Call\" and \"Gus McCrae.\"The main difference, I found, was that this prequel is a lot of slower and more relational (the two Rangers and their women) at times. Yet, I didn't mind that because the two main women were pretty ladies and generally likable and agreeable people. They were played nicely by Linda Cardelini (\"Clara Forsythe\") and Elizabeth Banks (\"Maggie.\").. They helped make this long movie palatable. If you've seen pictures of women in the Old West, none of them looked half as pretty as Cardelini and Banks, though. They were a joy for these male eyes to ogle. Maggie's son \"Newt\" was a wonderful kid, too - the kind of boy every parent would want..The most interesting character, I thought, turned out to be \"Inish Scull,\" played by Val Kilmer. As in the western film, \"Tombstone,\" Kilmer almost steals the show from the leads. \"Scull\" is really an original, if I ever saw one: a strange dude, indeed. Actually, all of the supporting actors in here did a fine job, from Keith Robinson's \"Deets\" to Wes Studi as \"Buffalo Hump.\" I always find Studi to be fascinating, no matter what role he plays. I wish he had had a bigger role in this miniseries.One thing this film has in common with \"Lonesome Dove\" and other good westerns: the scenery and photography. It's just beautiful at times and is a joy to watch. We also have an excellent director of this film: Simon Wincer, who directed \"Lonesome Dove\" and an another outstanding TV western, \"Crossfire Trail.\" He also did two of my other favorite feature films, both based in his home country of Australia: \"Phar Lap\" and \"Quigley Down Under.\"Unfortunately, although I enjoyed this, \"Commanche Moon\" is nothing as good as the above-mentioned films.Yet, I still watched all of it and was sorry it ended, if that makes any sense. It made me want to watch Woodrow and Gus again, this time with Tommy Lee and Robert.Note: The title page says this is 360 minutes. That must have included the TV commercials. The two-disc DVD version I saw was about 4 hours and 40 minutes.","I must have seen a different version than the first person on the user comments section.It's really, really good...Steve Zahn and Karl Urban are great together. Val Kilmer's character is much like he was in the novel, although the emphasis is on Gus and Call and the Comanches. We get to see what happened with Call and Newt's mother as well. I won't spoil it, but it gives a lot of insight into Call's character.All the actors did a really convincing job. Steve Zahn had the biggest challenge, I thought, to follow Robert Duvall! There's a lot of action, humor, tragedy. It's got something for everyone. I can't wait until it airs, my family are all jealous I got to see it early!","What has hurt this film is everyone and their Aunt Matilda is comparing it to its illustrious predecessor, which is always going to hurt any show. If you take it as a western, it's a darned good show. We discover how our characters in 'Lonesome Dove' wind up in the situations they start up in (Such as: Why do two Texas Rangers, who live on adventure, wind up in a dead town? And how did Gus manage to lose the love of his life?) The performances are very good, and we see the exact same mannerisms the characters will have down the road. The actors did a very good job. The cinematography was superb, and while the music didn't live up to the legendary score of nearly two decades past, that was an impossible task, and it was still fine.It also helped that we had three episodes, which you just don't see in a miniseries anymore. Heck, it's downright impossible to see a two part telefilm these days.Fans of the western, rejoice!","I was able to watch all 3 episodes but have not read the book so I don't know if this was a faithful adaptation. I expected more action but thought the acting for the most part was pretty solid. Rachel Griffiths was a bit too over the top for me and Karl Urban was too stiff. Steve Zahn though was right on the money. I thought he sounded quite a bit like Robert Duvall and had a lot of the same mannerisms as well. It really made the connection for me that this was Gus in his younger days and it was for me the strongest aspect of the movie. A lot of familiar actors' faces among the Indians and it was different seeing Adam Beach as a pretty low down character. I'm accustomed to seeing him more of a good guy. Not sure I would run out and buy the DVD but it was certainly worth my time.","There have been some harsh criticisms of Comanche Moon on IMDb. I think this is for three reasons. First, purists are disappointed that the mini-series is not exactly like the book. Second, it's not as good as the original Lonesome Dove. Finally, people like to complain on IMDb and the greatest films in the world will have bad comments.I would like to say that no movie is going to be as good as the book. That's just the way it is. Lonesome Dove wasn't as good as the novel it was based on. Additionally, the movie of Lonesome Dove had some things left out ans switched around. That's just they way its going to be with a film adaptation of anything. So its a futile argument when looking at Comanche Moon.I do agree it's not as good as the original Dove. But hey, nothing is. I know people that guide their lives by the lessons they learned from the Dove. If I was going to compare every book I read, movie I watched, and TV I viewed by Lonesome Dove; I would be perpetually unhappy.This is a made for TV miniseries based on a prequel to Lonesome Dave (the novel) and sequel to Dead man's Walk, and that's what you get. It's the best TV I've seen in years. It's a fun set up for Lonesome Dove. We get to learn about the history of the Rangers we came to know and love in Dove. Zahn does an amazing job in recreating Gus McCrae. Elizabeth Banks and Linda Forenelli (sp?) also do great jobs as creating characters that help fill in the past of the rangers and Newt.If/when it comes on again, I promise you'll enjoy it more than some crumby reality show.","I am a big fan of Lonesome Dove and all the books in the series and I love the movie. I was happy to see that they finished up with Comanche moon. I have been a long time fan of Steve Zahn and was eager to see him in a serious role. I personally think that Steve Zahn has done an amazing job of re-creating Gus. I can't think of another actor who would have been better. He has the voice, the mannerisms, the pronunciation of word all down to a T. Granted, no one could ever hold a candle to Robert Duvall as Gus, but I think that Steve Zahn has done a pretty darn good job. Karl Urban acts the same in all the movies he has been in so he has made a good match for Woodrow Call. AS for the movie itself, yeah it's a little corny but can you really beat Lonesome Dove? No, I don't think so.","While I would agree that this is no Lonesome Dove, I did find it to have a few good scenes. The cowboy scene where they discuss what a genius is was one of them. However, the greatness of the original was how the characters were written and developed. I don't really see that with this installment, but keep in mind, the first part of Lonesome Dove paled in comparison to the 2nd and 3rd parts. I have always been a fan of Steve Zahn. It is never easy to take on a role made famous by someone else. I thought Zahn had many of the mannerisms that Duvall used down pat. I noticed the Gus finger wave and the head shake. However, the writing wasn't good enough to make me stop watching the actor and start paying attention to the story. I wouldn't call it a waste of time, since westerns are few and far between, but I wouldn't call it great TV either. I'll watch the rest.... if there isn't a game on.","I'm not sure this review contains spoilers, but I'm playing it safe by indicating there might be. Regardless, it's unlikely anyone will watch this film who isn't familiar with the book.There's an old wisecrack about laboring mightily and bringing forth a mouse. \"Comanche Moon\" is such a mouse.The novel focuses more on the Indians than the Americans. In adapting it for TV, McMurtry and Osanna rightly reasoned that the audience would be more interested in the whites than the reds. Unfortunately, there's little in the novel that we don't already know about Gus, Woodrow, and their friends. So the movie gives us mostly a portentous prehash of what will occur in \"Lonesome Dove\". The Indians -- who have their own story to tell -- are largely relegated to the background -- so much so that someone who hasn't read the novel will rightly wonder why it's titled \"Comanche Moon\".The novel has no overall story line, or much of a \"point\". This could have been fixed in the movie, by more strongly drawing the contrast between the Indians losing their lands and way of life to the encroaching Americans, who bring \"civilization\". This opportunity was missed.Unlike \"Lonesome Dove\", \"Comanche Moon\" has few extended scenes that develop character or relationships -- at least among the Americans. The extended scenes with the Indians have been largely removed or shortened. And for a (net) four-hour film, it is remarkably episodic and choppy. One gets the feeling the script was originally longer, and cut to reduce production costs.The screenplay comprises mostly clichéd dialog, aphorisms, and platitudes. Coming from the author of \"The Last Picture Show\", it's a startlingly bad script. McMurtry and Osanna had the opportunity to fix problems with the story and characterizations, but did not.Some of the best dialog from the novel is missing or altered, for no obvious reason. For example, Clara (Cassie) shows her intense hatred of Woodrow (Jack) by condemning Gus (Ennis) for always running off to be with his \"pard\". That tart little revelation of Clara's sexual jealously is gone. Then there's the scene where the ur-dense Woodrow warns Maggie not to let Jake Spoon \"compromise\" her. The exchange in the novel is shorter and harsher; the film tones it down, and doesn't portray Woodrow as quite the socially stupid, emotionally frozen stone he is. (When I read that scene in the novel, I wanted to punch Woodrow in the stomach -- or worse.)There are other changes, some of them understandable. Inish Scull's eyelids are not cut off; to do so would like have required expensive CGI. But Buffalo Hump has no hump! (Perhaps it was felt unreasonable to ask Wes Studi to schlep around such a huge prosthesis.) And Buffalo Hump's character is \"kindler and gentler\". He is nowhere nearly as grotesquely violent as he was in the novels.The only good thing about this near-turkey is Steve Zahn's remarkable performance -- not so much as Gus McCrae, but as Robert Duvall playing Gus McCrae. It is uncanny. He perfectly duplicates Duvall's mannerisms and manner of speech, without ever appearing \"deliberate\" or self-conscious. As was Duvall, he is wholly \"within\" the character. And he actually shows us Gus becoming \"more Gus\" in the third part of the film.The best thing about \"Comanche Moon\" is that it won't spoil your affection for \"Lonesome Dove\", not just a great Western, but a great American film.PS: For those who think Rachel Griffiths was over the top -- that's the way she was in the book.","I viewed the first two nights before coming to IMDb looking for some actor info. I saw the 9+ rating which surprised me since I was not that impressed by what I'd seen. (As reference, I happen to believe Lonesome Dove was the best TV western ever. I grew up next to the MGM back lots in Culver City in the 50s and have a certain sense of reverence about the Western genre.) So I saw the glowing first review and decided to read \"more\". There I found several reviews with 1 or 2 stars that summed up my feelings well about the lack of character development, poor editing, feeling that it was shot on the Universal back lot (MGM's is long gone), and overall impression that it was not going to come close to changing my feelings about LD. My impression is that the overwhelming vote of those who chose to write was \"less than a 4.0\".This got me to wondering about the process that yields a 9+ rating. If the people giving the 10s and 9s do not take the time to justify their vote, is the ballot box being stuffed by people with a monetary motivation? I have long used IMDb as one tool to screen movies and thought it the best available. Now I am not so sure.","Everyone wants Duvall and Jones back, come on! Viewers are saying things like, Zahn and Urban aren't as deep...Puhlease! Were you as deep when you were young? That's the whole point: They have a lot to learn. Zahn and Urban pull off the shallow innocence they were directed to act, and with superb commitment to preserving the nuances of Duvall and Jones' input into the characters. Zahn is flagrantly perfect as the early Gus, and Urban is subtly perfect as the early Woodrow. What a bold move it must have been for them to take on such a position in the entertainment industry. They must have known they would have everyone coming down on them for not actually being the beloved originals, yet they clearly put the best effort forward. I gave it a 7 because the editing was choppy in places, and time-lines were sketchy, but the acting was a joy to watch. Val Kilmer was absolutely great. One more thing: I expect audiences would have been more accepting of the mysticism implied by the appearances of a jaguar and blue and gold macaw if more effort had been put into the way they appear and are so simply accepted by the characters.","Things I like. Steve Zahn as Gus, nails the part, copies Robert Duvalls mannerisms which makes him feel comfortable to Gus fans. (some of the other actors copy their predecessors style in this series as well). Karl Urban, looks grim and tough, but can crack a joke and smile too, which T.L.Jones did in original series. The gear, the guns, the clothing, all accurate, or very close to period accurate. I'll never forgive Costner and Duvall for having a nylon lariat in their chuckwagon in Open Range. The Comanches, they are actually riding bareback, rather than hiding a modern saddle under a Navajo blanket. And they aren't painted as politically correct peace loving pastoralists, but as a proud warrior people. There are some dumb scenes, but it beats the heck out of yet another variation on doing something stupid to not win a million dollars reality game shows.","I must have missed a part of this movie... I found myself asking who is this? And, when did that happen? It seemed to jump around but I kept watching for fear I was missing something and it would all be explained to me. I loved Lonesome Dove but this movie made no sense to me at all. I did love all the actors but what happened to the rest of the movie? It made me go \"what\"? at the beginning of each part..As far as the scenery - I thought it was fine..It made me feel though like I was leafing through a book and leaving pages out.. The ending had me a little confused too although I imagine the boy was waiting for his father and was meant to leave you wondering if his father would finally come home to his son and be a father since his mother was now gone..I would like to read the book just to see what I missed in the movie..I don't expect this one to win any awards.","the photography is good, the costumes are good, but the editing is bad. The various scenes are cut, or stopped at the wrong times, and the conversations are s-l-o-w and tedious. This slowness continues the entire show. It is a very tedious show to watch. . . . I believe that more scenes SHOULD HAVE BEEN ADDED, but that would make it a longer show. It is very slow-moving. The writers should have made it JUST a 1-night show, and not prolong our agony night after night. There is nothing else on, otherwise I'd change the channel (the first night). I feel bad for the Indians of the time, and am angry at the white-men for what they did to the Indians, but thats our history.","Wow...as a big fan of Larry McMurtry western tales and the Lonesome Dove series in particular, I was s-o-o-o looking forward to Comanche Moon. What a tremendous letdown. Maybe my expectations were set too high because of the all around excellence of Lonesome Dove...the story, the characters, the cinematography, the music...it all worked.Comanche Moon by comparison comes across like a bad Saturday Night Live skit. The characters are completely colorless, the dialogue is babble and the plot meanders mindlessly all over the place. It seems like the actors are all reading from TelePrompTers. I couldn't relate to any of the characters, good guys, bad guys, not even the incidental characters. David Midthunder's performance stands out in particular. It looks like it was plucked out of an eighth grade middle school performance. I'm sorry, I'd like to find something positive to say about Comanche Moon, but I just can't do it. There's nothing there.","I am seldom motivated to write a review unless inspired by the quality of the movie. In the case of Comanche Moon I was so uninspired I felt the need to warn others how bad this TV mini series is. Here are a few thoughts.The Indians: They came across like they were in a Saturday Night Live Skit, making fun of how Indians talk. When McMurtry writes dialogue in his novels it reads so interesting; I am not sure how they ended up with what they got.Gus McCrae: Looks like Festus from the old Gunsmoke Series. Acting is OK and the mannerisms from Robert Duvall's McCrae are right on, but the look is pure comedy cowboy.Clara: Maybe you could use a little dirt or sweat on her next time. Ever been in Austin in the summer before Air conditioning? I promise you women did not look like that. Do you think they never saw any episodes of Dearwood?Gov. Elisha Pease: Again whenever they are in the Governor's office it feels like a Saturday Night Live Skit, and the skit is bombing.Woodrow Call: Call is the most reasonable character, of course He talks so little how can you screw up that? But hey, what about that hat?Blue Duck: See above and include the fact that he isn't even a tiny bit scary. They should have gotten Javier Bardem to play the part.The Rangers: Right out of \"O Brother, Where Art Thou\" I expected George Cloony to come riding up and them to break into a song.Perhaps I am premature because the miniseries isn't completed but I doubt I will watch any more of it any way.I would not expect anyone to be able to duplicate the enthralling feel of Lonesome Dove, but I watch this and it seems like they have no feel for the old west at all.","Unlike the superficial and dumbed down Terminator T.V. special that aired on Fox the same night, Comanche Moon is a return to excellence in T.V. production and writing. This prequel to the original Lonesome Dove mini-series is as brilliant to watch and, in some ways more vibrant than the original -- and it moves more quickly. Now, devotees of the original might not at first \"buy\" Steve Zahn and Karl Urban as the young Gus and Woodrow (respectively), but the quality of the writing and production bear watching further, and before long we are in love with the characters, because their personalities retain the same qualities originally personified by Duvall and Jones. Unfortunately, in the first episode of this new series we do not get to see much of the Joshua Deets character, originally portrayed by Danny Glover, but one scene of the young Deets comforting a victim of a Comanche rape was exquisite. The addition of some rich new characters boosted this drama remarkably, most notably Rachel Griffiths as the outrageously pompous and scandalous wife of the Captain of the Texas Rangers; Val Kilmer as the Texas Rangers Captain who knows his outrageous wife all too well and is himself a bit off the beam while nonetheless heroic; and Sal Lopez as a thoroughly detestable Mexican bandito gang leader (with Jake Busey as a toady). Unless you do not like westerns whatsoever and unequivocally, there is nothing that should keep you from watching this finely written, acted and lavishly filmed production -- and a tip o' the hat to CBS for bringing this to us.","First of all, I did not read the book, but I am now planning to. I would praise this miniseries most for the inclusion of the Comanche language, and I hope it is authentic. Any comments out there on that? The custom of torturing captives spread northward from the Aztecs, who conquered other tribes in central Mexico and butchered thousands of people on their hideous sun god altars. The custom of scalping was introduced by the whites, in Canada and New England, and it spread westward. Prolonged and viciously cruel executions were the rule throughout \"civilized\" Europe and only in the late 19th and 20th centuries has humanity made a concerted effort to be rid of them, despite the appalling atrocities of the Holocaust... enough said, the things to watch out for in Comanche moon are first, the alleged cooperation of the Texas Rangers with the occupying Yankee troops during Reconstruction. The Rangers were regarded as an armed Confederate force and were officially disbanded during this period. Documentations of their activities as an outlawed organization are extremely scarce. Many of them hired out as gunmen for the cattle barons, against rustlers who were running cattle across the Rio Grande. Mexican hacienda owners and ranchers in Nuevo Leon had had their livestock decimated by a series of wars, and they bought cattle, no questions asked. Other rustlers stole cattle in Mexico and sold them to the Texas barons. The Mexican government complained in 1878. The Texas Rangers who fought the Mexican rustlers were unrestrained by any court system and they were brutal to the Texas- Mexican population. They chased suspected rustlers into Mexico and shot them for \"resisting arrest.\" They often behaved as badly as the Mexican War's notorious \"rackensackers\" who were Rangers and their imitators who invaded with General Taylor in the north. They were so abusive of civilians that Taylor almost sent them home in disgrace, but rescinded the order when his forces were vastly outnumbered by General Santa Anna's army. Another thing to watch out for in Comanche Moon is the depiction of Cynthia Parker. When she is recovered by the Texans, a little inaccuracy is excusable, but it shows her with long hair and later, her husband, the warrior Peta Nocoma, is shown as still alive. Peta Nocoma died from an infected wound before Cynthia Ann was recovered,and she had cut her hair very short, a sign of mourning. Personally, I think this production is yet another gringo view of Texas history, with hardly any presence of Mexican Texans in it but for a typically stereotypical \"Mexican bandit\" El Ahumado... and those cages on pulley masts hanging over the side of a cliff are ridiculous. Was this guy supposed to be an engineer? And where would he get those tall trees to make into masts in that part of the country? However, I praise the author's desire to include authentic wildlife of the period, which have mostly vanished today. Yes, the jaguar did range that far north, but it was nocturnal. A daytime attack by a big cat would have more likely been a puma. And there was a parrot that lived in canyons and dive bombed any creature or person that got too close to its nest. It is now gone, too. There is a scene in an Indian village with the Indians dying of cholera. SMALLPOX! The Comanches were done in by forked tongue treaties and the US Army, in the first documented modern use of germ warfare, gave them blankets taken from a smallpox hospital. Quanah Parker, the son of Cynthia Ann Parker and Peta Nocoma, continued the tribal custom of polygamy. He lived a long and accomplished life and his grave boasts an impressive monument.","Please do not waste six hours of your life watching this as I did. The fact that I did is not a very good reflection on me. The only redeeming acting job in this clunker was by Wes Studi. How a 'prequel' with similar roots can not even be in the same universe as Lonesome Dove is beyond me!! It was a disjointed, rambling, incoherent story. Plot lines were not developed, action scenes were almost laughable and the big ending (disappointment) was a fitting ending to this mini-series. Val Kilmer who I have thought as a reputable actor played one of the strangest roles that I have ever seen him in. His final scene in the show had to have been a filler by the director. I have been reading these reviews for years and this show prompted me to sign up!!!","Was really looking forward to seeing a continuation of Lonesome Dove but this was total garbage. Cinematography was terrible. Shot way too tight. Was almost viewing the Grand Canyon through a stationary telescope. Editing was cut, cut, cut. Not even smooth. More like a bad student editor. Don't know if McMurtry did the screen play but the dialog was terrible. Really like Val Kilmer's portrayal of Doc Holiday in Wyatt Earp but what in heck was he doing with this character in Comanche Moon??? I have no idea. Even looked like it was shot on a sound stage using the old Bonanza sets. How can the director of the original Lonesome Dove gone so wrong with this? Where was his head.............. Can't say much for the acting either. It's a shame to have messed up such a beautiful western that could have been but more like they rushed this one just to get it in the can. Have read other reviews and see that others felt the same way. Not even curious to watch the next few nights cause it would be just a waste of time like the first night was.(2nd post)..................OK, since nothing else was on TV I must be honest and admit that I watched the last 2 nights of Comanche Moon. And I will be honest to tell you that I didn't make it to the end of either of the last 2 episodes because I fell asleep! I can only admit that I was watching the two main characters very closely and I could pick out some mannerisms that Steve Zahn did while portraying the character that Duval did such an excellent job with. So I must give Zahn credit for that. As for Karl Urban's portrayal....simple dead meat. Can only say again that I was very disappointed only because I cared so much for the original LD and like others .......have defended my feelings for a truly great western.","Agustus and Call really did Nothing? Why are they Hero's they did nothing other then get to places after the bad guys where dead. What was the point of this show? I was very very Disappointed. I expected more action, more story, and to see the birth of Heros and Great Deeds. Instead I saw very little, it seemed like Agustus and Call where just side story's for the great Indian Chief. I'm not even sure that the history is even very close. They did very little to show why the Texans and Comanche fought against each other.The only good part about this movie was Zhan who played Gus very very well and is a great actor. A lot of good story that could have been gone to waste. It was sad and I wish that I had not watched it.","The casting on this film is incredible! You could actually go straight into Lonesome Dove and believe you were watching the characters age. The acting was amazing. Every character gave you a glimpse into the mind set of the original actors. Perhaps not all scenes were historically correct, however, I don't believe that was the purpose of the film. I believe it was meant to give us an insight into the connections that formed the bond we all came to love in the original film, and that it did accomplish beautifully. I hope it shows again followed by the original. Again, this casting director did a stellar job of casting, I want to see more of her work. Thank you for three lovely evenings of entertainment!","Comanche Moon takes us Ten years into the future Call and Gus are now approching middle age and Rangering is all they have known both men have two women waiting for them for Gus it's the love of his life Clara for Call it's a young whore named Maggie Tilton who is in love with Call both women want their men to give up Rangering but it's in their blood. Gus and Call are made Captains and their responsbilties increase. This puts a hardship on Gus and Clara's relationship as she wants him to give it up. For Call it's duty above else even above a woman who loves him. This tale could be called Bittersweet a love letter to a bygone age. Steve Zahn however amazed me he actually Channels Robert Duvall you can even see Duvall in Zahn's performance he acts like him so much it's uncanny. Karl Urban is easily one of the best Woodrow Call's ever portrayed his performance stands up to Tommy Lee Jones portrayal and maybe actually even betters it. What makes this movie so outstanding is the level of respect that comes across it's well down and is respectful to the book from which it is based on. Val Kilmer is excellent as Captain Scull making again a argument that he is simply one of the best in Hollywood today. Highly recommended highly enjoyable and well worth buying on DVD when it comes out.","I, like many folks, believe the 1989 epic Lonesome Dove was one of the best westerns ever produced, maybe THE best. And, realizing that most sequels (in this case a prequel) are certain to disappoint, my expectations were low. Comanche Moon met that expectation with its marginal directing and acting, poor casting and frankly, a lousy script. Lonesome Dove created western heroes of Captains McCrae and Call due to incredibly strong performances by Robert Duvall and Tommy Lee Jones. Prior to living in Lonesome Dove, we believed they bravely fought to rid Texas of bandits and savage Indians during their rangering years. If I had only seen Comanche Moon, I would think these two boneheads were a couple of incompetent, cowardly idiots. In Lonesome Dove, Call and McCrae supposedly chased Blue Duck all over Texas and never managed to capture or kill him. In Comanche Moon, a shot to Call's boot heel convinced him to settle down and raise cattle. There wasn't a decent fistfight or gun fight in the entire miniseries. The best punch was McCrea sucker punching Inez Scull, a funny scene but out of character for McCrae.Where was McCrae's wit and charm? Clara's love for McCrae, a drunken, unshaven slob and philanderer was completely implausible. And Maggie's love for Call, a dispassionate and sullen loner, defies logic. The cinematography was excellent, superior to the original. Credit goes not only to HD technology, but the cinematographer. The Comanche Moon miniseries was better than anything else on TV for three nights, but sadly that's not saying much.","This was a miserable failure. I was so looking forward to it. I tried watching it several times and each time came away thinking \"this is just too bad to watch\". Val Kilmer who I have liked in other movies (sometimes a lot) was a ridiculous caricature of ??? It was silly. With the same director as Lonesome Dove and a good novel to start with I cannot figure what happened to get this movie to be so bad, other than the acting. I thought the acting ranged from ridiculous (Kilmer) to poor and uninteresting (Gus and Woodrow). Also I didn't think the screenplay had any flow or dramatic tension to it (and the book definitely did). Normally I could watch a bad western just to enjoy the cinematography but I couldn't take part1 of this mini for more than ten minutes at a time, and finally not at all."],"review-user":["Dan1863Sickles","ccthemovieman-1","skyking1967","ScarletPimpernel64","living-systems","red17","ashale8","confused4410","grizzledgeezer","dfales","mrytide","usedtobeawannabe","lsabousky","jmarquardt2001","Old_Bald_Eagle","asbufra@yahoo.com","jmh2350","vegacarrol","mprake","Cedar-4","professor7","ubesmiley","bluesman-20","bongo491","june43"],"review-date":["9 May 2011","3 March 2008","5 February 2007","16 January 2008","16 January 2008","17 January 2008","16 January 2008","14 January 2008","17 January 2008","16 January 2008","23 April 2008","14 January 2008","16 January 2008","17 January 2008","13 January 2008","14 January 2008","13 January 2008","17 January 2008","17 January 2008","14 January 2008","16 January 2008","23 January 2008","20 January 2008","16 January 2008","15 January 2008"],"review-rating":["8","7","10","9","6","8","8","6","4","4","7","8","2","3","1","3","8","1","1","2","10","10","4","1"],"review-title":[" Much Is Missing, But Much Is Worthwhile\n"," Agreed: It's No 'Lonesome Dove,'' But It Still Has Merit\n"," I saw it at a screening a few weeks ago...\n"," A worthy prequel\n"," Comanche Moon was worth my time\n"," For what it is, it's worth watching.\n"," It's no Lonesome Dove but.....\n"," A few good scenes\n"," A poor adaptation of a less-than great novel\n"," Are IMDb Votes Reliable?\n"," What's the matter with everyone? It's a prequel for goodness sake!\n"," probably won't win awards, but enjoyable to watch\n"," Very Disappointed\n"," terrible editing\n"," A Major Disappointment\n"," Disappointed\n"," Quality Television Returns\n"," Comanche Moon is informative, if you watch out for historical inaccuracies\n"," Go Watch Grass Grow Instead\n"," What a mess\n"," What a disappointment\n"," Incredible Casting!\n"," The Final Chapter in the Lonesome Dove Saga.\n"," Tough Act to Follow - Poor Effort\n"," awful\n"]}