{"review-url":["http://www.imdb.com/title/tt0713619/reviews"],"review-text":["If I was going to skip one episode of \"Supernatural\" this season, this would probably be it. It doesn't fit in with the story arc, or add anything to the season's mythology. It does show Dean as someone capable of deep feelings. He thought that he loved Cassie and when Dean loves people, he doesn't lie to them. He sleeps around with a lot of women, but he's capable of more. When he does open up to someone, like Cassie, he stays committed to them even years later. He drops everything to go and help her, which I think is sweet. It also shows the difference between Sam and Dean. Sam was willing to marry Jessica without ever telling her the truth about the family. Dean, as soon as he felt something real for a woman, told her everything up front. Dean's usually more willing to break the \"rules\" for the people he loves, than Sam is. Really, though, if you're in a hurry to get through the season, you can skip this episode and not miss anything.\"Route 666\" revolves around a ghostly, racist, monster truck killing African American men. It runs them off the road, then vanishes into the night. One of its victims happens to be the father of, Cassie, Dean's old girlfriend. She dumped Dean when he told her about his life of hunting, but now she needs his help. Sam & Dean come to town and start investigating. It turns out that the truck belonged to an evil racist guy name Cyrus. Cyrus wanted to marry Cassie's mother, and when she choose Cassie's father instead, Cyrus went nuts. He firebombed a church and tried to kill Cassie's dad.Dean and Cassie get closer again. They wind up sleeping together. Meanwhile, the truck picks off another victim, this one white. Cassie's mother finally explains that Cassie's father killed Cyrus, after Cyrus nearly beat him to death. Then Cassie's dad and his friends hid the body. Now Cyrus is back for revenge and his spirit is attached to the monster truck. Sam & Dean have to stop it by tricking the truck on to hollowed ground -the church that Cyrus burned- before Cyrus can kill Cassie. Then, Cassie tells Dean that she really doesn't see a future for him, given his life style as a Hunter, and Sam & Dean leave town.There are some good parts to this episode. I like Sam teasing Dean about his relationship with Cassie. He's so happy about Dean actually caring for a girl that it's like he's mentally singing \"Dean and Cassie, sitting in a tree...\" It makes me laugh. I think it's cute when Sammy acts like a pesky little brother. Also, I like the way the brothers defeat the monster truck at the end. It's very cool, with the truck sort of dissolving into nothing as it meets the Impala head on.On the downside, just the fact that I feel bad about giving this episode a low rating, shows that the social message takes over from the story in \"Route 666.\" My grandparents came from different cultures, so I think that this could actually have been a good story to present on the show. It's important. But, it's done way too heavy handedly here and it comes off a fake. It's not a story about racism. It's like a 45 minute public service announcement saying, \"Racism is bad,\" with nothing else to make the characters and their problems real. It cheapens the whole message, because it doesn't connect with the audience. It's a hollow, cardboard presentation of a real life problem. Plus, Cassie herself is very, VERY unlikable to me. Nothing against the actress, I have no problems with her. But Cassie dumps Dean twice -TWICE!- in one episode. She only calls him because she need him, after she broke up with him when she found out that he was a Hunter. Then she uses him and tosses him aside, after he solves all her problems for her. He opened up to her and she broke his heart. I just can't like anyone who hurts Dean, I don't care how relevant a social message they represent.My favorite part of the episode: Sam's saying how much he misses college and \"conversations that don't start with, 'So, about this killer truck'.\" It makes me laugh every time.","I love this episode for two reasons...(1) Dean's emotional side (toward a woman) is clearly revealed in this episode and I LOVED IT. He's not the hard ass he's portraying himself to be and the \"love/hate\" relationship he had w/ Cassie was cute. (2) Sam being the pestering little brother to his big brother is absolutely adorable. My favorite two favorite parts when Dean arrived at the crime scene after being called by Sam and just before Dean went to Cassie's and the two of them were standing by the car talking and it is revealed that Dean actually loved Cassie. The episode itself was great.. interesting highlights and special effects but J2 just stood out to me for the reasons listed above. J2 are both awesome actors. My hats off to you both.","In a lonely road in Cape Girardeau, Missouri, a black man driving a car is chased and hit by a truck, falling off-road and dying. His daughter Cassie Robinson calls her former boyfriend Dean and asks him to investigate the mysterious accident. Sam and Dean see that three Afro-Americans and the Caucasian Major of the town were killed in weird accidents on the same road. When the truck threatens Cassie, her Caucasian mother Mrs. Robinson tells a tragic racist murder that happened thirty years ago, and the brothers realize that they have to fight against a hatred spirit in a ghost truck.In this episode, Dean discloses his first and unique love to his brother, surprising Sam and showing that he has feelings, but also that his hunting wish is stronger than his love. The story is only reasonable, touching in the delicate theme of racism in an efficient manner and blending it with a supernatural event. My vote is seven.Title (Brazil): \"Rota 666\" (\"Route 666\")","Excellent episode, showed Dean has not only good taste by picking Cassie for his girlfriend but also shows he does have a heart and can love just one woman, and he's not just some guy who loves and leaves em! Aweso e episode. Applaud them on this one. I only hope that some way they go back to the Cassie relationship next season (if there is a next season??) i would like to see her come back into their \"supernatural\" lives especially Dean's. Also I like the fact the chose an African-American woman to be the special lady in his life that got away somehow. I hope they don't screw that up and end it as he episdoe ended. The girl who played Cassie was truly a looker and it was good to see the WB branching out into what we all see in everyday life-the interacial coupling that has become common and acceptable(finally!)","Overall, I liked this episode. I don't agree with many of the posters that this is too preachy RE: the racial issues. I actually thought it handled that issue well. The time that the original murders were to have taken place, the behaviors described were unfortunately happening in some places, usually with the law turning a blind eye on the white perpetrators against the minority victims. The only problem I have with this episode is Cassie! As a number of people have noted, she was attractive. That's where her contribution ends, in my opinion. She was a terrible actress: she was screechy, and she over-acted in every scene. Every line had such emphasis. Also, she had no chemistry with Dean. He did -- he's great at showing just the right balance of emotion and restraint, and \"Dean\" clearly felt for her, wanted her, and their time together obviously meant a lot to him. She, well, she was just plain bad. I agree that I would have liked her character to return in future eps, but played by a better actress. Lisa, in later episodes, was MUCH BETTER!","Apart from being a clever and well-marketed variation on the nowadays hugely popular horror genre and a splendid formula to attract potential new fans in general, I always somewhat considered \"Supernatural\" as a massively giant homage towards the genre through the decades. Although not always noticeable to younger viewers and/or people who only have an interest in more recent horror films, each and every single episode contains a few obvious and subtler references towards classic and influential titles. From that point of view, it was only a matter of time before the writers would pay tribute to the 'creepy vehicle without a driver' type of films, and even more specifically the 70's milestones \"Duel\" (Steven Spielberg's acclaimed debut) and \"The Car\". Being an avid fan of these two films, I enjoyed \"Route 666\" a lot even in spite of its flaws and shortcomings. The episode opens tense and atmospherically on a remote Missourian road, where a black man is hunted down and eventually killed by a menacing monster truck with seemingly no driver behind the wheel. The victim's daughter, Cassie, happens to be Dean's ex-girlfriend and she calls the Winchester Brothers in for help. The brothers can't prevent two more similar \"accidents\" before discovering the ghost-truck sudden presence relates all the way back to a racial dispute of the 60's, involving both of Cassie's parents as well as several more prominent inhabitants of the little town. Some of my fellow reviewers around here tend to label \"Route 666\" as one of the weaker entries in season one, mainly because the script is too preachy regarding racial issues and shows a different and more emotional side of Dean's character. He's usually the strong silent type, whereas here he's confronted with unfinished romantic affairs from the past here. To a certain level I agree with the racism debate, but it didn't bother me that much, really. The writers eventually had to give an explanation to the presence of the ghost truck, and racial conflict is an acceptable one as far as I'm concerned. Concerning Dean's emotional vulnerability, I can only state it's admirable to see how the writers continuously attempt to provide depth and detail to the main characters. Dean's behavior towards Cassie sheds a whole new light on him, in fact. Besides, what really counts in this episode is the wondrously sinister truck and its virulent attacks. It's an impressive and overpowering vehicle, producing blinding lights and grisly engine noises. In case you worshiped the brilliant aforementioned \"Duel\", you will definitely find some amusement in the compelling chase sequences depicted in \"Route 666\".","I agree with the other commentary, that there was too much social message and not enough story. I did not get a feel of the story or characters. Dean did not seem to be Dean, more like a Invasion of the Body Snatcher Dean. A lifeless Dean. No humor or a feel of a ghost story in the script. The music was not even the same. No hard driven edge of the other episodes. Sam did not get much time on this show either. I liked the truck. The show was well acted and directed 5 out of 10. Not one of the better ones. I like the airplane one better. How can the truck be hunted after they burned the body? That is like opposite of the whole show","I liked the fact that the series tackled the issue of racism, and had felt that they would given the subtle social and political subtext of the show.The message in the episode is far from subtle though, with the references to racism and the Civil Rights movement in nearly every scene, to the point of lecturing. I'm not defending racism, of course, just think this is a bit overbearing. Final product is rather disappointing with the social commentary and \"supernatural\" elements existing unevenly. In part the show is \"Burning Mississippi\" but then swithces abruptly into \"The Highwayman\". Still I'm glad that they finally gave Dean a romantic interest, and concur with the other viewer that they should keep Cassie as a recurring character. She is a good complement to Dean personality.","Back in the \"Skin\" episode Dean was advising Sam about not getting close to people and that for someone living their lives, he can't have friends or any close attachments.In \"Route 66\" we know why Dean is being the \"Anti-social\" man he is. Because he was hurt before when he got close. A few years back Dean met a girl, Cassie, and he fell in love for the first time, so he decided to come clean about his family and what they do only for the girl to dump him and break his heart. However Dean can't hate the girl and when she calls for help he drops everything and rushes to be by her side (The man is adorable, He can be a one woman's man after all!)I liked the way Sam was teasing Dean about the girl, Dean looking uncomfortable drinking tea from a cup and Sam still pestering about how he misses college. But I hated this Cassie a lot. I don't care if Dean loved her, She dumped the guy TWICE and she didn't hesitate to ask for his help! (Unlike later in Season 6 where Lisa was ready to try a relationship with the man even though he keeps doing what he is doing, or Jo is season 5 who died saving his life). I'm not looking forward to see her again. The writing of the episode was medium though I liked the truck and how they dealt with it at the end, but the directing was good. However you won't miss much of the story arch if you miss it. MY vote is 7 out of 10.","This is probably my least favorite episode. I lived in Cape Girardeau for quite some time. I can tell you there is no ocean or shrimp boats, fresh crab or scallops anywhere near Missouri. Cape Girardeau is the only inland Cape, it's on the Mississippi River. It looked like the license plates were from Mississippi, which may explain why there was so much racial tension. Missouri and Mississippi are 2 completely different states that don't touch one another. There are many roads in and out of town and none of them are Route 6 or Route 666. This whole inaccuracy was very distracting. Also, Cassie did not seem like someone who would want to hang around Dean if she was well educated. I did not buy them as a couple and didn't enjoy the lengthy love scene. Jo was more Dean's style."],"review-user":["katierose295","essentialdiva","claudio_carvalho","vzexv68","mthudak","Coventry","mm-39","dudeman5685","zombiehigh18","ljmzta"],"review-date":["17 March 2008","27 November 2010","16 December 2006","7 May 2006","19 August 2010","19 January 2009","23 August 2007","1 October 2006","29 October 2011","10 December 2009"],"review-rating":["5","8","7","10","8","7","5","7","3"],"review-title":[" Probably the Weakest Episode of Season One\n"," Too cute...\n"," The Ghost Truck\n"," Route 666\n"," Cassie...(contains spoilers about future episodes of the show, not this episode)\n"," Brothers against Evil: Ku-Klux-Trucker\n"," Did not like this episode\n"," Far too preachy\n"," A racist killer truck\n"," Get your location right!\n"]}