{"review-url":["http://www.imdb.com/title/tt0762101/reviews"],"review-text":["For anyone who has ever sought happiness, \"Half Empty\" is a must-see. This original cross- cultural musical comedy has hilarious numbers, which make \"The Producers\" seem boringly staid. Writer Bob Patterson puts his soul into sharing his thoughts on life, wisdom and happiness, even scribbling inspirational comments on index cards as his girlfriend spills her heart out, ending their relationship. When his book on happiness, \"North Star\" finds zero success in the States, his publishers send him to Germany for a book signing tour. While explaining their decision to Bob, the boardroom erupts into a rousing song which would make Monty Python proud. From his arrival in Hamburg, Bob's complete ignorance of the German language leaves him at a distinct disadvantage. However, he soldiers on, impervious of his hosts true feelings towards him, until a wildly devoted fan arrives and changes everyone's reaction toward him.The original songs propel the film, often describing the subtext of the story in side-splitting precision. The cast, led by Robert Peters, exhibit an immaculately dry sense of humor and inhabit their characters as if they were not acting. See it for: A case study of how good intentions are totally irrelevant; How merciless Americans abroad are viewed; How little reason it takes to burst into song, and, above all, For a silly, entertaining, unconventional laugh.","I wasted 35 minutes of my life on this turkey before I gave up. The main character is completely clueless and astoundingly unsympathetic, but there is no humor in his blundering. As soon as he arrives in Germany, the screenwriter pulls the old \"there's only one room in the hotel, you'll have to share a room with a pretty girl\" stunt. Come on, at least you could let them develop their relationship a bit first. Watch \"It Happened One Night\" to see how to do it right--or any of a thousand movies since then.The acting is consistently third-rate, and the improvised dialogue should have been left on the cutting-room floor. It meanders with no plan at all, despite the fact that the film telegraphs the relationship's destination from the moment Greta is introduced.The first song, in the boardroom, is mildly funny but badly sung. The rest of the songs (well, to be fair, I only heard those in the first half-hour) are just pointless and awful. Most of the singers are painfully out of tune, but not in any intentionally humorous sort of way.","This film was a huge surprise to me while i watched it at Cinequest in the big California Theatre in San Jose. It's a musical, which normally I don't like, but I have to say this one was different. Robert Peters, who directed the film and stared in it, did such a wonderful job. During his Q & A he told the audience that he only had two other people for his crew! Most of the dialouge was made up on the fly and he actually made the film while attending another film festival in Germany! I can't say enough great things about this movie, the only bad thing is that you really tend to notice the camera work and it shakes a bit. If you happen to come across this film- check it out!","Had the fun pleasure of viewing a new independent film called \"Half Empty.\" I usually go out to the local cinema with my husband and feel as if we are held captive to the latest Sequel, or Prequel that Hollywood throws at us. This was DIFFERENT and surprisingly  SO MUCH more entertaining than anything Hollywood spends millions advertising. When my husband and I go the movies, we go to be entertained  and \"Half Empty\" did just that and the film did so in a smart manner that made me feel as if my trip to the movie theater was worth it. It is a funny, human, and surprising sometimes musical story that cleverly entertains in its simplicity. I especially enjoyed the scene with the 4 men singing in harmony in the bathroom. It is almost like an operetta. That particular scene reminded me of a scene in \"Phantom of the Opera\" when 4 of the performers did not just, i.e., they sang against one another in a friendly retort. I am not a film maven but this film was more enjoyable than any other major studio film I have seen lately. It is silly, funny, entertaining and amusing. Completely enjoyable  which is what I expect from movies but rarely do they deliver like \"Half Empty.\"","this film explores if not creates a whole new genre with perfect imperfection --- hilarity, truth, fun, talent and circumstance that make for MAGIC. from creative musical numbers to off the cuff comedy that incorporates actors at their very best, if i hadn't have known better, i would have thought there was an elaborate script here.what you get: a mighty wind meets conversations with god meets something so fresh and new and delightful that it becomes it's own entity.peters and fell both give stellar performances and reel you in immediately. the rest of the cast is also phenomenal. there are no small parts....... only small actors, and everyone involved here should be patted on the back, taken out to dinner and be considered for an Oscar.well done!","\"Half Empty\" is a hilarious musical about the eternal optimist in this case, a self-help book writer who goes to Germany mistakenly thinking he's popular there. Instead of an adoring audience, he finds himself adrift in a world of jaded misanthropes, including the woman who is supposed to be his publicist. His attempts to make friendsin scenes that are largely improvisedlead to one great encounter after another when he is verbally abused by nihilistic musicians, gruff gangsters, etc. In time, he manages to win over his publicistboth her heart and her mind--but his own world view is shaken when his hero, a much more popular self-help writer, turns out to be not quite what he seems. The action is punctuated by several musical numbers.We saw this at the DeadCenter film festival in Oklahoma City and were blown away. This is a really funny, inspired small-scale indie production. You could quibble about a few technical things (like the lighting, which is a bit dark) but the piece is funny and inspired enough that you can't care too much. If Voltaire were writing \"Candide\" today, the character would be a self-help writer."],"review-user":["michaelbz","geoff-367","mathewalmaden","robertbellamy76","ctab4","steffiescott"],"review-date":["8 January 2008","26 April 2009","14 March 2008","14 September 2007","15 December 2007","20 June 2008"],"review-rating":["9","1","7","10","10","8"],"review-title":[" Ingenious!\n"," Trite, inane, and just plain stupid\n"," Very Original\n"," Thoroughly Entertaining - THIS is why I LOVE movies\n"," Brilliant, Innovative, Beautiful, Touching and completely Hilarious\n"," A Modern Day Candide\n"]}