{"review-url":["http://www.imdb.com/title/tt0762073/reviews"],"review-text":["Not for the squeamish, but the number of twists, inventive uses of situations using vampire mythology, gorgeous visual extremes, together with interesting and quirky characters make this one of the most stunning horror films I've ever seen. It descends into utter madness along with characters, but never seems exploitative or horrific without purpose. There are copious amounts of bloodletting accompanied by some nasty sucking and squishing sounds, but also subtle moments where you laugh out loud. As he tends to do, Chan-wook Park keeps you off center with leaps in time and plot and situation that you have to fill in for yourself forcing your involvement in the story and characters. And there's a lot of literal leaping. Keeping in the vein of vampire myth (pun intended), they have superhuman strength and can nearly leap tall buildings in a single bound (to coin a phrase). The first time our heroine is carried by the across the tops of buildings by the troubled vampire priest, it has all the magical romance of Lois Lane and Superman - but this romance becomes increasingly disturbing - but driven by a strange and conflicted 'love affair' not by mere horror.The acting is superb, particularly OK-vin Kim, the gorgeous actress in the female lead role who, at 22, shows a range that is remarkable. The character borders on a kind of black widow film noir type. She careens from innocent to impish to vixen to demon with utter conviction. This is a really smooth and nervy performance. If you love real art in horror, or are a fan of Oldboy - don't wait for the video, see it immediately.","Viewed at the Festival de Cannes 2009 Sang-hyun, a beloved and admired priest in a small town serves devotedly at a local hospital. He goes to Africa to volunteer as a test subject, is infected by a deadly virus and dies. A blood transfusion brings him back to life and turns him into a vampire. Word spreads that he is a healer and people flock to him. Among them is an old friend, Kang-woo, and his wife, Tae-ju. She and Sang-hyun begin a love affair, which soon spins off into murder. While Sang-hyun tries to hold onto his humanity (he refuses to kill and has a novel way of getting the blood he needs), Tae-ju really gets into this whole vampire thing, whereupon Sang-hyun realises something has to be done.Fans of Park Chan-Wook will have no trouble with this film. Yes, all his visual tricks and techniques are there, but he sets them in scene as skillfully as ever.The performances, every single one of them, are all top notch. The blood, when it comes, is red and raw. At the same time, this is still very much the thinking person's vampire film. If you're into wooden stakes, bats, garlic, holy water, decapitations etc. then this isn't the film for you. If you enjoyed, for example, Abel Ferrera's The Addiction (1995), then it most definitely is.Typically for a park Chan-Wook film, especially coming on the heels of I'm A Cyborg, But That's OK, there is a lot of humour; black, mordant and very funny, both visual and verbal. The audience at the press screening laughed frequently and often loudly.The fact it's a vampire film may deter some viewers, which would be a pity. It makes me want to say \"It's a vampire film, but ...\" and then tell them why, if that's a problem, they should overcome it and give the film a chance. It would also be unfair to call Thirst (to use its international title) a horror film, given the connotations associated with that label. If you can accept Master And Commander as a buddy / relationship film, as well as an action-adventure, then I hope you know what I'm trying to say.If I have one criticism to level against this film, it's the length. 133 minutes are just too many. It could lose quite a few of them with no harm to the narrative or characterisations. But that is not a reason not to seek out the latest film from this excellent Korean writer-director.","Director Chan-wook Park became famous all over the world with his \"vengeance trilogy\". And even though I liked those three films (Sympathy for Mr. Vengeance, Oldboy and Lady Vengeance) very much, it was also pleasant to see Park exploring different horizons with the untraditional romantic comedy I'm a Cyborg, But That's OK, and more recently, with the film Thirst, which represents an unusual and very interesting vampire film, where the bloody scenes provoke the same level of impact as the evolution of the two main characters and the twisted way their relationship follows. However, Thirst is not a perfect film: there are some unnecessary elements in the screenplay, and some changes of tone feel a bit forced. Nevertheless, that is offset to some point by the interesting story, the perfect control Park has over his actors and the visual style with which he creates attractive images and moments of an intense emotional strength. In this last aspect, and I will say this with the fear of falling into the hyperbole, Park's direction remembered me to some point to filmmaker Orson Welles (1915-1985)' work, due to the care he brings to every frame and to every camera movement.Besides, Thirst is faithful to the vampire subject, because it respects the \"biological\" precepts from the myth, wisely avoiding its most theatrical and bland characteristics...something which is an indirect way to say that there is an abundant level of blood and violence in this movie. And, in the Oldboy tradition, the violence is very graphic and direct. The vampires from Thirst are not the sophisticated ones from the books written by Anne Rice, nor the stylish monsters from Underworld or Blade. The characters from Thirst are realistic and imperfect persons with a strange illness which tests their conscience, as well as their capacity to survive one more day at the expense of losing their humanity.So, despite not being an excellent film, I liked Thirst pretty much, and I think it deserves a safe recommendation as a very interesting experience which I would not classify as a \"horror film\", but as an intense passional drama with supernatural subjects which work as analogies of the reasoning and the spirituality when they are cloudy by the passion.","Now that I have seen it, it was NOT what I was expecting, at least not until the very END. I read some of the other reviews before picking up a used copy of this from Amazon and was glad I did. Having been first introduced to Park's work via Oldboy, I was curious to how he'd treat the genre and was rather pleased at the clever manner in which he executed it. I think Park has matured in terms of presentation because while Oldboy and some of his other work has very nice and deliberate camera work, he has some nice innovations in Bakjwi that I had not seen in other vamp movies. For example the scene where Father Hyeon is realizing the \"beast\" growing within him as he gives his shoes to the always barefoot Tae-ju and he is able to SEE the blood pumping through Tae-ju's skin and his eye's widen in blood-lust for it. That was a nice effect. I was also happy that Park did not CG the crap out of the movie and the is in fact very little CG at all. I came away from Bakjwi being totally set up to think one thing was going to happen and get taken for a ride in true Park fashion. Additionally, I liked that Park played with a little symbolism and reversal whereas we don't usually get this is Asia cinema. During the beginning of the movie we see the plot develop slowly and get to know the characters and you feel like an invisible observer to the thing that are transpiring. Park treats you a little like Ghost of Christmas future coming to show you, albeit a bit boringly, what life is like outside your world. Ah, but then we start to feel a little kinship with the befallen Father and his burgeoning lust for Tae-ju and conflict with duty as a priest. We almost start to root for them even until Park not so nicely slaps us back into reality and we really see that in the end Bakjwi is a movie about moral dilemma and right and wrong. It won't spoil it if I tell you to watch Bakjwi from the mindset of a priest and I think you'll come away from it with what Park wants you to come away with. Don't expect Oldboy and stylization because that's not what you'll get here. A very interesting take on the genre indeed. Those who missed the MANY literary elements and religious allusions watched some other movie, not Bakjwi. After Bakjwi, watch Let The Right One IN, it's also not what you'll expect either.","Talk about getting your socks knocked off, this newest amazing movie from Park Chan-wook's would be my favorite new take on the vampire genre, if not for \"Let the Right One In\", which still remains my fav, but this one is right behind it. A Catholic Priest volunteers for some radical medical experiments, that turn him into a vampire. He tries his best to be a good vampire, and not kill anybody, but it's pretty clear, that's going to be rather difficult. Park mixes in some black comedy into this one, just as he does in most of his earlier films, but the subject matter is dead serious. It also has one of the best vampire sex scenes I have ever seen. The vampire Priest steals blood from hospitals and anywhere he can find it, but when he meets his new lover, things pretty much go downhill, when she wants to become a vampire too. This is an excellent entry into the vampire genre, and continues Park Chan-wook's amazing body of work. This is not to be missed, every minute of the 134 min running time is entertaining as hell.","If you love Chan-wook Park, you know what to expect. His films are brutal, poetic, tragic, and artistic, with splashes of very grim humor. THIRST is clearly Park's style, and I loved every second of it, from the cinematography (every shot is gorgeous and creative) to the story, which blends Shakespearean tragedy, murderous love, Gothic horror, and layered character drama. The characters are complex and there is plenty of moral ambiguity to go around. Even the most sociopathic character evokes sympathy. The direction is restrained and the performances are nuanced - like SYMPATHY FOR MR. VENGEANCE, there are too many subtleties to take in on the first viewing. Chan-wook Park is an intelligent, bold, consistently surprising filmmaker. It's unpredictable - scenes go from brutal and heart-wrenching to laugh-out-loud hilarious in an instant. This is closer to LADY VENGEANCE then SYMPATHY FOR MR. VENGEANCE as far as being over-the-top and comical. But, like LADY VENGEANCE, it's incredibly rich, thought-provoking, and rewarding.If you like beautifully told vampire stories (LET THE RIGHT ONE IN) or are a fan of Chan-wook Park, seeing THIRST should be obvious. Easily one of the best films of 2009.","I won't bore you with any synopsis, chances are you already know them. And hopefully you are already familiar with Park Chan-Wook's work.I STRONGLY disagree with some of the other commentators in saying that \"Park has not moved on from the vengeance trilogy blah blah blah.\" Because you know what? He HAS!!! The vengeance trilogy were different from each other in style to begin with, how can you even compare the sombreness and subtlety of \"Sympathy For Mr Vengeance\" with the frantic and extravagance of \"Oldboy\"? Park Chan-Wook has incredible style, but his movies don't all share the SAME style! That has been true and remains true with the release of \"Thirst\". \"Thirst\" is an incredible picture, it literally has EVERYTHING you want in a movie. Jaw-dropping violence, tasteful gore, great humour, incredible suspense and even very realistic sex scenes. The story is so crazy that at no point can you guess what will happen next. I'm so happy to say that Park is back in top form with this fantastic dark-comic-vampire-love-story. Watch it as soon as you can!","From the director of Oldboy comes this slick vampire flick. Kang-ho Song stars as a priest who is accidentally changed into a vampire while being cured of a deadly, mysterious virus. His vampirism and priesthood are quite at conflict, but he is able to survive by robbing the hospital's blood bank and unconscious patients who might not mind some siphoned blood. Because of his supposedly miraculous survival, he comes into the lives of Ha-kyun Shin's family. Shin has cancer, and his mother believes that Song can cure it. Unfortunately, Song's vampirism raises his levels of lust to a height where he can't help but fall for Shin's young wife, OK-vin Kim. Kim is intensely interested in the world of vampirism, and the two become lovers. The film from there goes in weird directions that I think one should experience for themselves. What really should be mentioned is Chan-wook Park's mastery of the medium of cinema. My God, I've rarely seen such a masterful visual artist at the peak of his powers. The major flaw of the film is that it's a little incoherent, especially near the beginning. Park is interested in telling his stories mostly in the visuals, which can be difficult to follow at times. But when it works, man, does it fly. The film is also perversely hilarious. The final sequence, easily one of the best of the decade, is simultaneously heartbreaking and delightfully ridiculous. OK-vin Kim should become a worldwide star after this film. She gives one of the best performances of the year.","No pun intended. I'm not going to spoil anything about the story, but it's safe to assume that you already know, what kind of character the main actor portrays. And of course being a priest while being \"naughty\" exaggerates all that. Plus this is the most erotic movie from Park Chan Wook yet.If you have seen Wook's previous works/movies you know he is very visual (in a good way) and it shows again here. While it strays away from the vengeance theme of his prior movies on the surface, it still has quite some heat hidden underneath. And when that boils, quite a few bad things start to happen. But through all that dark, there also moments of light (fun) to be had too. A very stylistic and though provoking movie, that lives outside the mainstream and does a very good job ...","'Oldboy' director Park Chun-wook returns with what must be one of the yuckiest and at the same time most serious vampire flicks in movie history.Trusting the latest Hollywood fad, vampires these days are supposed to be rather nonviolent, asexual, love-lorn chevaliers instead of the evil rampantly sexual blood-sucking mind-manipulating man-beasts of yore. This is the film you want to see if you want to remember the sticky thrills of the past... well, at least in the second half.'Thirst' starts out with a lengthy character exposition culminating in a slightly different love story. The vampire transformation of a priest is, over quite some time, sidelined by the romantic and sexual aspects of the story, which makes for some awkward viewing. But the last 40 minutes or so are surprisingly gory. Well, maybe not so surprisingly if you know 'Oldboy' and 'I'm a Cyborg but that's OK', but I guess it's fair to say that 'Thirst' beats Park's earlier films in terms of in-your-face violence. All in all, be warned that this is neither art cinema nor a horror flick. It may be too disgusting for many and too tame for some. 'Thirst' is original, entertaining and fortunately a little less weird than Park Chun-wook's earlier endeavors.","I like to keep my reviews short, i rather review the film than compare it or describe it scene by scene like a lot of people like to do, so let's get to it.I honestly came close to not finishing the movie because I was looking for scary and this isn't much of that, but there is A LOT of blood and violence. The only reason I kept watching was because even though it wasn't creepy or scary, it was a beautifully shot and very well made film. The story feels different than other vampire movies it's not just a bunch of the same old vampire clichés. the acting is good for the most part, personally i think the 2 main characters were amazing. It's kind of long, but the movie gets better as it progresses, the ending is nothing less than what You would expect(considering who directed the film). So in short, if you're looking for scary in the traditional sense You won't find it here, but if You're a fan of the Vampire and gore genres or just want to watch a good movie You'll certainly enjoy it.","In Korea, the dedicated Priest Hyo-Sung (Kang-ho Song) volunteers to work in a special research of the Emmanuel Virus, a.k.a. Curse of Bazira that does not affect African, only Caucasian and Asian; However he contracts the disease and dies, but after a blood transfusion, he surprisingly survives among the fifty volunteers and is considered saint by the worshipers. Sooner Hyo-Sung finds that the transfusion was made using vampires blood and he is thirsty for blood and lust for woman. Hyo-Sung finds a way to get the necessary blood without killing innocent people. When he sees Tae-ju (OK-bin Kim) that he met in Pusan when he was a teenager, Hyo-Sung learns that the young woman is abused by her husband Kang-woo (Ha-kyun Shin) and by stepmother Lady Ra (Hae-sook Kim). The priest has sex with Tae-ju and sooner they plot a scheme to get rid of Kang-woo. Then Hyo-Sung turns Tae-ju into a vampire, but the blood spree of Tae-ju forces Hyo-Sung to an ultimate decision.\"Bakjwi\" is a weird and original vampire tale from Oldboy's director Chan-wook Park. The plot is totally unpredictable with many twists and despite the unnecessary and long sex scene of Kang-ho Song and the gorgeous and talented OK-bin Kim, the story is engaging and disturbing, blending religion, romance, drama, black humor and horror. The cinematography is another plus and the camera work explores unusual angles. OK-bin Kim's performance is stunning with a wealthy character that oscillates between innocence and evilness. My vote is seven.Title (Brazil): \"Sede de Sangue\" (\"Thirst of Blood\")","After watching Oldboy I was a little disappointed by the rest of Park's work, some of it is good but it never approaches the level of humour and originality that Oldboy had. This one does, it is nothing like Oldboy in plot or style but the same level of quality is there.The acting is good with Kang-ho Song, OK-bin Kim and Ha-kyun Shin delivering excellent performances. Kim in particular manages to swap from the creepy horror scenes to the surreal comedy without the slightest misstep.The plot is strange with lots of twists and turns and takes a big swipe at the vampire clichés.The directing is spot on with tons of pace and humour throughout and some of the most memorable scenes I have ever seen. It does boast what is probably the weirdest love scene you will ever see.This is just a great film.","The vampire \"craze\" has, in my opinion, actually proved its worthiness of such infamous categorization. There were many sub-genre films last year from a multitude of countries. I've reviewed many and have a few more to discuss. Forgive my indulgence, but since I've recognized the trend as a phenomenon (which it is and, coincidentally, features my favorite horror staple). I'm going to now move outside of North America for a bit and introduce you to hopefully meaning films that you didn't see as of now.Of the many effects of Twilight is the creation of \"guy\" and \"girl\" vampire movies. I hate this sexist categorization, which has the effect of polarizing an entire generation of fans into \"sides\". I think men are prone to hate Stephenie Meyer's work (and its offspring) to some degree because they feel some sense of betrayal that an archetype which was always theirs is now liberated. Women may be unlikely to enjoy future \"neutral\" pics since they grew up with ironclad expectations that were enforced four times. We need more directors to create vampire films which either gender is capable of enjoying (unequally) if vampires are going to survive the craze and remain relevant. Cue: Thirst This Korean film was directed by Park Chan-Wook of Oldboy fame. There are two ways to dissect it. Either it straddles between gender expectations and is universally marginally enjoyable, or it is a floundering mess that doesn't decide which target audience it prefers and should therefore be viewed by no one. Don't let me convince you that the film has no inclinations. Its director is a man whose fame is story-driven action films. Its protagonist is male and has a passive-aggressive interest in his lover (more on this later). Still, his desire for a woman he has known both before and after mortal life is not contrived, and his attention is returned. There is a male slant to this picture, yet it is not so one-sided that women could not enjoy it. The same cannot be said of Daybreakers or New Moon.The plot follows an Emile Zola novel called Thérèse Raquin, which I have not read. According to Wikipedia, the novel is about an affair that develops between a married woman and a single man. He kills her husband during a fishing trip and begins dating her. The two of them are incapable of having sex because they picture the dead man's body between them. They are thus driven to insanity, but care for the woman's ailing mother. At the novel's conclusion, they try to kill each other, discover each other's plans, and commit suicide.Now, transcribe this nearly 150 year old French novel into modern South Korea and you've got Thirst. Chan-Wook doesn't embellish the story enough to elevate this to must-see. He often ignores many of his own ideas in favor of following his inspiration. I think the most memorable parts are when his scruples are unhinged by narrative. His use of the mother-in-law as the foil for their bad romance is just perfect. See it.The protagonist is originally a devout Christian who becomes a vampire after a faulty blood transfusion following his volunteering for a new medicine. He thus becomes the god he once was smitten with. People flock to him and view him as a grand healer. OK. That's really cool and could have provided a great basis for his relationship. Yet this idea is given little idea screen time as he changes into a realistic Christ figure who tries to maintain his virtue even though his lifestyle demands that he relinquish it. Instead of confronting the delusional people, he instead sips blood out of comatose hospital patients.Let's continue with the Christian allusion. The woman tricks the vampire man into killing her husband. Her overprotective mother-in-law suffers a stroke and eventually warns friends of the family of her daughter-in-law's treachery (finger waggles). The man kills her but resurrects her. The two of them invite former friends over and the woman begins mercilessly harassing the humans. The man says enough is enough and decides to drive to a beach and forces her into waiting for sunrise with him. They both die, but he atones for her crimes (and his own but the film portrays her evil more prominently).The woman character is a caricature, and her profession offers an explanation for her behavior. She is a housewife with no education, while the man is a priest whose mortal life was restrictive. Vampirism magnifies their characteristics. She becomes a monster like one would expect of someone without knowledge. He becomes a demigod with a spirit. His life is how atheists view themselves and her life is how religious people view those without divine intervention.","More excellent film-making from Park Chan-wook, who shows no signs of flagging in his quest to bring his unique brand of inventive and unique movies to the world. This is his version of a traditional vampire movie, and while it's not quite as quirky as I'd expected from this director, it certainly packs a punch and proves a breath of fresh air in a cinematic world inundated by the latest Twilight movies.Put simply, THIRST holds your attention. The storyline, about a priest who finds himself infected with a blood virus and then is slowly transformed into a bloodsucker, is never less than thoroughly entertaining. It goes without saying that the direction is flawless – every scene and sequence is expertly crafted, leaving no margin for error. Emphasis is on characterisation throughout, which is always a strong point, and the actors have the talent to fully bring their roles to life; the main actress is particularly fascinating.Overall, this is a gruesome, gripping, melancholic look at the world of the vampire. Be warned, it's explicit and often in your face, but as with the rest of the director's output, this is a film that sets out to challenge assumptions and overcome cliché. It works a treat.","Thirst: A bit speechless. Where to begin reviewing this film? Well, it is certainly a fantastic Thriller, some elements of Horror and Gore. It is unlike any film I have seen, and I have seen it all! Psychological, disturbing, creepy at times, culturally quite accurate (Korean), a must see for fans of Vampirism for sure, but also anyone that wants to see a disturbing, complex, form of a Thriller. I have not seen any other films by this Director but I certainly will be doing so now. Thirst has a bit of everything in it - not strictly about vampires by far. And to those reviews that mention that it is \"Twilight\" for adults? You have it wrong. It is nothing like Twilight. Yes, there are some similar traits but no, it is not a Vampire Romance...it is SO much more than that and the other positive reviews are bang-on and speak for themselves. I particularly enjoyed the character developments, the struggles with faith, family, friends as well as the eerie facial expressions. What a creative and well-written story. You need to see this for yourself and come to your own conclusions!","Might end up being the biggest disappointment that I will see in 2009. I seem to be the rare person who disliked Park's Oldboy, but I think that his \"Lady Vengeance\" and \"Sympathy for Mr. Vengeance\" are among the best films I've seen in the 2000's decade. Therefore, I really was looking forward to see this, especially as it got such positive reviews. Instead, I found the film clichéd, and broke little, if any new ground to the vampire genre. And while I can appreciate a bit of gallows humor in movies like this, I felt Park did this at very inopportune times.Others have compared/contrasted this to \"Let the Right One In,\" and I have to say that \"Let the Right One In\" was far superior to this one, and was a fresh take on the vampire genre. Sadly, Park's take was a tired one.","Color me seriously disappointed. The vampire genre received some exciting new blood (boo yourself!) with Tomas Alfredson's film adaptation LET THE RIGHT ONE IN, so the idea of Chan-wook Park, the director of OLD BOY, doing his take on a vampire movie was pretty exciting. Sadly, despite tons of rave reviews and great buzz, I found this to be a huge disappointment. First, it is completely unfocused. The film runs 133 minutes and a lot of that time is spent on nothing really. Second, and this is what bothered me the most, is the film is a walking vampire cliché. The same old story of a girl finding out a vampire is so scary, yet so incredibly hot. The only saving grace here is that Song brushes his hair. Actually, I think he is quite good in the lead role (be thankful I didn't say he got to \"sink his teeth into the role\") but the script offers him little in terms of conflict. I think he is upset about keeping his celibacy vows for a few minutes and then spends the next hour and a half humping away. When he finally converts his charge, she unrealistically goes from mousy to bitchy monster in a finger snap. Again, it all works into a big pile of \"Eh\" for me.","To begin, Chan-wook Park is easily in my top 3 favorite Directors of all time. Everything he has made is a masterpiece. He treats every single scene of his movies like a painting, each of them a work of art. Thirst is probably his most strange and creative film I have seen by him. He creates a fresh and new story to add to the tale of vampires. Thirst is a much different film compared to Parks more gory films, like his Vengeance Trilogy. This film while still having its gory moments has much more of a comical side to it.The main character is Priest Sang-hyeon. He gets involved in a experiment where he believes he is doing good and is going to heal people by going through this experiment. By the end of it he contracts the EV disease but survives and is transformed into a vampire. Now that he has the blood thirst, and sexual urges he tries and contains himself so he can still be a priest and serve the Lord.http://tgtbtw.blogspot.com/The whole first half of the movie is filled with awkward and very humorous moments. It's a side you don't see too often in Park's films. So for me it was great to see his sense of humor really come out in this movie but at the same time make it a very entertaining vampire movie. But about half through the way movie the story drastically changes and it begins to go back what were used to seeing in Park's films. The movie is basically split into two acts. The first being the goofier and humorous type, where we see the Priest learning what it means to be a vampire. But the second act stays more true to the vampire genre, with lots of eating of humans, and the vampires having more of the higher species mentality.Both acts of the movie are fantastic, and the whole cast is superb. One actress in particular is OK-bin Kim. She is only 22 in this movie, but her character forces her to play many different types of roles. She starts out as a very submissive wife who was forced into her marriage, but we than get to see her grow and overcome her \"nightmare\" of a life, as she calls it. Each of the characters has a rise and a fall, and the movie is filled with very dramatic and even more intense scenes. I'd have to say the last 20 minutes is my favorite 20 minutes of any Chan- wook Park films, and maybe of all times. The ending is set in gorgeous scenery, and has a very emotional finale. If you are a fan of Chan-wook Park in the slightest, or interested in the myth of vampires, you must see Parks rendition of it.","Having enjoyed previous films from director Park Chan-wook, The Vengeance Trilogy and I'm a Cyborg, I was keen to see what he would bring to the vampire genre; I was not disappointed. Kang-ho Song plays Sang-hyun, a Catholic who volunteers to take part in an experiment to find a vaccine an incurable disease. He catches the illness but unlike everybody else he survives after a blood transfusion and people believe he is a miracle worker. He soon discovers that he requires more blood if he isn't to relapse. Working in a hospital he gets the blood he needs from a coma patient. When he is invited to join in a game of mahjong with a childhood friend he realises blood isn't the only thing he thirsts for; he is drawn to his friend's wife Tae-ju. They are soon in a physical relationship and she tells him that her husband has been abusing her, in order to protect her he kills his friend during a fishing trip. Soon after the two lovers are haunted by the guilt of what they did and Kang-ho lets slip that she was not in fact abused; on learning this Kang-ho kills her but is so overcome with guilt that he gives her his own blood and she returns as a vampire. She is not like him however; she is not satisfied with blood stolen from the hospital blood bank and starts killing people. He may have given up the priesthood but he still believes that it is wrong to kill people so takes drastic action to prevent her from killing again.This was a really good story which was an interesting twist to the genre and avoided the usual clichés; there were no fangs, garlic or harm from religious symbols. The acting from Kang-ho Song and OK-bin Kim, who played Kang-ho, was very good, the development of their relationship seemed believable despite their unusual circumstances. As one would expect from an 18 certificate vampire film there was plenty of gore, there were also quite a few sex scenes although it didn't feel like they were there for titillation. I would certainly recommend this to anybody who likes vampire films unless they have problems reading subtitles.","I am no fan of Chan-wook Park, neither of extreme violence as a pursuit of visual aesthetics and possible box office results. And I am still trying to figure out why vampire movies and TV shows have become so popular in recent years.That said the director is an auteur with his own visual style and story telling. This movie is original in two ways: it's impossible to tell its genre in a word or two, as it is a thriller, a vampire drama love story with some good dose of dark humor. And there is no clear story line as the movie wanders from one tone to another along with the lead actress' change in character. This is not particularly a bad thing, as the charged visuals and very good acting by the lead characters allow this film to go anywhere.Kang-ho Song is one of my favorite actors who has this genuinely funny face and has shown great performances in Milyang and Salinui chueok, both of them great movies. The lead actress is also very talented and her acting comes across vividly throughout the movie.While desperate people looking for miracle cures to their ailments are devoted to religion, the priest overcomes his extreme sense of guilt and leaves religion to follow carnal pleasures with his married lover. Amidst the bloodshed there is passionate sex, constant struggle a la Postman Always Ring Twice and love of Romeo Juliet.If you can endure the bloodshed, you will experience an original movie by a bold and talented filmmaker.","Sang-hyun, a priest working for a hospital, selflessly volunteers for a secret vaccine development project intended to eradicate a deadly virus. However, the virus eventually takes over the priest. He nearly dies, but makes a miraculous recovery by an accidental transfusion of vampire blood. He realizes his sole reason for living: the pleasures of the flesh... I don't usually watch Chan-wook Park's films because when it comes to the art of film-making, he is suspect. He usually makes sick, twisted and weird stories that leave me wondering, how crazy is this guy ? But on rare occasions, I end up liking the film despite how twisted it is, take for example Chan-wook Park's film Oldboy, a crazy journey but ultimately it works. Bakjwi aka (Thirst) on the other hand is just twisted. This is basically bad vampire porn. The film focus on the relationship between Sang-Hyun the priest turned vampire and Tae-joo a girl who's sick and tired of how she's treated by her own family. Their romance is ridiculous and absurd and when it comes to silliness it gives Bella and Edward from Twilight a run for their money. I tried to watch Bakjwi, I really did, I made an effort but after one hour of this nonsense, I had to turn it off because I was loosing IQ points by the second. It amazes me how people are actually enjoying this Korean flick but to each his own I guess.3/10","(This has been edited for space)Chan-wook Park's new film is a complex film that is not easy to classify. Nominally a horror movie, the central character is a vampire, the film actually has elements of comedy, theology, melodrama, cultural invasion (and its analog of viral invasion of a body), romance and few other things as well. It's a film that has almost too much on its mind. The film takes its own matters and mixes them with classic European literature, in this case Emile Zola's \"Thérèse Raquin\". It's an odd mix that doesn't always gel, but none the less has an incredible power. Here it is almost 24 hours since I saw the film at Lincoln Center (with a post film discussion by the director) and I find my cage is increasingly rattled. Its not so much what happens is bothersome, its more that its wide reaching story and its themes ring a lot of bells in retrospect.The plot of the film has a will loved priest deciding that the best way to help mankind is to volunteer for a medical experiment to find a cure for a terrible disease. Infected with the disease he eventually succumbs and dies, but because of a transfusion of vampiric blood (its not explained) he actually survives. Hailed as a miracle worker the priest returns to the hospital where he had been ministering to the sick. Unfortunately all is not well. The priest finds that he needs blood to survive. He also finds that he has all of the typical problems of a vampire, and its no not possible for him to go out during the day. Things become even more complicated when he becomes reacquainted with a childhood friend and his family. The priest, some of his animal passions awakened becomes taken with the wife of his friend. From there it all goes sideways.An ever changing film, this is a story that spins through a variety of genres as it tells the very human story of a man who finds that his life has been radically altered by a chance event and finds that he is no longer who he thought he was. It's a film that you have to stay with to the end because the film is forever evolving into something else. Its also a film that has a great deal on its mind and the themes its playing with are constantly being explored in a variety of waysThe film has enough going on that one could, and people probably will, write books discussing the film.The two of the strongest parts of the film are its vampiric elements and its romance The vampire part of the tale is brilliant. There is something about how it lays out the ground rules and the nature of the \"affliction\" that makes such perfect sense that it kind of pushes the old vampire ideas aside. Sitting in the theater last night I found myself amazed at how impressed how well it worked. I think the fact that it played more or less straight is what is so earth shaking. Here is a vampire who just wants to have a normal life. It's contrasted with what happens later, it makes clear that living an existence of hunting humans really isn't going to work. Its not the dark world of Twilight or Lost Boys, rather its something else. I personally think that the film changes the playing field from a hip cool idea or dream into something more real and tangible. (The sequence where the powers kick in is just way cool) The romance is also wonderfully handled. Sure the sex scenes are steamy and well done, but it's the other stuff, the looks, the talk, the gestures outside of the sex that makes this special. I love the looks, the quiet stares as the forbidden couple look at each other hungering for each other and unable to act, the disappointment and heartbreak of betrayal both real and suspected, and the mad passion of possible consummation. This is one of the great screen romances of all time. It perfectly captures the feeling and emotion of deep passionate love (and lust). If you've ever loved deeply I'm guessing you'll find some part of your hear on screen, I know I did. The statement \"I just wanted to spend eternity with you\" has a sad poignancy to it. It's both a statement of what was the intention as well as the depth of emotion. The tragic romance will break your heart. I won't lie to you and say that the film is perfect and great. Its not, as good as the pieces are and almost all of them are great (especially the actors who I have unjustly failed to hail as amazing) the whole doesn't always come together. The various genres, thematic elements and tones occasionally grate against each other. Frequently I was wondering where the film was going. I hung in there even though the film seemed to be wandering about aimlessly.I liked the film a great deal. I loved the pieces more than the film as a whole. Its been pinging around in my head since I saw it, and I'm guessing that it will do so for several days more. Like or love is irrelevant since this is a film that really should be seen since it has so much going on that it will provide you with enough material to think and talk about for days afterward. One of the meatiest and most filling films of the year.","AA great Chan-Wook Park's film, after the weird and awkward \"I'm a Cyborg, But That's OK\" in 2006. Park is one of the reputable Directors in South Korea. Thiz time, he's absolutely back in the right track by bringing a strange and unique vampire story. Park is previously known for his vengeance trilogy comprises \"Sympathy for Mr. Vengeance\" (2002), the powerful \"Oldboy\" (2003) and \"Lady Vengeance\" (2002). Two main Cast members blend into a fabulous chemistry. Kang-Ho Song delivers one of his best performances of all-time. Song successfully represents the vampire's aura very well. His love interest, OK-Bin Kim also has shown a terrific performance with an unusual and complicated character as a devout housewife in the beginning and gets into mischief in the end. Several scenes contain some vulgar sex scenes but still perceivable to describe the relationship between two characters. I love the camera angles, sometimes dynamic and other times just go conventional. It's effectively supports the story-telling. In my notes, the Special Effects are efficient but effective and believable. The story is about a priest who volunteers into a mysterious medical experiment. As the consequence, he turns out to be some kind of vampire. Afterward, he involves into forbidden affair with his friend's wife. The relationship becomes intimate and deathly for everybody, including both of them. It's a very good contemplation that sometimes desire could turn out to be havoc. It's well-executed movie. Bravo! Welcome back, Mr. Park.Visit My Blog on JONNY'S MOVEE : http://jonnyfendi.blogspot.com","There's a lot of stuff about repression here. A priest trying to come to terms with his newfound vampire bloodthirst, an alienated girl smothered by the middle-aged woman and her needy pathetic son who brought her up. Like the broken pieces of a puzzle, these two people figure together in awkward ways and romance erupts, wild fiery messy passion full of bloody bites and slushing sounds. We also get crime details painted with broad noirish brushstrokes; a murder the two protagonists are trying to keep under wraps, the mother who knows who murdered her son but can't say anything about it to anyone because she's paralyzed by stroke. All this is hastily nailed together with planks and long rusty spikes made of very very dark humor, so that if Thirst was a staircase it would creak and make lots of noise and you wouldn't trust it to support your weight to the top.Yet it does, and that's part of what makes Thirst so good, that it works despite itself because all the pieces click into a pattern so that the romance is made dangerous by the horror undertones that lurk beneath it, the heady serious themes on regret and guilt the movie touches on constantly swim beneath the surface and are brought afloat on the whalebacks of black comedy that spurts jets of dark red blood all over the floor every time it rises to the surface. We even get the old vampire cliché, the \"good vampire\" protests the killing of innocents for their blood while the \"bad vampire\" proclaims it the way of nature; except this is exchanged while the two of them make impossible CGI jumps across rooftops like it's all an opera or very theatric melodrama, as though Park is saying \"you know the tropes, now watch the presentation\".All this takes place across empty white walls with crucifixes hanging on them, a bunch of people are huddling around a small kitchen table to play mahjonng over heavy purple velvet, faces are lit sickly green against dark/golden brown backgrounds like something out of a Roger Corman film or a Nakagawa kaidan picture from the 50's and we only venture out of doors when the sun is down and the streets are empty. Of course you need to excuse Park his trademark overindulgence of overhead crane shots because there's a gazillion of them. At some point, the emotional codependence of the two protagonists turns into a purely physical one as they lie on the floor sucking blood off each other, all the heavy homely colors are brushed aside and the room is painted white, and the movie makes a getaway for \"will the protagonists make it or will the murder be revealed?\" waters that bring Seance on a Wet Afternoon to mind. That, and the seriocomic mood + cutting irony + impossible surreal things taking place in a domestic setting made me think of the Coens in more than one occasion.This is all good to me but what I like most about it, what makes it special to me, is how all the repression is visualized. With David Lynch, there is a mysterious wooden box in the basement and someone's taking a lantern down the steps to it and we only hear the sound of the lantern breaking and it's all dark again. Here we're down in the basement and we see the box, it's a wardrobe flat on its back with a heavy rock keeping it shut and something's fighting to get out, and then we see the lantern break to pieces. Thankfully Park steers clear off most \"Azn horror\" clichés in the way Takashi Miike did in his musical remake The Happiness of the Katakuris. Come to think about it, this is a musical with all the dance numbers played to no music at all and it's great that way."],"review-user":["tjackson","Simonster","Argemaluco","akkoziol","Indyrod","yfguitarist","allstar_beyond","zetes","kosmasp","Radu_A","c_alejandro_bm","claudio_carvalho","imdb-19548","doctorsmoothlove","Leofwine_draca","MissOceanB","asc85","udar55","liersenic","Tweekums","mehmet_kurtkaya","BernardoLima","dbborroughs","jonnyfendi","chaos-rampant"],"review-date":["21 August 2009","15 May 2009","18 January 2011","3 January 2010","17 May 2010","14 August 2009","17 July 2009","22 November 2009","4 November 2009","7 December 2009","26 September 2012","16 October 2010","19 December 2009","22 January 2010","20 September 2012","6 September 2012","29 November 2009","29 November 2009","12 December 2011","29 July 2010","21 October 2009","4 December 2009","21 July 2009","17 April 2010","3 April 2010"],"review-rating":["10","8","8","9","9","10","10","9","9","9","7","10","8","8","8","3","5","9","6","8","8"],"review-title":[" Romance, Religion, Madness, and lots of slurping\n"," A vampire film but different\n"," It is not perfect, but it is a very interesting movie\n"," Not, not, NOT at all what I thought, pleasant surprise, Park excels again\n"," One of the best recent takes on the vampire genre\n"," Beautiful, tragic, twisted, absurd, and darkly comic\n"," Brilliant!\n"," Every bit as good as the Vengeance trilogy\n"," Different kind of Beast\n"," The ultimate 'Twilight' antidote\n"," Better than i expected\n"," Weird and Original Vampire Tale\n"," Originality and genius\n"," Cross-cross cultural\n"," Unique twist on the vampire film\n"," Wow! Fantastic.\n"," Tired Blood\n"," Was hoping for more than vampire clichés from Park\n"," Fantastic take on the legend of vampires.\n"," Something different from Park Chan-wook\n"," Story of a vampire, guilty of lust and love\n"," The korean twilight\n"," To say this is a vampire film its to sell it way short since its straddles so many genres as to almost unclassifiable. Its one of the best films of the year\n"," Strange and Unique!... Welcome Back, Mr. Park!\n"," Chan-wook Park's take on the vampire film\n"]}