{"review-url":["http://www.imdb.com/title/tt0791188/reviews"],"review-text":["I liked this movie, the second Naruto feature film. I enjoyed the one in the snow a tad better though as I found the story here a bit disjointed as I was not sure where certain things were supposed to be happening or when. Still, like the first film this one too has a nice run time to it of a hour and a half, plenty of time for a nice well developed movie with some really cool fights. The story starts off with ninja from the village hidden in the sand in combat with unknown assailants. It then shits to Naruto, Sakura, and Shikumaru hunting down a ferret for what they think is going to be an easy assignment. They soon find out otherwise as they are also attacked and Naruto is separated from his friends after he has a fight with a strange young warrior clad in armor. They both are injured and taken in by a caravan and soon after Naruto is invited to join this strange organization that wishes to create a utopia. Of course, all is not as it seems and there are plenty of fights to go around. My favorite was the one involving Garaa fighting this strange woman who takes him very lightly which is a very big mistake. The concluding fight is rather good too involving Naruto and this strange man who is a better villain than any of those in the previous movie.","Naruto the Anime TV Series has so far spawned 2 feature length theatre movies, and a third one is coming our way this summer.The first one, which was released in the summer '04 was a fun adventure featuring the main characters of Naruto in an exciting adventure. However, one must be a blind, deaf and one legged chicken to deny that film's faults. Whilst the first was most definitely enjoyable, there were a lot of things that could be improved on. Naruto Movie 2, however, takes all of these aspects and excels upon them.The action first of all, was incredibly cinematic. The lighting, setting and style was three fold as effective as in the first movie. In the first we were given basic action, well animated and choreographed animation, but nothing eye popping, however this movie's cinematography was exceptional, the use of shadows and lighting combining together to make the action all that more intense was very effective and added to the force of the fighting.The animation was very good. It rivalled Disney, however since this is a movie about TV characters, there was nothing exceptionable about the character design or detail to the actual characters, however, the animation was incredibly fluid and realistic. I think they even used twice the amount of cels for each second because there was absolutely nothing jittery about the animation at all, it was incredibly fluid.The music... I think that's where this movie fails. The original composer/conductor for the TV show was used for the film, and I don't really feel that he did that good of a job. The music mostly reminded me of a lot of pieces used in old SNES games. The composer is very good, but the synthesisers used for the film couldn't convey the tune very well. However they didn't fail the film at all, adding as a good accompaniment to the action. But, except for a few violin/string pieces towards the end and some choral work, the music didn't excel any boundaries or act as anything special.The story was fun. It was a reasonably typical storyline for Naruto and was very similar to the first movies, except, again, it took everything that had been wrong with the first film's story and improved upon them. The characters were a lot more interesting and the way the story progressed was what kept me watching throughout the entire film. It kept making you think the film would be ending any second now, but then it would move on, but instead of feeling dragged out, the action and characters made everything still feel fresh and exciting.Overall, this film is a goodun, but however good it might be, it is most definitely one for the fans. I enjoyed the film, but thats because... I'm a fan! But I can see, just like with Final Fantasy's Advent Children, it doesn't excel as a movie, but merely acts as a fantastic serve of fan service for a good hour and a half. Though I think this film does act as a good introduction to the series for current non-watchers, it won't give a full effect for anyone other than those glued to Naruto screens. However, despite all this, it was a fun movie to enjoy during this depressing period of upsetting fillers.","This movie was good but i personally liked the first movie better. The animation in this movie is certainly better the characters were sharper and details has been looked into. the lighting was excellent and was most certainly better than the first movie. The appearance on Gaara and the others comes as a surprise at the beginning but as the movie progresses one can see that Gaara has no part in the action. That was kind of disappointing and many fans would agree with me on that.The background was decent throughout the movie(had a slight Indian touch here and there). The storyline is similar to the other ones that appear in the Naruto series so don't expect anything different.Bottomline...If you are a Naruto fan then you'd definitely like it.","I'm a big fan of Naruto, even though I haven't watched every episode or read every manga.I really liked the first Naruto movie, and to tell you the truth I was a little nervous that this one wouldn't be as good (or action packed) as the first (mainly because this one in Australia only had a PG instead of an M, which is a PG-13 US or 12 UK). But I was wrong (thankfully)! The animation was more improved (although some drawings of the characters at points looked rushed) and was very good especially in the fight scenes.Speaking of that, let's talk about the fight scenes! The animation and action in the fight scenes was spectacular and very entertaining! I especially enjoyed the genjutsu battle with kankuro and the fight with Gaara fighting the shape shifting female warriors! All the characters you want are here! Naruto, Sakura, Gaara, Kankuro and Shikamaru! If only Temari was in the movie, Shikamaru could save her from the female warriors in dramatic fashion! And maybe they could have a PASSIONATE KISS! In my summary at the top I say that this qualify's more as a piece of Cinema than just an extended episode. And it does! The action is very cinematic and the animation quality looks very fancy especially during the fighting! Overall, this is a excellent anime Film that is a must-see for any Naruto fan! 5/5! 10/10! 50/50! 100/100! Alright I'll stop!","When I re-watched this movie recently, it was actually only the second time I had ever seen it. I had seen \"Ninja Clash in the Land of Snow\" like a dozen times back in the day, but I only saw this one once. This was another strong \"Naruto\" movie. It is quite different from its predecessor in a lot of interesting ways.The film has an engaging enough story with a pretty strong message. A world without war is something that we all want, but trying to make it happen at the expense of many other people's lives is the wrong way to do it. A better way to make it happen is if we are all willing to work together.Temujin was quite an interesting character, and his character arc was fun to go along with. Even though a lot of people might have seen it coming, the reveal at the climax that Master Haido was using Temujin the whole time really makes you feel for Temujin. Having him go through that redemption at the end was pulled off well.Sakura and Shikamaru are Naruto's allies in the film, and they are utilized pretty well. Gaara and Kankuro also got their time to shine, even though they didn't have much involvement until about halfway through.Despite some slightly questionable lighting during some of the fight scenes, the animation on the whole is really good. The fight scenes themselves are as energetic and well choreographed as anyone could have hoped. The final showdown against Master Haido was a bit long but never lost my attention.It's a close race between this one and \"Land of Snow.\" I might say I like \"Land of Snow\" just a bit more because it had better pacing. However, this one is still a great follow-up that I definitely recommend.RATING: B+","First of all, I just wanna say that I'm a very big Naruto fan. I love the Anime and the Manga stories. Also, the first movie just confirmed that Naruto is all about great fun, great action, great story, ... But then came the 2nd movie. I was very hyped because the first movie turned out great. But it didn't satisfy me one bit... The story was lame, action wasn't all that great... especially compared to the Anime series... same goes for the quality of animation. I found it very poorly... Could the story get any lamer... ANY ??? Where's the kyuubi of Naruto ?? Not once does he turn demon... I mean ... COME ON !!! My advice is... see the series ( until episode 140 , then it's just fillers ) and then read the Manga because that's still great. Ignore this movie and hope for something better in the future...All and all I gave it a 4, just because it's Naruto...","After much waiting for all major Naruto fans, the second Naruto movie has been released with English subtitles, courtesy of Dattebayo. This movie features another storyline that has nothing to do with the anime, as was done in the first movie. The movie follows the theme of creating a utopia but the irony lies within the bad character.Once again Naruto and his friends, this time it's just Sakura and Shikamaru (yeah Sasuke is still kidnapped by Orichimaru, seems no-one really cares anymore). Yet we also see the appearance of Gaara and Kankuro, adding a wider array of well-known characters to the film.The movie itself was created quite well. I enjoyed the graphics quite a bit, it was really well drawn. The music was quite nice as well, considering the standard for normal Naruto anime music. Interestingly though is that I don't think they used the theme song that is sung by Naruto (his actor really) called \"OH ENKA!\" Ending theme \"Ding!Dong!Dang!\" was quite nice.I reckon this storyline was, however, worse than the first movie. The first movie had reference to Kakashi's past and we actually see a flashback with Zabuza in it, that actually makes the movie fit in with the series, whereas in this movie you have a totally random storyline that links probably only with the relations being the country of Fire and the country of Wind.The utopia idea was good and using the bad guy to manipulate the truth and making it look right was ingenious. Yet the story lacks a bit of information on the traveling tribe, focusing on Temujin and his family.The fighting was not very satisfactory, although the scene with Gaara in it was nicely done. At the end I was hoping that Naruto would somehow combine his red Rasengan with the blue one that Temujin made out of his crystal. At least then it would look more interesting. But instead he used them separately and that blew the climax of the film. Compare this to the first movie: Naruto creates a 7-colour Chakra Rasengan and aims it straight for the enemy, sending him spiraling into a tall glass wall. There was less fighting overall and because there were quite a few, each fight was much shorter than it should have been.Some viewers may be able to overlook the bad sides of the film, and trust me there are quite a few, however, true Naruto fans will be disappointed at the storyline. It's not boring but it's not interesting either which makes the one and a half years wait in vain.Bad movie, first Naruto movie was much better but even then the first movie was nothing to be especially proud of.","I have to say this is one of the best movie i have seen so far for naruto. the action was a lot better then the first movie because it had a lot more fight scene and it came to u at a faster pace. it was amazing, the choreograph was excellent as well as most of the visual effects.the story line is something new to naruto. but it is basically the same as the first movie. in the series u see them fight against other ninjas,but in the movies (1+2) u see them fighting against machine of mass destruction. it is nice to see them fighting something other then ninja, and that it was great to see some other power other then chakra. and how other people from other land across the ocean fight. also sakura finally killed someone that is more stronger then her. (she have truly become strong) it was a lot better then the fillers on the series that i'm watching now. when u watch this movie the fast action scene will surely make your heart pound. With new jutsus and garra in the movie, u know it is good. and the music was good as well, but i find it to be lacking something. But the ending theme song was a plus. (dind dong dang) i think was a really good song. I totally recommend it.all in all i give this movie a 10, because i just love it. if u do decide to watch it, enjoy it. lol"],"review-user":["Aaron1375","catterix","shyam-5","ollie-thiele","carologletree","Rafke666","Jaytheoverlord","jjngundam"],"review-date":["10 August 2008","1 May 2006","4 May 2006","1 January 2010","21 August 2018","4 August 2006","17 May 2006","16 May 2006"],"review-rating":["9","8","5","10","8","4","5","10"],"review-title":[" Loved the fight involving Garaa!\n"," A fun adventure for the fans.\n"," Typical Naruto Style\n"," A great anime Film that really qualify's as a Film!\n"," A Great Follow-up to \"Land of Snow\"\n"," Great Anime Series Not So Great Movie....\n"," A pleasing effort but not what was expected but true Naruto fans.\n"," one of the best anime movie so far. (spoiler, be warned)\n"]}