{"review-url":["http://www.imdb.com/title/tt0795284/reviews"],"review-text":["This was a pretty good episode. Though no \"Trapped in the Closet\" or \"Cartoon Wars,\" it had a lot of things going for it. The character of Al Gore and that bizarre-as-hell \"super cereal\" thing was pretty darn funny. But, the scene that made me adore this episode was one I'm sure everyone will agree was one of the greatest Cartman/Kyle moments ever. When Cartman is superstitious of Kyle that he'll be stealing his gold(which of course is fake!), and he comes within inches of his face. Suddenly, Kyle wakes up, and they have that crazy conversation where Cartman tries to act like everything is completely fine. Cartman crapping out the treasure at the end, though predictable, was pretty funny.","First of all, ignore the comment about how South Park should make fun of Republicans. Everyone is doing that now, why should South Park blindly follow what the rest of the media is doing? And what the Republicans are doing is more serious and less funny than Al Gore and his global warming hysteria.But all that aside, this episode is just plain funny. Al Gore's portrayal has to be one of the best caricatures of a politician I've ever seen, it was original, and it was based on peoples opinions of the man. I don't want to give anything away, but it had me rolling on the floor.There are also has some of the best Cartman/Kyle moments ever.All in all I'd say that this is one of the best episodes the show has ever had, and I would highly recommend it to anybody.","Alright so this episode makes fun of Al Gore. I'm sure it pisses a few liberals off. The thing is South Park makes fun of everybody, much like the Simpsons did. If you get offended that a politician you like is made fun of then maybe you need a better sense of humor and are taking the show too seriously. With that being said this episode is hilarious and one of the best. Al Gores portrayal is hilarious, Cartman's scheme goes terribly wrong and the results will have you rolling on the floor laughing. It is basically everything you would ever want out of a south park episode and it is easily one of my favorites. I'll won't comment too much further on the plot because I don't want to give anything away.","Trey's favourite from the first run of Season 10 and also one of my personal favourites, Manbearpig features the adventure of Al Gore before going on global warming and before the movie, it was similar a adventure certainly, Al Gore was also trying to aware the world about something that can change the Earth, something really dangerous, this time about something that is half man half bear and half pig, Al Gore had only one thing in mind: to aware everyone of Manbearpig and to kill it! Al Gore here is more than hilarious, everyone who sees him feel sorry for him and yes he can childish, doing tantrums since nobody believes him but he is just a f****** demented bastard. Basically four kids are trapped in a cave because of Al Gore but certainly he don't have that in his mind, there's not space for any other subject, is just Manbearpig what concerns Al Gore. Those four kids are Cartman, Kenny, Kyle and Stan, basically Stan felt sorry for AL Gore and the four boys were just playing in Al Gore's game never imaging that Gore could almost kill them while he was trying to kill Manbearpig (hilarious scene- \"they are just children, damned Manbearpig\"). So at this part we have on one hand all the stuff with the rescue team who also feel sorry for Al Gore and on the other hand we have a little yet extremely hilarious Cartman episode and there are not surprises of the attitude of Cartman after he finds a treasure inside the cave, certainly the whole stuff with this treasure is fantastic and is great because you will see a sick Cartman in both senses, he is really sick for the boys and really sick for us. And in the end Al Gore does killed Manbearpig! This character is a fantastic one and I'm cereal! Terrific fun in this episode, a highly re-watchable one. 10 out of 10","ManBearPig is a pretty funny episode of South Park.It spoofs Al Gore and his speeches on Global warming, only replacing global warming with ManBearPig(a fictional monster who has parts of a man, a bear and a pig).He tells the boys about it in a school assembly and Stan feels sorry for him, so he and the boys decide to hang out with him.Gore eventually gets them trapped in a rock cave where he believes manbearpig to be and they are stuck for days.Meanwhile, Cartman finds treasure but wants to keep it all to himself.ManBearPig is a good spoof on Global Warming and overall a funny South Park episode.8/10","i think south park is hilarious, and i have no problem w/them taking shots at people on the left, but you'd think that, after taking a whole movie to attack celebrities for risking their careers taking on an illegal war, and then being GASP right along, they would have the sense to start giving w. and the bastards ruining the country a shot or two. bush seems to get a pretty free run from these guys for as stupid and messed up as he is.gore is fair game, but please, what do the republicans have to do, how bad do they have to f^&k up the country before these guys finally act like maybe they aren't just trying to do the best they can, and that they have done some true screwing up...or maybe just go after rush limbaugh...hes a good target...or even just make fun of condoleeza rice's gap teeth."],"review-user":["nickkarner","piperian396","solve004","RainDogJr","gangstahippie","obliv"],"review-date":["18 May 2006","5 July 2008","9 January 2008","12 December 2008","23 September 2008","8 July 2007"],"review-rating":["8","10","9","10","8","2"],"review-title":[" SUPER CEREAL Episode!\n"," A great Episode, I'm Super Cereal\n"," hilarious regardless of political views\n"," \"what is that, a pig bear man?\" \"no stupid, it's manbearpig\"\n"," Good spoof of Global Warming and Al Gore\n"," again?\n"]}