{"review-url":["http://www.imdb.com/title/tt0734646/reviews"],"review-text":["One of my favorite Twilight Zone episodes involves Arthur Hunnicutt and Jeanette Nolan as a pair of old married folk from the mountains and Hunnicutt's old hound dog named Rip. One night Hunnicutt decides to go on a coon hunt despite his wife misgivings and it turns out to be both their last fleshly night.It takes a bit for Hunnicutt to be convinced he's dead and he even goes down the wrong path on Eternity Road. Let's just say that it's a good thing he and Rip died together.I suppose if heaven is real it's something different for everyone. For a man like Hunnicutt it would be quite something different than for say the Sultan of Brunei. That's a proposition that's dealt with in this Twilight Zone story.Hunnicutt who made a career of playing rustic types makes this episode special.","Of all the seasons and episodes of THE TWILIGHT ZONE, after seeing all the great, mind boggling, thought provoking stories, this one stands on top. That's right. This story, this one entitled THE HUNT tops the large number of the finest scripts in Television History.True, there are no interplanetary space flights, no inexplicable cracks in time. There is no living nightmare, no sudden changes of setting. There is seemingly nothing out of the ordinary for our protagonist to deal with.The main character, played by veteran character actor Arthur Hunnicut, sets out from his cabin in the hills, accompanied by his faithful hound, to hunt raccoon. Because the raccoon is a predominantly nocturnal animal hunt is by moonlight.The man and dog soon encounter a large raccoon, who hops on the dog's back and attempts to drown the hound in a pond. The man jumps in to help his dog. There is a sort of almost black-out, after which the pair are seen on the shore, in a lying, almost sleep like position.Calling his dog by name, (Rip, I think) the old man sets off to return home. When he arrives, he finds the wife weeping and unresponsive to his conversation. He also observes visitors coming and going to his house, paying respects and giving words to console his wife.Still seeming puzzled at the strange reception and goings on around the Home Cabin, the Man and Rip take off on a long walk down the road, where He remarks out loud that he did not remember such a long fence in these parts. He eventually comes upon a rather large fellow, dressed in garb similar to his-overalls, hat, work shirt. They are at a gate, which leads to an area where a lot of smoke is freely rising up. The Gate Keeper is overly eager in his persuasive pitch in trying to get the man to enter. Rip sounds displeasure. The Gate Man tells the Old Man that he may enter, but the dog would have to remain outside, offering to watch the animal for him. The man will have none of it and the two continue on their way down the path.After a little more hiking they come upon a second gated entrance where the Gate Keeper recognizes the man and welcomes him. When the Old Man reports what has happened down the road, telling him of how the guy at the other gate tried to separate the Man and dog, and added, \"With no dogs allowed, that must be a Hell of a place!\" The 2nd Gate Keeper stated that he was right! \"That's exactly what it is!\" Our family had lost our 1st Dog, Lady-a mixed Lab, in October of 1981. About 6 months later, as good fortune would have it, the Wife(Deanna) and myself along with our 2 daughters (Jennifer 9 and Michelle 6) viewed this episode on TV, WGN TV, Channel 9 Chicago. Well, it all made perfect sense to us at that time.We're certain that anyone who has had that relationship with a family dog, would agree. The episode still brings a condition of watery eyes to this now 60 year old writer.","A warmly sentimental tale from the author of The Waltons. Were someone to pitch the material to me, I would probably reject it as too maudlin. But the dramatization here manages a tear without the expected embarrassment. No one in the 1950's was better at lovable hayseeds than Arthur Hunnicutt. His appeal here is put to consummate use as a mountain man doggedly faithful to a loyal hunting hound. Their fates are tied together as inseparably as any human bond. Good. I see a subtle environmental message here. All critters go to heaven, because how can we condemn any poor devil that merely follows instinct in order to stay alive. There is no deceit in the kingdom of animals, and yet how cruelly we often treat them. An oddly satisfying episode that confirms this important message.","Several weeks back I lost my beloved companion and friend of fourteen years, a golden retriever named Sasha. When I came home from the animal hospital, alone, after having made one of the most painful decisions of my life, my teenage daughter sat by my side. . .and we talked about this episode of the Twilight Zone. I could be wrong, but I recall a line that Arthur Hunnicutt said, when Satan was trying to trick him into hell, but his dog could not go with him. . .and his dog in turn was growling in defiance at the gatekeeper who was trying to trick the old hunter to \"step inside,\". . .that it would be \"one helluva of heaven if dogs were not allowed,\" and the spirit of the old mountain man and his dog decided to turn away from the gate (of what they had thought was heaven, to wander eternity alone.) What a tearful moment when they meet a \"good ole' country boy\" on that eternal road, only to discover he is an angel, sent out to find 'em, and \"sure neighbor, of course dogs are allowed into heaven.\" I'll confess I cried as I talked about this with my daughter while we mourned the passing of our beloved golden. Rod Serling was truly a genius, a voice that in the early sixties spoke out against racism, hatred, \"know-nothingism,\" and was a profound inspiration to me to become a writer. This episode, across forty five years carried a message of comfort to all of us who have lost a beloved friend. I urge you to get a copy the next time there is a one of the Twilight Zone marathons or purchase it. There will be some tears, but comfort as well. As always, thanks Rod, for all that you taught us. . .even now.","Arthur Hunnicut portrays Hyder Simpson, who has been married to his wife Rachel(played by Janette Nolan) for 50 years in their rural cabin home in the mountains. One day, Hyder takes his beloved Dog Rip on a Raccoon hunt that goes wrong when both of them seem to drown in a fast-moving river, though appear later unharmed, but compelled to travel down a long road where he comes across two gatekeepers, both of whom welcome him in, but the first won't allow Rip in, so Hyder passes on that one, only to be confronted by quite a revelation when he approaches the second... Heartfelt episode is a valentine for animal lovers, and is wonderfully acted and made as well. Cats however should also get a friendly mention as not being fooled either!","My favorite non-terrifying Twilight Zone was The Hunt, from January 1962.Here came Hyder Simpson, a delightful Appalachian hillbilly. He's cantankerous and gruff, a plain-spoken man and we get it quickly how he's a good man, honest and maybe a mite too straightforward, a man faithful to Rachel, his wife, and to his old beagle, Rip.Well, the two of them, Hyder and Rip, go coon hunting. They die and wake up and don't realize they're dead. They only get it slowly and it's fun, watching them, or watching Hyder come to the realization they are indeed dead. (Rip, with his animal sensibilities, probably already knows.) There's the Miller boys, digging a hole on Hyder's property, which riles Hyder, and what riles him even more is how they ignore him, like he's not even there, which, of course, he isn't. Hyder realizes the men are digging a grave for a dog, his dog, actually, although Hyder doesn't know it, and his ire turns to sympathy and respect for men who think enough of an animal to give it, him, a respectful burial.Hyder follows his own funeral procession but gets lost and finds himself on Eternity Road. Soon enough, he and Rip arrive at the gates of Hell and not realizing it's Hell, they encounter the slick salesman of a gatekeeper, who apparently doesn't have a right to claim Hyder. Hyder's not on the list, but the devil is a wily scoundrel and tries every trick he knows to get Hyder to step inside. It's all devious subterfuge and we get it before Hyder does, how the gatekeeper's intimations ─ it's Heaven inside the gate ─ are false. It's Hell in there. A more sophisticated man might have blundered in but not Hyder. He's in a battle for his soul without knowing it and he's got two things working in his favor. He's got his loyalty to Rip, and Rip's keen animal perception ─ Rip gets it, how there's something fishy about this Heaven.Well, Hyder is invited in, but not Rip. No dogs allowed.I suppose for any and all of us who have ever loved and been loved by a pet, there's been, at some point, the dilemma ─ how can it truly be Heaven if Spot or Butterball isn't allowed inside. Can I ever be truly happy without my faithful companion? Not to fear, the smarmy gatekeeper says. Dogs have their own Heaven. This, intended to placate Hyder, only riles him more. What kind of Heaven is it, Hyder wants to know, that would separate a man from his dog? And if dogs and masters are to be separated at death, how can the master be happy without his dog or the dog without his master? Is it something the rest of us would worry about? What would we choose, Heaven or our dog? It's a no-brainer for Hyder and with some agitated, respectful regrets, Hyder and Rip are on their way and arrive presently at another gate.It really is Heaven this time and they're expected, which is generous, considering Hyder never was much of a church-goer but you have to believe he was a better man than many of those who were, especially with how he stood up to the devil, even believing the devil was Saint Peter. It takes a big man to say no to Saint Peter.And what is Hyder thinking about, stepping into Heaven? His own bliss? No. He's thinking of his wife of fifty years, played by Jeanette Nolan who doesn't look as if she's been married for fifty years but hey, mountain girls married young, back in the day, and in the early sixties, television (and the movies) didn't do special effects like they do today. They were concerned with other things, like character and dialogue.Want character? Watch any episode of The Twilight Zone.Want dialogue?Hyder to Rip when it's morning and they don't know they're dead and think they just slept overnight in the woods: \"That old woman will give us Hail Columbia for staying out all night.\"Hyder, still not aware he's dead and to the Miller boys, who of course aren't able to see or hear Hyder: \"Reckon those Miller boys have got hard of hearing.\"And still not getting a response: \"Now, boys, I ain't talking just to move the wind around.\"Hyder to the devil, when the devil asks Hyder how he died and with Hyder not realizing yet he's dead and thinking the devil is Saint Peter: \"Friend Peter, I was born with a cheap set of ears. I'm not sure I heard you right.\"Hyder's wife will soon follow him along Eternity Road and how will she navigate past the hellish gate? Rest assured, an angel tells Hyder. It'll be easier for her than it was for you. She is a woman of faith and the hellish gatekeeper won't even waste his time trying to entice her through the wrong gate. And in the meantime, until Rachel arrives, there's square dancing and coon hunting every night.That's Hillbilly Heaven!","Here's one of those Twilight Zone episodes where the viewer is in on the 'twist' even before the main character is. Yet in true Rod Serling fashion, the early hook isn't nearly as surprising as the one to be revealed at the finale. We can all figure out that old Hyder Simpson (Arthur Hunnicutt) passed on with Rip following the tussle with the raccoon, especially when he's invisible to everyone he knows and speaks to. The beauty of the episode rests with Simpson's refusal to cross the pearly gates without his companion, who warns him of danger ahead - \"...a man, well he'll walk right into Hell with both eyes open, but even the devil can't fool a dog\". If loyalty has it's place in the world, I'm sure Heaven wouldn't interfere with a potential customer just because that customer has a four legged friend. But if there are conditions for earning entry to one's final reward, I like the idea of hanging out on Eternity Road while I'm making up my mind.","This is among my favorite Twilight Zone episodes. I find that I like it as much now as I did as a child 50+ years ago.I find it a message of love and hope with more than a little bit of man's best friend thrown in. In my opinion it doesn't matter much if you believe in a religion or after life. What else are we here for but to make good choices to help and serve others? Loving connections with others souls is always worth more than all the riches in the world.","Perhaps \"The Hunt\" does lay it on a bit thick with the hick in the backwoods routine, a simple man who likes to coon hunt with his coondog Rep, both drowning while on the hunt one night, but it does have its charm. Hyder Simpson (Arthur Hunnicut; El Dorado) comes home after \"waking up\" the next day to find his dog's grave being dug by two neighbors and his wife, dressed in black and mourning the loss of her husband who didn't heed to her warnings of bad omens, getting a visit from the local preacher. So seeing as he doesn't have a home to come back to technically and while following his wife and the mourners taking his casket to the graveyard, Hyder meets a fence that no longer allows him access to the usual backwoods places so he takes Rep and they walk the Eternity Road as Heaven—or Hell—awaits. Where will Hyder spend eternity? Rep just might determine that. I have a place in my heart for this episode even though many might consider it a bit corny and perhaps too Hollywoodized a version of characters from the Deep South, but I like where its heart is ultimately and Man's Best Friend and His Master as partners for life, with the Missus coming shortly is just a nice close, me thinks. Animal lovers, in particular, (except for the whole \"hunting for raccoons\" business) might enjoy this episode for how an owner will not leave behind his pet, looking at the dog as more of a family member, treating it with respect. Everything in the film, from the angel that greets Hyder and Rep proper, to the surroundings that ultimately lead to the Heavenly Gates, is completely representative of the backwoods people and culture as seen through the lens of certain folks who visualize them as they perceive them in the Hollywood industry. Although \"The Waltons\" creator, Earl Hamner Jr. did write this episode, I'm guessing a lot of his intentions were not presented as he saw them. That said, I still find \"The Hunt\" rewarding in many respects. Being from the South, I at least appreciate their trying to show a different side of America on the Twilight Zone.","In this episode, a man and his dog go 'coon huntin' after eating dinner with his wife of 50 years. He's devoted to his wife and his dog.While hunting, his dog jumps in the river after the dog and he follows. The man dies and doesn't know it. He tries to talk to his wife and his grave diggers to no avail.What follows is a tug of war between heaven and hell for the man's soul and his dog helps make the decision. He's being tricked by the devil and won't go in to \"heaven\" unless his dog comes with him.It makes you wonder if all the animal lovers have the right idea and want to go to heaven with them.","I must have watched, \"The Hunt\", my all-time favorite episode of \"Twilight Zone\", at least a dozen times so far. Still, I cry every time! It paints a vision of afterlife so very beautiful and precious to me that I sorely lament that I lost all religion. I cry for my loss and I cry for everything working out just right, the way it should be. It isn't just about showcasing a fondness for dogs. It depicts \"ghosts\" in full daylight, but on a different plane. It demonstrates the war between good and evil, the deceit of the dark side and the kindness of the light side. But, the simple and incorruptible nature of animals is important too. :-)","Man's best friend in the form of hound dog Rip is central to this one. Hillbilly Hyder Simpson (Arthur Hunnicutt) goes raccoon hunting with his dog and the result is game, set, and match to the raccoon. Hyder and Rip drown together, but one of them is clueless about what's going on (Hyder). So what's to do now? They follow a road being 'not in Kansas anymore' and Hyder's happy to go where he can take Rip. A likable tale from Earl Hamner Jr, his for the Zone. The great character actress Jeanette Nolan makes her first of two appearances in the Zone (the other in 'Jess-Belle', series four-also by Hamner) as Rachel, the superstitious wife of Hyder. From her film debut as Lady Macbeth in Orson Welles' 'Macbeth' there was very often witchcraft (as in 'Jess-Belle') or some hint of mysticism about her roles. Here as Rachel she has an ominous premonition that seems validated by Hyder's death. Both Hunnicutt and Nolan play their parts earnestly, making this an engaging, albeit riddled with corn pone, entry.I don't care for the afterlife stuff in it, but this might well affirm your belief in dog.","My favorite Twilight Zone episode. I'm grateful to Rod Serling for creating this particular story, and hope he traveled the same path as the main character in it, the character played by Arthur Hunnicutt. Really excellent!","Easygoing hayseed Hyder Simpson (marvelously played by Arthur Hunnicutt) goes raccoon hunting with his beloved dog Rip. Hyder and Rip find themselves in some kind of afterlife in the wake of drowning in a lake. Director Harold D. Schuster adroitly crafts a warm gentle mood and relates the engrossing story at a steady pace. Earl Hammer Jr.'s thoughtful script presents an engaging array of colorful backwoods characters as well as makes a touching point about the special bond and fierce loyalty that exists between a man and his dog. Hunnicutt excels as the lovable Hyder; he receives fine support from Jeanette Nolan as Hyder's feisty wife Rachel, Robert Foulk as a deceptively amiable gatekeeper, and Dexter Dupont as a friendly angel. A lovely show.","In \"The Hunt\", veteran character actor Arthur Hunnicutt plays a hillbilly named Hyder Simpson who dies and seemingly goes to heaven after he and his beloved hunting dog are involved in an accidental drowning. Unfortunately for Mr. Simpson, the keeper at the gates of heaven (Robert Faulk) won't allow him to enter paradise with his hunting dog. NO DOGS ALLOWED is the rule of the day. Simpson quickly decides that this \"heaven\" isn't for him if they won't even let his poor old dog in. \"It jess don't seem right,\" he tells the gatekeeper as he reluctantly heads down the eternal road with his pooch by his side. Luckily for Simpson, he makes the right choice since the place he passed by was actually hell. He soon meets an angel who welcomes him (and the dog) to the real thing. There's nothing of any consequence in this episode except for Hunnicutt's amiable performance. Jeanette Nolan is also on hand as his earthbound wife. The story was written by Earl Hamner Jr. (creator of \"The Waltons\") and its easy-going style fits the subject matter to a tee. This is one of those rare episodes of the series that only needs to be seen once.","Here's an episode featuring a guy going out hunting with his dog. He falls into a lake. He goes back to his house only to find out no one can see or hear him. He finally meets a guy who can interact with him. He realizes that he drowned and is on his way to the afterlife. I knew that would be obvious a twist to end the episode on. He meets who he thinks is Saint Peter who tells him dogs aren't allowed in Heaven. There's apparently a dog Heaven. The guy goes to think about it for awhile, only to meet someone else on this road to eternity. He informs him that he was going TO Hell and that Heaven would allow a dog there and there'd be raccoon hunting. Luckily, a dog can detect evil! While it might be a tad cheesy, it's still paced fantastically and made for a unique episode. ****","This old hashed out clichéd kind of plot just does nothing for me. Obviously, the heaven described here is just a convenient one that fits what we want to do with our time in the afterlife. This guy spends his life hunting coons with his dog and that's pretty much all there is. I know it's a cute story and people will like it, but it is so dull that it makes no difference. What is missing is a sense of loss and a reclamation of the soul. It has no spirit to speak of and so it dies on the vine. Even the scene where he comes back and no one can see or hear him just seems hackneyed. Arthur Hunnicut was made to play this character and he did about four hundred times. I'm sorry. It's just not all that imaginative.","Arthur Hunnicutt plays a very stereotypical role as a mountain man (probably the Ozarks) who goes hunting with his favorite coon dog. However, the dog appears to be drowning when Hunnicutt jumps in after him. It becomes obvious pretty soon that despite Hunnicutt and his dog roaming about after leaving the water that they both died in the water--as no one responds when he talks to them and sees and hears people talking about his and the dog's death. Yet, oddly, Hunnicutt is REALLY slow on the uptake and it takes him a while to understand they are talking about him! I think this was actually done as padding, as there really wasn't enough material to fill the half hour time slot.Later, in the \"surprise twist\", he comes upon Heaven--or at least his concept of the place. He's invited in, but since they won't allow dogs, he has other ideas! Overall, reasonably well acted but of dubious spiritual value! With no twists or irony, this episode is a bit dull--not \"Twilight Zone-y\" enough for my tastes.","I liked much of the feel of this episode, and I'm pretty sure I get what they were trying to say, but this was a poor way of doing it.I'm to understand anyone who dies without a dog is going to blindly walk into hell because they didn't have a dog there to warn them? Pretty lousy set up there St. Peter.Also, some have commented this was an episode speaking up for the dignity of animals - well, bit of a contradiction considering the favorite hobby of this man and his dog was hunting - sorry for you raccoon, whether heaven or earth you're going be getting shot at :)"],"review-user":["bkoganbing","redryan64","dougdoepke","wforstchen","AaronCapenBanner","wjs82852","classicsoncall","talonjensen","Scarecrow-88","kwp1911-1","BeauEvil","darrenpearce111","DocHollidayIV","Woodyanders","chuck-reilly","ericstevenson","Hitchcoc","MartinHafer","motter25420-153-699254"],"review-date":["2 June 2014","15 April 2007","9 July 2006","8 May 2008","28 October 2014","30 December 2013","29 May 2010","23 January 2018","4 July 2012","4 July 2006","2 June 2014","17 January 2014","23 January 2018","8 May 2018","15 May 2008","2 August 2018","2 December 2008","2 October 2009","15 August 2017"],"review-rating":["7","10","10","10","10","8","10","7","7","9","6","10","8","6","10","6","3","6"],"review-title":[" Heaven for country folk\n"," Man's Best Friend and Hillbilly Heaven\n"," All Critters Go to Heaven\n"," For any of us who have lost a beloved companion, watch this episode\n"," Can't Fool A Dog\n"," Hillbilly Heaven\n"," \"Three nights ago I saw blood on the moon\".\n"," Top 5\n"," The Hunt\n"," An old man and his dog go 'coon huntin'\n"," Grab a tissue!\n"," 'Rip an' me never been this far before'.\n"," Walk The Right Path\n"," A sweet tale of a simple man and his loyal dog\n"," \"The Hunt\" is an easy-going sentimental story\n"," I love how it keeps going\n"," Is Heaven What We Would Like It To Be?\n"," Sub-par\n"," Bit confused\n"]}