{"review-url":["http://www.imdb.com/title/tt0827947/reviews"],"review-text":["Then again, I like Rachael Ray. She is fun, sweet, fresh, and such a joy to watch. I have to alter just about everything she makes as I am a vegetarian...but it's great to see her with a program that shows more of her personality. After all, she is a television personality. I think it's cool that she is so inviting with her fans and still appears to be down-to-earth. The studio audience appears to be rather small, but that just makes for a cozier environment. Some people have posted that the show sucks. I guess it depends on your own interpretation of it and of her. If you notice the early episodes of 30 Minute Meals you will see a completely different personality than in those of the past few years. I'm sure she will find her comfort zone with this show as well. Good luck Rachael!","I've been a fan of Rachael's since the beginning of 30MM on the Food Network, so I have seen her grow over the years. The minute I saw her interact with Oprah, I predicted that this show would happen, because I saw how taken Oprah is with her, and with good reason: she comes across as very natural, and willing to laugh at herself, which is very engaging. The set is appealing, and there are some fresh ideas (I love the lazy Susan that the audience sits on). There's just enough of a celebrity segment, and she stays away from controversy and debate (there's enough of that on daytime TV). The show is a lighthearted escape, and she hasn't moved away from her strength (cooking), which is very good planning. I know there are people who hate her and hate her show; that's OK, you can't please everybody. And somehow, I think Rachael knows and accepts that. So just turn the channel; I don't think she'd mind.","Rachael Ray appeals to viewers of all ages and backgrounds, beginner cooks or \"seasoned\" veterans. You'll be dazzled with a variegated presentation of delectable yet time-efficient dishes, jazzed up with her unique brand of spunk and candor. Most importantly, this hip chic keeps her audience drawn in by stimulating all five senses. Let me explain. Her program provides enlightenment to your visual sense, auditory sense, and sense of feeling through a rich, luminous ambient backdrop, light-hearted, casual, yet engaging topics, eye-pleasing, appetite wrenching meals, and her hearty smile and laugh, which will simmer down anyone's nerves.(Sense of smell and taste are rewarded when you test out the recipes in your own kitchen and among your own family and friends). Check out her show guys.","Here is a rundown of a typical Rachael Ray Show:  1. The awful theme song begins to play, and Rachael descends wearing  her Snapcrotch outfit in this bizarre cargo elevator. 2. She begins  running around screaming and/or insulting the audience, then yells at  them sit down. 3. An awkward monologue.  (The next are in any order) 4. A segment tooting Rachael's own horn  (i.e. \"I Lost 500 Pounds with Rach's Recipes, \"Rachael Ray Saved my  Life,\" \"Rachael's Fashion Tips.\") 5. A totally useless D.I.Y. tip (i.e.  how to engrave words into casserole dishes, how to use your washing  machine as a salad spinner, how to build a tube of lipstick with a  light on it.) 6. The unleashing of horrible recipe on the unsuspecting  audience (reaction shots of first bites are never shown). 7. A  celebrity guest with an awkward interview, followed by some obviously  scripted questions from the audience. 8. A person who gets help from  one of Rachael's cronies (i.e. the I say yes to everything woman, the I  own nothing but overalls lady, and the I can't find time to put on  makeup housewife). What would they do without you Rachael. *gasp*  Reasons that this show should be avoided like the plague: 1. Fakeness:  Rachael Ray claims that entire show is unscripted. Many people who have  attended tapings of the show have claimed that the entire show is  scripted. Many of these same people have also mentioned that there is  even a very strict dress code for the show.   2. Her show jumps around too much: Where as Oprah, who is the highest  rated talk show host of all time has a definite theme for her show,  Rachael's jumps around like an ADHD soda child on crack. Her show  averages perhaps 10, short, worthless segments a show. On second you  will be getting fashion tips from Kojo, and the next Rachael will be  making gross stuffed \"Spanish\" peppers with manchego cheese, and the  next their will be a giant anaconda up on stage, and the next, well you  get the picture.  3. Rachael is a poor host with bad ideas: Aside from her grating  personality, Rachael's hosting ability is terrible, at best. Her  questions for her celebrity guests are poor, and often times not even  relevant to the interview, and her segments are unappealing and offer  little educational, or humorous value.  In conclusion, you need not waste your time with this schlock. It will  be canceled soon anyways.","Many times during the afternoon in my spare time or before I go into work on some downtime I will tune in and watch \"Rachael Ray\". The show is so lovable and fun it's a downright joy to watch! Done in front of an audience the show always has well known guests like movie and TV stars with even well known authors and sports figures making appearances all interviewed by Ray. And the show has segments of health advice and beauty tips showing stories of real people and the audiences play games and even Rachael from time to time has fashion segments as people model right in her studio and the show always ends with Ray cooking a delicious dish of some great looking food! And she's bright and funny and must I say that Rachael Ray is so cute and pretty really I think she's one sexy cook. Watching this show is one good way to pass time off in the afternoon!","It's hard to believe that oprah winfrey produced this piece of junk, the show couldn't even hold a candle to cooking shows of the past, including emeril lagasse, rachael ray is the most annoying talk show and cooking show host in TV history, not since ainsley harriott has had a terrible cooking show host I've watched, at least ainsley harriott has some good moments and some style, this one has no style at all, she's terrible as host, the kitchen looks atrocious, the writing is horrible, the teleplay is over the top and the opening credits are so bad, it makes me sick. Now I Enjoy cooking shows that had a cool sense of style, but this has absolutely none of thatThis is one of the worst TV of the year.","The only good thing is outside the studio you're covered in case it rain. We waited outside forever. It's so small in the waiting room. Some people had to stand up. She didn't offer any hot tea or coffee. Instead they gave us stale chips. We signed a waiver for prizes. We didn't receive any. Since she is a chef I thought she would give out treats. Cookies, brownies, cookbook or something. Its very cold in the studio. It made us sick. We taped 3 segments so we sat in the studio for 2 hours. They didn't let us go to the bathroom afterwards. We had to use the fast food restroom down the street. We were so upset. Never again.","Rachael, love you, your show. But your hair is the pits looks dry, like you just woke up. Need a new hairdresser, this one doesnt know your hair type. Please","This woman is sooo obnoxious and overbareing.. she treats most of her guests horribly and talks over them because she THINKS she is the expert on everything!! Today she was second quessing the CIA agent she had on today!!! The she was cooking pitas and started throwing the forks around with the food on them out of frustration !!! Maybe she needs her cup she is always cupping!!! Get her off the air!!!!!!'n","it seems like if you are going to post here it going to be a 10 star rating ,nobody ever seems to dislike anything ,well i am honest, some don't like that but here we go, rachel ray show is just plain awful.!!!!!!, this show reminds me of the snl character linda whatever if she had a cooking -whatever show.i must say i liked rachel on the food network on $35-$40 a day but i am sorry she does not have enough life experience to make her interesting day in and day out,give me ham on the street, anthony bourdain , interesting folks,but most of all i find her annoying, she actually told a member of the studio audience to \"shut up\" yes in a kidding way but shut up is shut up, and who cares about her pet stories, sorry rachel you been cancelled!!!!","Loved today's show!!! It was a variety and not solely cooking (which would have been great too). Very stimulating and captivating, always keeping the viewer peeking around the corner to see what was coming up next. She is as down to earth and as personable as you get, like one of us which made the show all the more enjoyable. Special guests, who are friends as well made for a nice surprise too. Loved the 'first' theme and that the audience was invited to play along too. I must admit I was shocked to see her come in under her time limits on a few things, but she did it and by golly I'll be writing those recipes down. Saving time in the kitchen means more time with family. Those who haven't tuned in yet, find out what channel and the time, I assure you that you won't be disappointed.","Although the figures are higher in proportion to other areas of society, I don't object to the extremely high salaries for many of today's entertainers and athletes.A-Rod, LeBron or Brady all have deals either well with 8 figures, or the low-9 area. Ray Romano and Jerry Seinfeld could actually become billionaires from their shows, huge residuals and fees they currently demand. Even their cast members, and all of the \"Friends\" group reached near or over 7 figures per episode. Letterman's earnings for one show could solve most people's financial problems, and a week or two's take care of many for life.But all of these are based upon sound supply/demand principals, and the financial benefits they bring to their employers. And all perform their crafts ably.But then comes along someone like Rachel Ray, who reaches a level of earnings far beyond any apparent level of talent or skill. I find her shrill, annoying, and with a forced \"perkiness\" that's as phony as the proverbial \"3-dollar bill.\"A friend of mine is responsible for special meetings, events and convention plans for her firm and its affiliates. One of the major talent sources has hundreds of clients available from the $5-10K level, to a handful who get $200K and up per appearance. (This area includes Trump, Seinfeld, Lance Armstrong, Robin Williams, and, no kidding, Larry the Cable Guy.)There are a greater number in the $100,001 - 200,000 range; list included the likes of Bill Cosby, Steve Martin and even cable guy Larry's benefactor, Jeff Foxworthy. This category includes Rachael Ray. I suppose I have to admit there may be sufficient demand for her \"talent\" and offerings to justify her talk show and there may be some out there who'll pay more than $100K, + first class air, hotel suite, all expenses and limos door-to-door, for just a couple of hours of her whiny prattle at their organization's event. I just can't figure how-in-the-hell this could be possible.","OK, so I loved Rachael Ray before, but now, I ADORE her! How innovative. I love that she has a cooking section- I admit that occasionally I skip that part, only because it makes me WAAAY too hungry! But I also love that you can get the next day's grocery list on her website. I love that she has regular helpers and that she's made some of her viewers become her regulars. I love how personable she is and how creative she is. I also like how she does her Mystery Guests. She just seems so much more genuine than so many other talk show hosts. She still gets a little starstruck occasionally and I love that. I love that she talks about her personal life on there and reminds people how happy she is. She's even mentioned tabloids before and it's so funny! She also has the funniest stories! Anyway, I'm a fan for life. Even my 2 year old knows who Rachael Ray is and he loves her too!","I'm sure if you're a stay-at-home mother from the Bible Belt or a homosexual you will love Rachael's show. Everybody else will see it for what it is: another example of crass, overblown, intelligence-insulting American television claptrap. I have no clue why American television needs to be shrill, overblown, hammy and unwatchable. Everybody screams or overacts and Rachael Ray is a prime example.Sadly, all of these daytime talk shows are one and the same with the same formula regardless if Oprah Winfrey's Empire was responsible for it. However, as long as there's a steady stream of stay-at-home mothers from the Bible Belt and homosexuals out there, these shows will continue to thrive. They enjoy the non-stop motormouth of Rachael and her equally loud guests. At least when Jesse Palmer shows up he doesn't overact; he's Canadian, after all.Avoid unless you're the typical Oprah fan."],"review-user":["hs407","eddi_stjames","rfindley-2","nick337","blanbrn","afijamesy2k","latrese-69577","mrgrtmnfrd","ljklipp","hydebee","cvf64","caa821","imafishtank","BlackJack_B"],"review-date":["19 September 2006","26 February 2007","21 September 2006","28 November 2006","13 February 2016","18 September 2006","13 September 2018","13 August 2018","7 June 2018","28 September 2006","18 September 2006","5 June 2008","9 December 2006","12 November 2017"],"review-rating":["9","9","10","1","8","2","1","1","2","10","1","10","1"],"review-title":[" I like it.....\n"," Love the show, love Rachael. Sorry, haters.\n"," High Energy, Wholesome, Daytime Entertainment\n"," RAY\n"," A delight a treat of fun a host that's one sexy and liked cook!\n"," A Real stinkbomb.\n"," Not what I expected\n"," Hairdo sucks\n"," Zero if I could\n"," annoying!!!!!\n"," First Show\n"," Whatever she supposedly has is lost on me\n"," Loooove It!\n"," Typical Oprah Empire claptrap.\n"]}