{"review-url":["http://www.imdb.com/title/tt0816436/reviews"],"review-text":["While many people found this film simply too slow and simplistic I really connected with it. There is no plot as such, rather the film takes the form of a human survival story about three people trapped up a tree with a man eating crocodile lurking somewhere in the water beneath them.Personally, I thought the acting was mostly very good, despite the roles being quite demanding at times, and I felt a sense of warmth for the characters. The situation they were in was quite terrifying and I really felt nervous for them. I found the whole film quite nerve wracking because of the sheer helplessness of their situation and the constant threat to their survival.The crocodile effects were handled surprisingly well for such a low budget film, and believe me, I have seen my fair share of dodgy croc movies. The creature moved well and had real menace and, although the audience I was with didn't seem too keen on the film as a whole, they still jumped and gasped whenever the crocodile appeared.Script-wise, I would have made a few changes, particularly towards the end, but this was not a major problem. For fans of slow-burning survival horror set within the realms of reality this will be an engaging film but unfortunately I think for many audiences seeking a thrill ride and higher production values from their cinema experience the point will simply be missed.","This low budget crocodile movie really delivers the goods. The fact that it was inspired by true events would mean little if you wound up with a fake looking crocodile, bad C.G.I., or an obvious studio setting. Fortunately none of the above are involved with this terrific, very realistic film. The crocodile is real, there is no C.G.I., and the on location filming takes place in an actual Australian swamp. The actors were obviously inspired to create as much realism as possible in their performances, and they succeed. You can place yourself in their predicament, which is testament to how realistically \"Black Water\" translates as entertainment. Highly recommended. - MERK","\"Black Water\" is one of the most tense films I have viewed in a long time. The story moves fast as it follows three tourists (all great actors) into a swamp on a tour with a butch tour guide on a small boat. Soon after dropping anchor in a remote area of the swamp, they are flipped over by something huge in the water.Hastily, the three manage to make it into a tall tree nearby as they realize that a crocodile has attacked them. Throughout the next two days, they have to desperately try to escape from the crocodile's evil watchful eye, and he doesn't seem to want to go away. The movie drags just a tad bit, but what can you expect from the setting and the limited budget? It's so much better than \"Primeval\" and other recent crocodile/ underwater predator thrillers. The tension is heavy, and all three leads give terrific performances. Truly chilling, this movie struck a deep chord of claustrophobic fear in me. Apparently based on true events.","\"Black Water\" is a film that prides itself on its realism, and realistic it certainly is. Just like reality, this film consists mostly of waiting, of desperately trying the same stupid plan again because it's the only plan you have, and awkward dialogue.The story is about three young people getting menaced by a salt water crocodile in the Northern coastal region of Australia. The first twenty minutes is spent setting up the events. Pretty straight forward for a first act, except all the dialogue is the characters pointing out plot points to each other and the audience. It's painfully unnatural.When our protagonists finally find themselves in the company of a rather vicious croc, they spent most of the remainder of the film up a tree. Their strategies for survival are reasonable throughout the film, but there's really only two options: stay put and hope they're found, or try to get to safety by their own means. This is established in the first few minutes of the second act, and then nothing happens. They consider both options, rule out any alternatives, and then can't decide which option to take. They don't make decisions, the environment makes decisions for them.In the end, some people die and some live, and I was once again reminded of the value of fiction: sometimes reality is just so boring.","While on vacation on Northern Australia, Gracie (Diana Glenn), her husband Adam (Andy Rodoreda) and her younger sister Lee (Maeve Dermody) decide to take the Blackwater Barry tour in the swamp for fishing. Their guide Jim (Ben Oxenbould) uses a small motor boat and takes the tourist along the river to a remote spot. When they stop, they are attacked by a huge crocodile that capsizes their boat and immediately kills Jim. The three survivors climb a tree and when they realize that help would never come to rescue them, they decide to try to find a way out of their sheltered location. However, in the muddy water, their boat is flipped and the crocodile stalks the trio under the water.\"Black Water\" is a tense, realistic and dramatic low-budget movie and in accordance with the warning in the beginning, based on a true event. The acting of the unknown Diana Glenn, Maeve Dermody and Andy Rodoreda is top-notch, giving credibility to this simple but scary story. There are many similarities between this movie and \"Prey\", but in different environments. My vote is seven.Title (Brazil): \"Medo Profundo\" (\"Deep Fear\")","This movie was on the shelf at the movie store I used to rent all my movies from, and since I had seen a handful of very corny horror flicks there I had really low expectations for this one. Well, I put it in, and almost immediately I was sucked right in. While watching, I got deeper and deeper into the story and pretty soon I was staring in complete interest. This movie is surprisingly spectacular and I loved every second. The story is about a boat ride down a river in Australia. It seems safe enough until their boat is ambushed by a croc who's ready for some food. When I looked at the back of the case I thought that this movie was going to have crappy visual effects like in Lake Placid 2 and a lot of others, but when I first saw the crocodile it looked amazingly real! Don't laugh when I say this, for I am being serious, but this is one of the most creepiest films I've ever seen. It really knew how to build up nail-biting tension and suspense with it's intense situation, I mean, think about it; You're stuck, in a tree, nowhere to run, nowhere to hide with a hungry predator in the depths of the water below. You can not tell me that doesn't freak you out just a little. It even managed to give me a few chills down my arms, like when Adam was taken by the croc and Grace and Lee are left baffled. I jumped at two scenes, also.This is a very appealing movie, to me. There were maybe one or two parts where I found myself slightly uninterested but other than that, I would say this is my favorite animal attack film that I have seen and is an excellent film overall. It was a job well done by all the staff and I commend it for being so suspenseful and impression making.","There was some good build up of suspense throughout. The cinematography was surprisingly good considering such minimal budget. We witness occasional spells of good acting, however, this is quickly deflated by some quite cheesy lines. Understandably there would not be much of an intellectual conversation to be had, sitting up on trees while a crocodile is stalking you. Silence would have been golden here. There could have been a bigger play on suspense than dimly uttering, \"I sat in the cupboard for fear of my brother...\" Something tells me there's a slight difference in getting a beating from your brother than being eaten by a mighty 15ft croc. You decide. Throughout the film I can't seem to find a connection or for that matter, sympathy with the characters, perhaps thats because they don't develop one throughout the film, character that is. There are some occasional good scares when the crocodile sneaks up on the characters, overshadowed again by some questionable scenes. In one instance we should be terrified by an ear floating in the water but later we sit beside a decapitated, limbless corpse and only worry about a broken finger. A definite roller coaster of a film when it comes to logic.","BLACK WATER is a thriller that manages to completely transcend it's limitations (it's an indie flick) by continually subverting expectations to emerge as an intense experience.In the tradition of all good animal centered thrillers ie Jaws, The Edge, the original Cat People, the directors know that restraint and what isn't shown are the best ways to pack a punch. The performances are real and gripping, the crocdodile is extremely well done, indeed if the Black Water website is to be believed that's because they used real crocs and the swamp location is fabulous.If you are after a B-grade gore fest croc romp forget Black Water but if you want a clever, suspenseful ride that will have you fearing the water and wondering what the hell would I do if i was up that tree then it's a must see.","As a kid I loved the song \"Never smile at a crocodile\", and if I found myself in this state of affairs, which is actually inspired by true events. Smiling would be the last thing on my mind. From the opening set-up, I've never been so entrenched, caught up and finally exhausted like I was when watching this limited budget Independent Australian horror film, about three people in Northern Territory trapped in a mangrove swamp with a very conniving crocodile waiting in the water below them. What really brought the film alive, was how realistic it managed to be in transporting the fear and uncertainty of the characters' situation to the audience. Semi-documentary camera-work with a disquietingly eerie backdrop and authentic performances effectively take you out of your comfort zone. What we get is a patient survival tale than just a bloody, all-out creature feature onslaught. Think of \"Open Water (2003)\", where its budget and time restraint made sure it would stay low-key, but this minimal barrier enhanced the experience.The slow-grinding story might be black and white, but it never seemed to become disposable, or succumb to formulaic patterns. Well not largely, and the connection between the characters were emotionally engaging even with a bare, straight-forward script. Although you can say \"less is more\", with the actions and expressions illuminating the lingering thoughts plaguing their minds. The ordeal is utterly terrifying, because the threat is very alive and never seems to loosen up. This is what drives the film's chaotic adrenaline, and in which it lasts (even when its kept buried) through to the very end. Writers / Directors Andrew Traucki and David Nerlich's economical guidance alienates and smartly strings along the viewer with its taut pacing and harrowing psychological traits. In certain patches the notch goes up, with pressure induced suspense and startling images. The way the night sequence is executed is immensely chilling and pulsating. The menacing crocodile manipulative toys with its fresh-meat in a distressingly suspenseful approach. Sure some moments felt unlikely, but never does it get in the way or distract. Sound FX is the key, and at times the lack of any just eats away at you. Rafeal May's musical score is unassuming and doesn't really enter the mixture much, but when it does it builds an organic sounding quality. The cinematography of John Biggins is beautifully devised, and rapidly aggressive when the mood changes. It was always on the move and claustrophobic, but none of this jerky movements. The editing was sharply handled, and the effects were professionally catered by superbly combing live crocodile footage. Something like this production would also have to rely on its cast to sell to the story in a believable manner and they do it. Diana Glenn, Andy Rodoreda and especially Maeve Dermody are persuasively good. A lot of the responsibility falls on Dermody, and she strongly delivers with an inspired turn. Now this item might cop some comparisons with another killer crocodile film \"Rogue (2007)\", but the two couldn't be any different in what they want to be and how they end up. If I had to pick though, I'm leaning more towards this outing for its sheer involvement to snap at you.A remarkable effort on all fronts, with everyone involved showing potential to really look out for.","Black Water, co-directed and written by David Nerlich and Andrew Traucki, is very simple in its execution yet effective. The film is a low-budget Australian movie that will unfortunately not get the recognition it deserves because as far as creature features go, this is one of the best out there. The setup is rather basic; Grace, her husband Adam and her younger sister Lee are touring some mangroves in the Northern Territory when a saltwater crocodile flips their boat and leaves them stranded in the trees. The whole movie is about their survival while the crocodile is lurking below waiting to strike.Unlike Greg McLean's Rogue (another killer croc movie released earlier in 2007), Black Water is not about the audience having fun guessing who's gonna be eaten next, it is about hoping and praying that the three people will get out safely. The three unknown actors do a great job with pretty demanding roles, considering it was filmed on location with a real crocodile instead of CGI. The characters act realistically in the situation and the dialogue seems natural and not forced. Suspense is built up throughout the entire film, we do not see a lot of the creature but just knowing it is near is terrifying enough. This is edge-of-your seat stuff and highly recommended if you enjoy original and (most importantly) scary horror films.4/5","Saw this movie after looking at the positive reviewers' comments on the negative reviews as sometimes good movies are underrated.But this is a real piece of crap! What you call it in the description, 'a tale of survival', LMAO! 3 out of 4 people are dead and the one who survived was taken into the jaws of the Croc sideways couple of times! How can you call it a take of survival? This was just a piece of crap ever written!When there is nowhere to go, and the croc is waiting in the waters to kill everybody, what can happen next? This can happen: you go in the water, the croc will catch you sideways, take you to the side of the river and put you with another guy whom he killed first and who has a gun in his belt so that you can use that gun and kill it!Such a negative, illogical, stupid movie! At 6.0, this is way too overrated and should come down to 3 at least!","Although this movie is not bad cinematically speaking and has its merits it turned out to be a waste of time (at least for me). But fear not, it is not in any way comparable to films in the vein of \"Anaconda\" or such. Black Water is conceived and thought out quite differently. The appearances of the crocodile out of the water are succinct and played out sparsely so there is some ongoing suspense and tension throughout the movie. However from the start you can see events coming so there are no many surprises and the whole movie could be summed up -with some \"licenses\"- by the children's song sang premonitory by the first victim: \"Three cheeky monkeys swinging the trees, Teasing Mr. Crocodile, 'You can't catch me'. When along came the crocodile, as quiet as can be and Snap! went the crocodile and ate one for his tea.Two cheeky moneys...\" and on and on.","Yes, the movie was that boring and insipid. after a certain point, I was wanting the croc to eat these people just so we could get the movie over with.The plot is that three Aussies take a fishing tour up a river in a little boat, where the fishing guide straps on a gun. He says he just does it for insurance purposes, all the crocs have been hunted out of this river. He is immediately eaten by a Croc. The trio then get chased up a tree, getting picked off by the reptile in their attempts to escape. They spend most of the movie arguing over the best way to escape.Predictably, the one survivor finds the tour guide's gun and shoots the crocodile. Aww, they killed the movie's only likable character! Where's Paul Hogan or Steve Irwin when you really need them?","A stress-fully lousy movie of the week, strained to feature length. The lack of common sense on part of the characters was not believable. The film was further diminished by annoying music which sadly prepared the viewer for false let-downs (non-suspense, non-jolts) rather than appropriately enhancing any (absent) feelings of horror. Farcical and contrived dialog was replete with unintelligibly exaggerated Australian Dundee-like dialect. At one point, one of the whiny women dragged herself out of the water - back into a tree - and *SHA-ZAMM* her hair was dry in a moment or two. That was preceded by the two squealers coming face to face with a crocodile, at which point we were treated to a pathetically time-extended staring contest- which I suppose was intended to raise our level of feeling of \"uuuuuh-ooooooh...\" (It failed like a pie in the face fails at being humorous.) At another point, the movement of one actress's arm was directed to appear to be a snake coming down the tree's trunk - NOBODY\"S arm moves in that manner - it was ridiculous. I was suspicious when it was stated at the beginning, \"...based on true events\" and my suspicions were confirmed throughout the torture that was the viewing of this poorly made film; I wish I had not squandered the time that I did. It was truly BAD. By the time I had given up, I found myself jogging the fast forward control while rooting for the reptiles. One singular redemption was that a character, a woman that reminded me of a real actress from another film, induced me to watch that film again/instead. I would have given it a \"1\"...but I genuinely liked the blonde character's broken ankle and also admired that aluminum boat. That was one sweet boat.","Gore hounds beware...this is not your movie. This little nail bitter has very little blood and guts. Its basically a version of Open Water that is effective and worthwhile. But what sets it apart is that we actually like the three leads (unlike Open Water) who find themselves up a tree when a crocodile flips their fishing boat and munches up their guide. We don't want any harm to come to any of them. SO when they start getting into dangerous situations...we actually care. Now I like killer animal flicks but I haven't been too impressed with Lake Placid up to Primeval (although I'm still waiting to see Rogue and hoping it is somewhere as good as this one!) but this little bugger did the job and did the job well. It's scares are creative and it only lapses into the run of the mill frantic crying sobbing and arguing for brief stints of realism so I never got annoyed. I remember reading the true story that inspired this where three guys went fishing and two ended up in a tree while their buddy was killed by the crocodile . But the thing that always impacted me that gets left out from the film was that the crocodile didn't eat up the buddy. No. For hours and hours he swam around the tree and shook the dead body still in his mouth at the friends in the tree. Seeming to stay, if you come down here this is what will happen to you.","I came in with pretty low expectations of plot, character, and depth, thinking Black Water would be something close to Open Water--naturally filmed, realistic style of acting, etc. Though the visual aspects of the film outweigh Open Water quite a bit, and there's a clear sense of visual style, Black Water sank when it came to creating tension and visualizing the danger. More often than not when danger was near we were being told it was near by an omnipresent soundtrack. Our senses weren't allowed to detect danger by an image, or an escalating event like seeing a crocodile jump in the water, then seeing the characters jump in the same water. I find animal attack movies very entertaining, from Jaws to cheeseball ones like Razorback, and I even really liked Open Water. But there wasn't a single tense moment created in this movie.It's clear in the first five minutes that a typical plot and character development are going to be absent in the story. That's absolutely fine. But without the film's ability to captivate the senses, the flatness of plot stands out all the more. I think the film's intentional absence of b-plot is the culprit; in another film you'd cut away from the characters to show the croc jumping into the water, then cut back to the characters, instant tension, you'd think \"don't go in right now guys, the crocs in the water!\".While I understand the neo-realist intent, this movie really underwhelmed me intellectually, emotionally, and in my senses. Maybe if I had a big screen, the creaking trees and thrumming river would deliver an elevated experience and a different reaction. As it was, almost every shot seemed held for too long, tension-less, and kinda pointless. How many times can you show someone scaling around in a tree and expect them to keep watching? Or better yet, create an expectation that something so bad is about to happen that I don't wanna watch? This movie did that zero times.For comparison, a movie in my People who liked this also liked... is Windchill. That movie scared the bejeebus out of me. This movie didn't come close.","ONLY if you enjoyed \"Open Water.\" I guarantee it. I did not enjoy watching those two float in the water, waiting for something to happen, but if suspended suspense is just your cup of tea, more power to you. My god, not only is is slow and boring, this \"thriller\" has 5, FIVE people in the entire movie; none of them are appealing to they senses, either. The characters quickly become annoying because you will come to realize that almost nothing is changing. Watch the first--I don't know-- 20-30 minutes, then skip to the last 10. You didn't miss a thing. I hated this godforsaken movie. Please, don't make anymore, whoever you are.","One of those movies where you take bets on who will die first and who will survive at the end. There was just something about the movie that made me zone out. I think because I keep looking back and thinking \"yep still in that tree...still looking at the water\". Poor character development. I felt nothing when they were in danger. I was voting for the croc. I found it hard to believe a croc would try to tip a boat in the first place and then when it jumps into the boat I find that really unlikely as well. The croc seems too supernatural at times ('all knowing all seeing'). Also when the croc attacks it's behavior seems very unrealistic. It's a killing machine and wouldn't be letting victims escape twice to three times in a row, especially when attacking in the water.","Black Water (2007) **** (out of 4) Australian horror film about two sisters (Diana Glenn, Maeve Dermody) and one of their boyfriends (Andy Rodoreda) who decide to take a guided tour down a river where they can fish and see crocodiles. Once out in the water and far away from land, their boat comes under attack by a large croc and soon the guide is dead and the three friends are stuck in a tree without much hope for survival. This film was clearly influenced by Open Water even though this film too is based on true events. I enjoyed Open Water but thought it had several problems, which could have been fixed and the problems I had with that film aren't in this one and I must say I think this film is the best horror movie I've seen in many, many years. off the top of my head I can't think of another movie that had my blood ice cold throughout it. There are at least five long scenes in this film where my blood was cold, the hair was standing up on my neck and I was curled up on the couch in actually terror. I've never had a movie effect me this much as I've seen so many that very few are able to get to me but this one actually did and boy was it a great feeling. I must say this film is a real joy as this genre has forgotten about scares and now basically goes for mindless gore. That's not the case here because each minute of this movie is meant to make you feel worried and put you in suspense. The execution is top-notch and the direction is downright flawless and never hits a bad note. The film runs just over 90-minute and there isn't much time given to the viewer to let them breathe because the film builds suspense every minute from start to finish. The film has a simple but very effective music score and the cinematography is great as well. Another big plus are the performances, which are excellent by the three leads. We don't get to spend too much time with them before the attack starts but it doesn't take long to really fall in love with all three characters and you can't help but want to see them make it out alive. Caring for them so much is another reason the suspense works because we don't want to see anything bad happen to them. Dermody really sticks out and I hope to see her in future movies. I really went into this film not knowing what to expect but it turned out to be one of the most memorable films I've seen in recent memory.","I've seen a lot of awful horror films in my life and this one is pretty high up on the list. It was just so utterly boring; at times literally nothing happened and you were forced to watch people sitting in a tree, not talking and unmoving, for minutes at a time. The footage of the crocodile looked like it had been taken out of an Animal Planet documentary and spliced into the film, and the pacing was all over the place. It kept being implied that great lengths of time had passed without any evidence or illustration of that actually having happened. All in all the film took itself far too seriously...it probably would've been better as a comedy.","If you are looking for your run of the mill thriller packed with action, suspense, blood, and gore, this film will leave you wanting, begging, and pleading.This is by far, the worst so called thriller I have ever seen. Though the acting was fair and the screening alright, the plot (or lack thereof) gives the viewer a sense of narcoleptic shock. I literally had to fight back yawns as the unrealistic crocodile seems to appear in the most inopportune places. Now onto the name chosen for this film, \"Black Water\". Judging from the name, you would think that there would be the slightest bit of black water, but its just yet another thing that the film lacks. It was the exact opposite of thrilling and leaves the audience wondering \"WTF\"! All in all this film is utterly BORING and leaves little to the imagination. I feel that I shouldn't have had to pay to see this film, but instead been paid to set through the entire thing. Save your time, money, and brain cells by not giving this film a chance to entertain to, because it certainly will not do so.","This movie sets out to do something very particular, it also sets out not to do certain things. In short it has a definite premeditated trajectory - to deal with the idea of facing death (with very few choices and all of them bad) as grave and real rather than something casual or amusing. In search of that realism it has eschewed certain conventions such as obvious character arcs and hooks. It not about the characters so much as about the human condition. Never mind what the actors would do... what would YOU do in their situation? Open Water may have been a starting notion for this movie but it goes a lot further. Unlike that film it doesn't cheat the audience in the end when you find out there aren't really any sharks to speak of at all. This has a real monster, not just the idea of a monster and not just an animated stand in. It also has fine production values given what these very resourceful filmmakers had to work with. And again in contrast to that other film it has some exhilarating and brilliantly rendered action at it's climax. And let's not forget the, shall we say 'dazzling', screen presence of its youngest star. She may prove to be quite a discovery.","This was possible the worst film I have ever had the misfortune to sit through, you know how girlfriends can be when they really want to watch something on TV and you can't do anything else like read a book as they would be narky with you for the next couple of days, but, looking back, that would have been preferable to the evening I have just spent suffering this debacle.Let's start with the obvious - you don't feel a single jot of empathy for these one-dimensional excuses for characters. I actually wanted the croc to gobble them up in the most painful way possible. The acting is painful to watch, the script nonsense (sometimes even repeating entire passages) and the attempts at suspense mostly result in nausea due to the awful camera work.Quite honestly, I agree with the sentiments of some on this site who reckon the guilty actors in this horrible, horrible cinematic experience have actually posted the positive comments on the otherwise admirable IMDb. I only say this as I have never met an objective-minded human being who would honestly enjoy this drivel.I must go now as I am already bitter at the amount of my life I have wasted on this film. At least the aforementioned partner got a bloody good bottle of Shiraz to share while it was on, so that my will to live just about remained.","After reading most of the reviews, its make me wonder if any of the users actually watched this movie at all.First of all, if you remember Open Water, its exactly like that, except a crocodile.The movie did seem to start off OK, but as soon as the 3 contestants hit the water in the dingy along with there supposed guide, it was destined to be a dead end.This would of been a good flick if there were more people involved, but the story line just wasn't there, for the entire length of the movie, you could tell someone the movie in 5mins.Bad acting was the worse of all, the movie definitely wont hit cinemas, and will probably end up on DVD or even better VHS at some dark shady video rental joint that only hires dead B grade movies, give this a miss, you will thank me later.","I've read many unflattering comments regarding this film, and the only things I have seen that they all have in common are: \"boring\" and \"unrealistic\".First of all, they used real bloody crocodiles! How much more real can you get? No CGI, no animatronics, no miniatures. Just a croc and a piece of meat.There is, however, no question that this film gets off to a slow start. Character development, what little they had, plodded at best, and I think this is primarily where this film is lacking.However, when the film gets going, the action picks up dramatically. I don't mean to say that this is action packed. If you're looking for a Michael Bay gorefest, you'll be sadly disappointed. If anything, there are more moments where the croc can't be seen at all, and the people are just waiting. We know, though, that there won't be any relief. The croc is just biding its time. This had a similar eerie feel to other films that set to achieve terror through inaction. Open Water, another film that has been criticized by some viewers as being \"boring,\" certainly comes to mind. Personally, I think that viewers who find themselves incapable of feeling the suspense have had their attention spans surgically removed at birth, but that's just me.Finally the characters, though rather undeveloped, feel real and the situation is such that it really could happen to anyone in the right circumstances. Furthermore, the deaths are completely real, and at times, it's a little tough to watch.All in all, this one's a winner."],"review-user":["Shudder1","merklekranz","mbworm","jaap-zeldenrust","claudio_carvalho","Dragoneyed363","marklinnig","atticus_noiro","lost-in-limbo","LoneWolfAndCub","eartherian","EddyCurrant","JoeB131","dtbaker2","ryanbramhart3","UptownRox","meowyyaoi","alinayanta","Michael_Elliott","ilovetobeyoung","go_pokes2007","willywilly","jetsettercraig","jf3000","benmcfee"],"review-date":["29 August 2007","25 May 2008","3 April 2008","8 October 2012","24 April 2008","29 March 2008","30 December 2007","20 October 2007","17 February 2008","6 March 2009","25 June 2016","22 March 2012","24 February 2008","23 February 2013","19 December 2007","19 July 2013","7 April 2012","27 March 2008","24 May 2008","19 April 2017","27 October 2007","29 October 2007","12 February 2010","30 October 2007","23 March 2008"],"review-rating":["9","7","8","2","7","10","4","10","8","8","1","3","3","2","8","4","1","3","2","1","9","1","1","10"],"review-title":[" Simple but effective\n"," Involves the audience like no other film....\n"," Nail-Biting Tension and Totally Believable\n"," A great example of why realism isn't always a good thing.\n"," Tense, Realistic and Dramatic\n"," An astonishingly wonderful movie\n"," maybe im just tired, maybe its just boring\n"," Best croc film so far\n"," Keeping your distance.\n"," A genuinely suspenseful film\n"," At 6/10, this movie is highly overrated!\n"," Waste of time\n"," Found myself cheering for the Croc...\n"," Poorly made, contrived, phony suspense.\n"," Black Water will get you nervous...\n"," Thumbs down\n"," You will LOVE this if...\n"," Wasn't Scary...Reapetive and Predictable\n"," Classic\n"," Probably one of the worst horror films I've seen\n"," Disgrace to the filming Industry\n"," Asks the question\n"," Avoid At All Costs\n"," Ummm What were they think??\n"," tense ultra-realism\n"]}