{"review-url":["http://www.imdb.com/title/tt0804502/reviews"],"review-text":["Cute Movie feel good movie I had never heard of this movie but ran across it while looking for something to rent. I had high hopes for this movie based purely on Flex being in this movie. I have never seen him in anything not worth while. True to form this movie delivered for me. I enjoyed the story. The movie is full of great actors and actresses. The hilarious Tasha Smith, Essence Atkins and of course Tangi Miller. I really liked this movie a lot. I didn't give it five stars because it did not discuss certain issues that I thought the movie should have detailed. The issue was apparently resolved but I would have appreciated a discussion resolving the issues. I liked the movie so much that I am now buying the movie after I've already rented and watched it.","This film was great!Tangi Miller and Flex did a great job. They both look good together and they both pulled it off.Tasha Smith was so funny as the cousin,and she couldn't stay out of her business.Essence held it down for her girl, when she needed her. Aloma was sweet and played a dear Grandmother she really reminded me of my grandmother.And Oh,I can't forget about the stripper, he was so find, and I didn't know if I should cover my eyes or smile while I watch him reveal his sexiness on the big screen.Damn! he was fine! Tangi looked flawless, and sexy, and she stepped up a notch since Felicity. Over all the movie had a lot \"A\" List Actors and Actress. It was funny, sexy, crazy, touching,loving, emotional and wonderful. This movie is a must see! Go it get on DVD now if don't have it!","True Love, I truly enjoyed and LOVED this movie. It was fun, funny and inspirational. I just saw it on DVD. How did I miss this one it's a winner! I mean Flex was \"That Guy\". I wanted to marry him. This was my 1st time seeing him as a straight leading man and he pulls it off. I thought Tangi Miller was the best ever and I was a Felicity head too. A fearless woman who only fears her Nana. Thank You for giving women of color range in your work and she looks great! Tasha Smith was a Blast! Aloma Wright was priceless as Nana. This cute romantic comedy is \"A Must See\". Oh and the new comer Marcus Patrick is worth the surprise ladies...True Love. Karen","My friends and I saw this at the San Diego Black Film Festival. It was great. Stormy is a strong black woman and Nana reminds me of my grandmother. Rene is FINE!!! Seeing him take off his clothes was definitely worth the price of admission. Can someone forward me his contact info?My friend thinks Flex is the finer of the two. She's been a Flex fan for years though so she might be a little biased. The cousins were funny and just as trifling as Nana described them. LOL.I am looking forward to seeing this movie again when it comes to theaters.","This movie, despite its list of B, C, and D list celebs, is a complete waste of 90 minutes. The plot, with its few peaks, was very predictable. It was so silly that I cannot believe that I am taking the time to even write a review of it. Flex, to his credit, has grown in his ability to act since playing Michael Jackson in a made for TV movie a few years ago. Tangi, on the other hand, has regressed, as she was more talented in her role as Felicity's flunkie some years ago. As I sat watching this train wreck of a film, with its pitiful production and horrible sound quality, other four letter words came to my mind to qualify what I thought of this film. However, in an effort to keep my writings G Rated, I'll simply say this film is another four letter word starting with an L. LAME!!!"],"review-user":["danceability","strawberrieslsb29","karenmarshell","toodamnhot","MoveyGurl"],"review-date":["5 June 2009","8 December 2008","6 December 2008","8 February 2007","10 May 2008"],"review-rating":["10","10","9","10","2"],"review-title":[" Cute feel good movie\n"," Love & Other 4 Letter Words\n"," A Must See\n"," Great Movie!\n"," Other Four letter Words Come to Mind . . .\n"]}