{"review-url":["http://www.imdb.com/title/tt0827521/reviews"],"review-text":["I enjoyed it. There you go, I said it again. I even bought this movie on DVD and enjoyed it a couple of more times. Call me old fashioned but I prefer movies like this to garbage like Die Hard 4 which hold up the box office and get critical acclaim just because you have some old guy saving America. Van Damme moves well for a guy of his age(47 I think), delivering kicks that reminds one of Kickboxer. If you like old school action and and explosions, this is the movie to watch. This is one of Van Damme's best works.Van Damme and Steven Seagal movies get released theatrically where I live so I never miss a chance to watch our old school action stars on the big screen.","This film is good in it's genre and that genre is naturally action with a little/average budget. Looks like Van Damme delivers greatly better performances when he has a good director guiding him. There is your basic bar brawl, alley scene and mostly a lot of gun fighting. Some basic drama, but nothing too deep. Isaac Florentine directs an OK action flick if you ignore the weak plot and the holes in it. But the person who steals the show is: Scott Adkins. How come this guy isn't a massive Arnold Schwarzenegger caliber action star that I don't know. Director Isaac Florentine has made a movie with Scott Adkins before called Special Forces (2003) which has some unbelievable martial arts talent that will satisfy the most demanding kungfu enthusiastic. Another amazing Scott Adkins feature is Undisputed 2. Check this guy out and make a noise, this guy needs to get super action star status and he needs to get it now!What else can I say about the movie? It's Van Damme stepping up a notch from some of his most recent work. No Oscars here for sure, but you already knew that. But never the less it has a nice little town feel and I could find worse ways to spend my time. So I'm giving this a solid 7 out of 10 in it's genre.","Unlike many of his action \"contemporaries\" (uh, you know who) Van Damme has at least been trying to improve himself as an actor with his direct to video films, while working with better directors. Many have been attempts at something different, like the somewhat surreal \"in Hell\". This is applaud able, but who really wants a Van Damme movie with little or no action? The Shepherd is a throwback to his 90's films where plot was minimal and fights and other action scenes took centre stage, where everyone knew they were making a pot boiler and had fun doing it. And thank God, because while no biggie plot wise, this movie delivers everything you'd want from a Van Damme movie. Great if happily familiar martial art fights (it even opens in that old action movie stand by, a diner)lots of guns and explosions, and even a torture scene for our boy. It's also well directed, starting with a great sense of humor then turning dead serious when it needs to. The last 15 minutes or so are wall to wall boom boom.For pure action, for what Van Damme does best, this is absolutely his most entertaining film since he went DTV.","Well it is a good movie. However, you have to admit that Van Dame's movies haven't been so great lately. On the other hand if you are a hardcore van Dame fan you should watch this as there is a huge improvement with fighting scenes. Also What i really liked is the music beautiful music. am sure this will kill time if you are action fan. As for Isaac Florentine the director of Undisputed 2, i don't think he did a good job as he did with Undisputed.I cant wait when one day Van Dame's movies hit the cinemas before the DVD. Maybe, one day:).In the end it worth the watch if you got no other action movies to watch, this could make your hour and half fun.","This one brings my collection of Van Damme films up to 25, some good, some stinkers; and although It may be fair to say I'm a fan, I'm no fanatic, haven't watched any of his films for a while and I certainly couldn't tell you what he eats for breakfast in the morning or which high school he attended. Like Forrest Gump might have said about his movies, a JCVD film is like a box of chocolates, you just don't know what you're going to get (though you most likely have have some inkling) and there are more than a few turkey flavoured ones in his box).With perhaps the lamest title of all his films and a dubious 'Steven Seagal' like premise, not to mention some cringe inducing dialogue, fair share of implausability and plot holes (nice to know they have a full time bomb squad and short notice standby in a little border town of 1800), this could be called something of a coin toss or even something to avoid for the more discerning film fan who can't stand the guy or who feels the urge for more intellectual stimulation.For those with enough of that in their other pursuits and who just want to kick back and be entertained, you may be pleasantly surprised. On a night I was expecting to fall asleep in front of anything I watched, It kept me interested and awake, something 'The Godfather' didn't do last week.As an out and out action vehicle, I found this pretty entertaining. It keeps moving along, with several spectacular and hard hitting ass whipping scenes, sufficient gunplay thrown in and a score reminiscent of 'Once Upon a Time in the West'.As far as his recent films go, I would compare this to 'Wake of Death' in terms of quality and while it didn't quite nail it (like most of his films) for the reasons mentioned previously, it wasn't without some quality moments.5/10 as a 'movie' & 7/10 for the bits you watch this sort of film for = 6/10 overall, a good pass mark. I recommend it and don't think it would disappoint any action fan who isn't expecting a Van Damme flick to send them into orbit.","This is the best direct-to-DVD effort from Van Damme that I have seen yet. Van Damme plays a border patrol agent who is out to stop heroin smugglers trying to cross into the United States. The action in this movie is great and the fight scenes rank with Van Damme's best. Costar Scott Adkins shows why he should be the next big star in the martial arts genre. For further evidence check out \"Undisputed 2\". Adkins is so good in fact that before I watched \"The Shepherd\", I thought that Van Damme might not look very believable in defeating him on screen. Van Damme holds his own though and although he isn't quite as athletic as Adkins is, he can still kick with the best of them. All of the fight scenes in this film are very well done and the gun battles are above average for this type of film as well. The only negative thing I can say about this movie is that the story is a little underdeveloped. I think Van Damme's character's motives should have been presented earlier in the movie, especially in regard to why he carries around a rabbit. The reason he does is very cool but you don't find out until the very end. There are a couple of other things that are never really explained either but this is a Van Damme movie so you know where the priority lies in making this kind of movie and it ain't character development. Overall though, this is a solid action movie that I recommend. So run for the Damme border!","After seeing Undisputed 2, I knew what to expect from Isaac Florentine.The Shepherd: Border Patrol is a decent flick (not Van Damme's best, but definitely not his worst.) There is some bad acting from VD's supporting cast, but it makes sense.The storyline and plot has all been done before, so it's nothing new. I mean this is Van Damme. We don't really expect much of an amazing plot do we? So lets talk about what we all want to watch this movie for anyway: the fighting.Without giving anything away, I thought the way the fights were filmed and shot were well done, way better than a few of VD's recent movies such as Second in Command, in which the entire end fight is HORRIBLE. With Florentine behind the camera, and if you've seen Undisputed 2, he seems to know how to photograph fights and enjoys it. A few of the fights in The Shepherd reminded me of VD's older stuff which is what we all want to see. The fights were good, and i said \"hah, awesome\" out loud a few times. But I was hoping for just a bit more considering how good I thought Undisputed 2 was.Something I found intriguing was VD's daughter in the film, I thought \"wow she's kinda hot\" come to find out, its Bianca Van Varenberg, JC's real life daughter. I have never seen her before so that was a nice treat.All in all, this movie is not half bad. Yeah the story has been done before but at least JC was attempting to make a good movie. Next time though, add more hand to hand combat! I think He still has what it takes to do another big budget movie...his acting has improved since he's been doing DTV's and he really is in great shape at 47. I don't know about you but I'm one of the ones who thinks that most of his DTV's are actually good with the exception of Derailed. All he needs to do is get back into \"bloodsport\" shape, and make a martial arts movie...and I think people would respond well even though he's not jet Li. This movie is definitely worth the rental. =)","Well...it's about time! Van Damme is back and kicking in this action thriller that's his best film in recent years. The plot isn't too inventive but the whole border patrol theme is interesting and the ex-marines as drug smugglers twist is cool. But what makes this movie awesome is the fact that Van Damme is back to doing martial arts again. His latest films have been more acting oriented, but in \"The Shepard\", JCVD is back to dropping the bad guys and looks to be in excellent shape. There are some impressive fight scenes and Van Damme shows he can still pull out the old famous 360-spinning heel kick. For being a low-budget action movie, it does have good sets and great stunts. Van Damme says some humorous lines and shows that he's improving as an actor. I'm glad he's back to dealing out some Van Damage...i've been let down by the lack of fighting in his recent films. Scott Adkins is great in his role and Van Damme and him have a 1 on 1 showdown at the end. Overall, it's one of Van Damme's better films and it will keep you entertained. A must rent for JCVD fans. I'm just keeping my fingers crossed for another martial arts epic like \"Bloodsport\" or \"Kickboxer\". Nok Su Kow!","the director was great. I think the screenplay was horrid. It's just that there were so many loop holes and unexplained things, and a lot of the stuff didn't really make sense. The direction was good for an action movie.It seems that Van Damme is finally getting some good direction with his films. You can expect to have a pretty good time. Eh you might be kinda bored with the dialog but the action makes up for it. scott adkins was excellent. can't wait to see more of him. great action.This movie should have been put into a wider release than how it is. It would have made a few bits more money.","Worth the entertainment value of a rental, especially if you like action movies. This one features the usual car chases, fights with the great Van Damme kick style, shooting battles with the 40 shell load shotgun, and even terrorist style bombs. All of this is entertaining and competently handled but there is nothing that really blows you away if you've seen your share before.The plot is made interesting by the inclusion of a rabbit, which is clever but hardly profound. Many of the characters are heavily stereotyped -- the angry veterans, the terrified illegal aliens, the crooked cops, the indifferent feds, the bitchy tough lady station head, the crooked politician, the fat federale who looks like he was typecast as the Mexican in a Hollywood movie from the 1940s. All passably acted but again nothing special.I thought the main villains were pretty well done and fairly well acted. By the end of the movie you certainly knew who the good guys were and weren't. There was an emotional lift as the really bad ones got their just deserts. Very simplistic, but then you weren't expecting Hamlet, right? The only thing I found really annoying was the constant cuts to VDs daughter during the last fight scene.Not bad. Not good. Passable 4.","Lately i have been very impressed with Jean Claude Van Damme's recent form in his newer DTV movie's.The hard corps was entertaining if not a little shallow,Until Death was superb and show cased one of Van Damme's best performances ,Then he moved onto The Shepherd:border patrol,a solid action movie with some reminiscence of some of the older classic Van Damme movie's.The fight scene's were impressive, in-particular the final show down with complex camera work and terrific athletic prowess.I hope Jean Claude continues in this way,some of his recent effort's are even more impressive than when he was a big box office draw. 8 out of 10","anybody that would come on here and check this page on \"the shepherd: border patrol\" is no doubt a van damme fan like me.....I have seen all of his movies (i own all of them) and love allot of them. I was so excited the other night when i got the link to \"the shepherd\" and was hoping for the best.... but unfortunately this one is weak...actually its budge! The action scenes are OK ... van damme does kick a chair at a guy in a restaurant and it looks wicked... but the gun fights are lame and so are the characters... it a very dark film... dark as in no budget for shooting at night kinda dark..lol I was hoping for a DTV movie like \"wake of death\".. which was frikin wicked for a direct to video..... But don't worry its still better than \"second in command\".. but how can it not be lol........ ( I have nutting against DTV movies ... (i love cheesy action movies) anyways they should have just called it border patrol.... because that is what the movie is about..(Why is it called \"the Shepard?\").. plus it sounds much better as a van damme movie title..(he has some hilarious titles) I really tried to find things about this movie that I liked but its below average unfortunately........... the town thats supposed to be some Texas town .. is jokes.. its a ghost town........ most likely in some country across the world.. and van damme might say a total of 50 WORDS in the entire movie........SERIOUSLY!!And van damme's pet rabbit... and all of the flash back stuff is wack!! so is his partner........ the female boss was o.k what can i say about this movie...... its pretty bad.. it had no budget ( it looks cheap) ......... I thought it was gonna be a wicked movie man was i disappointed........................ I am as big a fan as anyone.","It's really good to see Van Damme's film are slowly getting better of late and especially compared to C-grade flops \"Derailed\" and \"Second in command\" which were both tragic and not in a good way. The Sheperd: Border patrol is a good action flick with some really great action/fight sequences. It's good to know that Van Damme still knows how to kick seeing as his last film \"Until Death\" had no martial arts in it at all!!!That being said, this film is significantly inferior to \"Until Death\" which was a really good turn for Van Damme. \"Until Death\" lacked the over-the-top action of most Van Damme films but was dark and gritty and Van Damme's performance as an actor was surprisingly good in that film. Still, The Shepherd is definitely a film worth checking out especially for Van Damme fans or just action movie fans in general but if you're looking for a film with a bit more story line.....you may want to skip this one!I do believe that this film was done well enough especially on what little budget it would have been shot on. The only real problem I have with this film is the title; \"The Shepherd\"? I don't get it! I suppose \"Border Patrol\" just doesn't have the same ring to it without the word \"Shepherd\" in front of it!!!My rating for this film is 7 out of 10 but that's by Van Damme movie standards not in any other film category.i.e. It's good for a Van Damme film.","HERE IS MY FULL REVIEW.PLOT OF THE MOVIE: 3 out 5The plot was not very strong it seems to be that they grabbed the script in very hurry. Some Us Armed force agents came to south America way back from Afghanistan and are involved in drugs dealing and etc and VanDamme(JACK)comes for the rescue. CAMERA MOVEMENTS AND SOUND DEPRTMENT: 4 out 5Very much good specially the way fight scenes are captured very crispy kind of action. Scott Adkins kicks very nice I like his style. The sound for guns was a little weak but the kicks and punches covered that all.VAN DAMME's FINAL FIGHT WITH SCOTT ADKINS: 5 out 5This is the main thing which will attract all Van Damme fans as in this movie Van Damme has given a touch of his 90's.ON THE WHOLE 12 out 15 = 80% marksThe movie is actually made for action fans so if you are looking for more drama or emotional scenes or romance then better watch a Leonardo DE Caprio movie.","Jean claude van damme, scott adkins and director issac florentine-this had the chance to be better then undisputed 2 but for some reason they just don't get it right. Van damme's fight scenes are nothing more than a couple of front kicks and roundhouses, nothing spectacular-just average. The movie is low budget and the supporting actors aside from scott adkins all need acting classes but I could have looked way beyond that because all I wanted to see was jean-claude doing what he used to do best and MAN! was I let down. Maybe van damme should go to a couple of pilates classes to try and regain some flexability. I think he still has the makings to have a comeback, He just needs to find the right project.","I thought that this was the most interesting film that JCVD has done in a very long time. I loved his character and the whole thing with the rabbit set a different tone for this film. IMHO, JCDV may really be on to something going forward. A little more light heartedness, some obvious homages to other films, mixed in with some great fights...I would like to see more this style of film-making from him. One of the other posters thought that the bar scene was a Desperado rip off. I immediately saw the R. Rodriguez connection also, but thought it was very clever and made me want to see the film again to look for more subtle cues from other films. JCVD rocks!!Other stuff after reading other comments:No music in the dungeon fight? At first I didn't like that at first either, but then I thought it was interesting because it threw me off balance a bit by giving us something that we didn't expect. Made it seem more real.I also always get a laugh when directors cry like 2 year olds that their film was \"stolen\" from the studio. Directors are paid to do a job. The studio is the boss and they want the product that they want. Very few directors have absolute final cut on a film. In this case, JCVD is THE talent and the only reason anyone is watching this film. I am sure he got a film that he was happy with. I have a relative who works at a post house who knew a little of the story. PRESUMABLY, the director worked on and delivered his cut of the film. Everyone who saw it said it was a disaster...then JCVD and the studio re edited the movie. This stuff happens all the time. He also did see the final cut (which he claims he didn't) and his \"delicate genius\" ego was severely bruised because they hated his delivered cut. If this director was smart, he should have taken credit for this one as it would have been his best.","Like Steven Seagal I also am a big Van Damme fan and have followed most of his movies since the start of his acting career.In this flick Van Damme assumes the role of Jack Robideaux whom is a cop that just moved to New Mexico from New Orleans to work as part of the Border Patrol. Haunted by memories of his past, it is up to Jack to put an end to a group of Ex-Navy Seals from smuggling illegal drugs into the U.S. that killed his daughter.Overall I found this film to be very good, Van Damme is in very good shape for 48 years old and can really move. The action scenes are very intense and the movie even throws a couple of plot twists in to keep you guessing. Unfortunately Van Damme does not have the same intensity as he did say 10 years ago, regardless The Shepherd: Border Control is the 3rd straight solid film that Van Damme has made possibly opening the door for a larger project.I definitely recommend this movie to a Van Damme fan or fan of action movies in general; The Shepherd: Border Control is a great movie, not as good as Until Death but better than the Hard Corps. Be sure to give this one a try, you will not be disappointed.","This movie was made on a relatively small budget (10-20 million dollars?) with almost no promotion at all from its distributors. I only knew about it because I am a long time Jean-Claude Van Damme fan and I always check out his latest films in hope that they will be at least watchable and aside from some real turkeys (Derailed, Second In Command), they are. This movie has an easy enough plot to follow and Van Damme gives a good, humorous performance through out but the movie owes all of its credit to the fight scenes involving Van Damme, Scott Adkins and the final one of them together. The editing and camera work for most of the film is pretty terrible but Isaac Florentine can definitely film a good fight scene. I too am happy that Van Damme has been acting better lately (In Hell, Wake of Death, Until Death) but with the good acting came less martial arts. In The Shepherd, Van Damme proves that he still has it.","I had high hopes for this one until they changed the name to 'The Shepherd : Border Patrol, the lamest movie name ever, what was wrong with just 'The Shepherd'. This is a by the numbers action flick that tips its hat at many classic Van Damme films. There is a nice bit of action in a bar which reminded me of hard target and universal soldier but directed with no intensity or flair which is a shame. There is one great line about 'being p*ss drunk and carrying a rabbit' and some OK action scenes let down by the cheapness of it all. A lot of the times the dialogue doesn't match the characters mouth and the stunt men fall down dead a split second before even being shot. The end fight is one of the better Van Damme fights except the Director tries to go a bit too John Woo and fails also introducing flashbacks which no one really cares about just gets in the way of the action which is the whole point of a van Damme film.Not good, not bad, just average generic action.","Van damme has done some great films over the years and this one hits a big ten in my books. From the setting of Mexico to the five star fight scenes, this movie was amazing. The film is all about border patrol officers protecting there territory which is the border of Mexico. Ex navy seals are smuggling drugs out of Mexico into the united states of America (USA), Van damme and Scott Atkins give stunning performances as the cop and the villain. Although this film wasn't as good as until death but it still gave the action,acting and the film a five star look. I always look forward to these b grade action films and they keep getting better. keep them coming van damme.Watch this film if you enjoyed films like - Until death, The hard corps and second in command.","I like the shepherd! Sure the acting wasn't good but the fight scenes were nice. Van damme throws some nice kicks and so does adkins. The story was average. A Texas cop battles smugglers. This movie did everything a van damme movie should do which is martial arts and action. Van damme was never a good actor. I think this movie is better than van dammmes last 2. If you're looking for an Oscar winning performance you're not gonna get it here but if you're looking for action and martial arts then this movie is for you. Scott adkins is an amazing martial artist and unfortunately the public has gotten tired of martial art superstars but his movies in this movie are great. Van damme delivers strong kicks and it's good to see him performing martial arts again since he has not in his last 4 or 5 movies. This movie is definitely worth watching if you're a van damme fan.","When I first got wind of this picture, it was just called \"Shepherd\" and was supposed to be the film that would put JCVD back into chances of doing theatrical shtuff. I was very well excited about the whole piece.By the time it was titled \"The Shepherd: Border Patrol,\" I was tap-dancing in excitement for this flick. With Isaac Fluorentine at the helm of directing, and JJ Perry pulling stunt coordination, I almost peed me pants in anticipation. Pics were released of JCVD kicking 8 different kinds of arse as well as Scott Adkins playing what I thought was the villain, and I was mind-blown in excitement. I thought it was going to be another epic martial arts situation like Lone Wolf McQuade.Then it came out. I ordered it off Blockbuster online for $20 and was ready for anything. The reviews from vandammefan.net kinda had my ideas alittle altered, but I braced myself. The mail came on day 4 and I ripped open the package. My initial plan was to rush upstairs, rip the face off the cardboard packaging, then smash the case in the proper dynamics so the disc would land in my DVD player. However, I stared at the case for 10 minutes then placed the disc in my player and watched the film.By the time it was over, I was cool as a fool in the pool. The Shepherd is certainly one of my all-time favorite direct-to-video films ever and makes Derailed look like even more of the toilet mess that it is. Sure, some of the fights ran a twee bit short, but they were still VERY awesome. The shootouts were superb, as was Scott Adkins, who SHOULD have been the villain, unlike the forgettable Steven Lord.I highly recommend this flick. Seriously.","Technically I'am a Van Damme Fan, or I was. this movie is so bad that I hated myself for wasting those 90 minutes. Do not let the name Isaac Florentine (Undisputed II) fool you, I had big hopes for this one, depending on what I saw in (Undisputed II), man.. was I wrong ??! all action fans wanted a big comeback for the classic action hero, but i guess we wont be able to see that soon, as our hero keep coming with those (going -to-a-border - far-away-town-and -kill -the-bad-guys- than-comeback- home) movies I mean for God's sake, we are in 2008, and they insist on doing those disappointing movies on every level. Why ??!!! Do your self a favor, skip it.. seriously.","its a totally average film with a few semi-alright action sequences that make the plot seem a little better and remind the viewer of the classic van dam films. parts of the plot don't make sense and seem to be added in to use up time. the end plot is that of a very basic type that doesn't leave the viewer guessing and any twists are obvious from the beginning. the end scene with the flask backs don't make sense as they are added in and seem to have little relevance to the history of van dam's character. not really worth watching again, bit disappointed in the end production, even though it is apparent it was shot on a low budget certain shots and sections in the film are of poor directed quality","After 10 years, it is finally save to say that our Belgian Action Star is back again. I personally found this one to be even better than Wake Of Death, which makes it his best movie in... 10 years!! Okay, it is not like his highlight years as Timecop, Universal Soldier, Sudden Death or even his best effort to date: Hard Target (one of the best action movies ever made by one of the best action directors John Woo.) The Action is good, the story is exciting, the dialogue is quite funny, this one is better than expected.The bad guys are awesome like in Hard Target, and the fight scenes are \"old school\". Real fans know what to expect. I must say, I gave up on him, but Van Damme is finally back. More Please...."],"review-user":["evo-lander","tirkkanen","belialprod","windsor_playa","ColonelFaulkner","ericthered01","captngravity","ManBehindTheMask63","booksunlimited2","rlange-3","blythblue","dvsdevitt","Mash-the-stampede","farooqnk","canike07","dennisjordin1963","JGSchultz2","furiousneon","livefastdieorea","vhs1999","jmi84-1","capt_rhodes","arrayat","tubs_is","homecoming8"],"review-date":["13 September 2008","5 March 2008","31 March 2008","18 February 2008","6 September 2008","4 March 2009","4 March 2008","9 September 2008","19 February 2008","20 July 2008","1 April 2008","19 February 2008","12 May 2008","15 March 2008","24 February 2008","29 March 2008","1 March 2008","6 March 2008","12 March 2008","7 May 2008","28 February 2008","11 March 2008","29 February 2008","5 June 2008","19 March 2008"],"review-rating":["7","7","8","6","8","7","6","4","5","5","7","8","6","8","8","10","4","10","7","9","3","3","8"],"review-title":[" I enjoyed it\n"," This film is good in it's genre\n"," Excellent throwback to 90's Van Damme\n"," Well good movie but.....\n"," Not too bad.\n"," Run for the Damme border!\n"," Another good DTV from Van Damme\n"," Van Damme's back to kicking some butt!\n"," it's alright\n"," A modestly entertaining action flick with some decent scenes\n"," wow, an excellent dtv actioner\n"," its better than \"second in command\".. but not much else!!!!!\n"," The Shepherd?\n"," A Good Movie\n"," I expected more but a decent effort from van damme\n"," Most interesting JCVD movie in years!\n"," Van Damme delivers once again!\n"," Some of Van Damme's Best Fight Scenes In Years.\n"," Generic\n"," Excellent Van Damme Material\n"," Descent Movie!!!\n"," Excellent by dtv standards\n"," It's so far from BAD.. it's the worst.\n"," very average!\n"," Van Damme Is Back\n"]}