{"review-url":["http://www.imdb.com/title/tt0829143/reviews"],"review-text":["If you are a Catalan nationalist anarcho-socialist with unnuanced reverence for the mythologies of the Spanish republic, this movie may be for you. Two brothers, real-life ones (one of them being Marc Recha himself), re-enact a fictional version of a real-life journey they had made through the spectacular Catalan countryside, and history is evoked (pans of bullet-holed walls, artillery booms on the soundtrack) but not shown. There is very little dialog, and most of it is incidental: the story is told in a third-person voice-over, the voice being that of an actress impersonating the real-life sister of the real-life brothers. The images have little to do with what story line there is, which isn't much. Many are stunning, brooding pans across stark semi-arid mountains and rivers (think Terrence Malick or Gus Van Sant -- there's not a little of both \"Gerry\" and \"Last Days\" here), interspersed with some stunning still images and motionless frames. These are best enjoyed within the film's superb natural sound environment and without the ultimately tedious narration or even the occasional background music (some quite good, some rather odd, but all gratuitous). The best of what this movie has to say is said in these sequences, with their occasional comment-less inclusion of power stations and dams.The relationship between the brothers is left sketchy and generic; a major character is a man-biting catfish, never shown. The more the Catalano-nationalist anarcho-whateverist commitments of the director are suggested, the more the film's richer, unspoken message is subverted and the more irritatingly narcissistic the experience becomes. Though the director said at the NYFF screening that the film was conceived from the beginning with its third-person narrative, I'd like to see a version of it without the narrative or the music and with only the natural soundtrack and minimalist dialog -- the result might be more moving, and would in any case not be that much less baffling.Meantime, this is most likely the only film you will see this year in which a guy strides into the frame with a cloth object (the bathing suit he had been wearing?) dangling from his penis. This is one of the few moments in the whole movie in which your interest is (sorry) pricked by something that's actually happening on screen (what is that? why's it hanging there?), but, as usual, no answers are provided. Very Warholian, very sixties, and a not a little tiresome.","This is the fourth full-length feature film by Marc Recha. By the third 'les mans buides' -Empty hands- I promised myself not to cut my veins anymore. But this time round the plot is completely different -a kind of homage to Ramon Barnils (Sabadell 1940 - Reus 2001) a Catalan journalist-. The visuals in the trailer are stunning -a gleaming river bathed in sunlight- and the promise that Marc himself would be in front of the camera with his twin brother -none of both professional actors- convinced me at last, six weeks after its release. Abandon yourself in this very unusual road/river film. Learn almost nothing about Ramon Barnils but his most poignant legacy: his constant fight against amnesia of what we Catalans chose to forget. 'La batalla de l'Ebre' -look for Battle of the Ebro at the wikipedia- was lost not once but twice because after 40 years of silence and 25 years of half-hearted democracy nobody has done much to remember the legitimate side of the Spanish civil war and those who fought it. This film is about the lonely people roaming the same places with very little conscience of what took place there 70 years ago. This film is about the landscape.","In August Days/Dies d'agost Marc Recha has given us a sun-saturated Catalan documentary-style road movie that's mostly a meandering improvised meditation on brotherhood and reclaiming the dead. The beautiful sometimes large-scale, richly atmospheric 35 mm. landscape images, nice soundtrack and Catalan-language narration are enchanting as a mood piece, if one is content with a trajectory that hasn't much momentum and doesn't lead anywhere in particular. Filmmaker Marc Recha and his non-identical twin David are the stars and the narrative is voiced by their younger sister. Marc had been researching the life of Ramon Barnils (1940-2001), a socialist editor who had been a family friend. He felt he was saturated with information and had to take a break. The break turned into making this film, which seeks to capture the mood of the interviews with Barnils' associates, thoughts about the Spanish Civil War, the drought season they were experiencing, the rugged landscape, the Recha brothers' affection for each other, swims and suntanned nudity and whatever characters or stories they ran into as they camped out of their van. This leads to pursuit of a giant catfish and the temporary disappearance of one of the brothers. In the end David has to go back to Barcelona to be with his daughter and Marc has to return to his project, and there it ends. I found it fascinating to listen to an extended narration in the Catalan language with its blend of Spanish and French-sounding words (perhaps linked with Provençal?). This isn't a major film but it commands attention and makes sense as a film festival choice with its clean visual and auditory beauty and its way of playing around with genres and blending autobiography with fiction and documentary in a fresh and thought-provoking way.An official selection of the 2006 New York Film Festival at Lincoln Center.","Freely, from one scene to another, from one story to another, just like when walking, from a shadowy path to an open place, like the wind in the leaves, from a tree to another, how many different sounds ? Just like when traveling, people meet and tell their stories and then part forever, who knows ? And just like when walking through these places full of the lost expectations from another time, the human 'thickness' of the world takes the breath away.I saw this movie with friends of mine, not all of them liked it, maybe were they too used to scenario-based and ready-made stories, I don't know. So this movie is for the silly ones who love looking at the sun sparkling on the sea, walking without any hurry in the hills or through the little villages, listening to the growing grass, which tells the stories of those underneath, six feet under, in the warm wind of summer.","The most irritating thing about \"Dies d'agost\" (August Days) is not simply that NOTHING HAPPENS in this film but that director Marc Recha has the nerve to pretend that this film is some sort of homage to leftist Catalan journalist Ramon Barnils. Unless mentioning Barnils' name a few times constitutes an \"homage,\" this pretense is an utter fraud. You will learn virtually nothing about Barnils in this film nor about the Spanish Civil War (1936-1939) nor about the special role of Catalunya in that war. You also will not learn about the collective punishment inflicted on the heroic Catalan people for years afterward by the victorious and vindictive Franco.The footage of the Catalan countryside is very beautiful, of course, but \"Dies d'agost\" does not have an extensive and varied enough collection of such scenes to qualify as a travelogue. The large number of stills shown — not very illuminating images of the forest floor, for example — is the clearest indication of the paucity of ideas here. The aimless drift of brothers Marc and David during their camping trip does not produce compelling cinema. On the contrary, one's strongest impression is of a film made by and for spaced-out, middle-aged hippies. Don't waste your time. Read a good book about the Spanish Civil War instead. (I recommend Felix Morrow's scathing \"Revolution and Counter-Revolution in Spain,\" which includes a gripping account of the 1937 Stalinist-led purge of the revolutionary left in Barcelona.)Barry Freed"],"review-user":["Mengedegna","joelsegarra","Chris Knipp","Lopardal","freeds"],"review-date":["1 October 2006","18 January 2007","30 September 2006","14 January 2007","22 November 2007"],"review-rating":["4","9","7","10","1"],"review-title":[" Stunning, brooding images, but too self-regarding\n"," Insomniac amnesiacs\n"," Mediterranean meditation\n"," Free ride\n"," Spaced-out in Catalunya\n"]}