{"review-url":["http://www.imdb.com/title/tt0804522/reviews"],"review-text":["Imagine you have just been on a plane for 18 hours. You have been on a business trip to South Africa. You are a high-paid professional. You've lived in the US for 20 years. You are in your thirties, you have a wife a little boy and another baby on the way. One thing, even though you have a green card, you are still Egyptian. On transit you are asked to come with 2 security guards, next thing you know you are overpowered, hooded and chained and after a brief ( but still reasonably civil) interrogation you are to be rendered! This is what happens to Anwar el Ibrahimi at the beginning of the movie. His is a story of pain and ( literally )torture. It's one of several story lines. One follows his wife's attempts to get more information. One follows the (cold) bureaucrats behind the rendition. Another story deals with the family of the man who leads the interrogation of Anwar el Ibrahimi. There are some other stories too and by the end they all neatly come together. Though the more famous actors like Reese Witherspoon ( as the distraught pregnant wife ) Jake Gyllenhaal ( as the CIA rookie forced to watch the interrogation in Northern Africa) and Meryl Streep ( as CIA hotshot Corine Whitman) it is really the more unknown actors that carry the story and give it it's heart. For me the actor playing the unfortunate Mr El Ibrahimi ( Omar Metwally ) was the heart and soul of this movie. His portrayal of a man in distress was shockingly well done. It's almost as if he was being tortured for real! Also Israeli actor Yigal Naor was very impressive as the part worried family-man and part extremely cruel chief of torture. Hard to watch and not exactly fun, but still very worthwhile.","\"I fear you speak upon the rack, where men enforced do speak anything.\" This Shakespearean line from The Merchant of Venice is echoed again in the new film Rendition which introduces the viewer to the \"enhanced methods of interrogation\", renditions, which began in the Clinton Administration and have become more commonplace since the terror attacks of September 11, 2001.The film features an all-star cast, with Oscar winners Meryl Streep, Alan Arkin, and Reese Witherspoon, as well as Peter Sarsgaard, Jake Gyllenhaal, and Omar Metwally. Supporting roles filled by unfamiliar actors deliver as well, sucking the audience into the plot, and showing how many people can be affected by overseas terror attacks, and our means of investigating them.Rendition follows an Egyptian born terrorism suspect (Metwally) who is taken by U.S. officials following his flight from South Africa to Washington DC to an undisclosed prison overseas. His pregnant wife (Witherspoon) ventures to Washington DC to find out about his disappearance through a family friend and Senator's employee (Sarsgaard). Gyllenhaal plays a young CIA analyst at the overseas detention facility who monitors the violent interrogation.This film follows the emotional plights of the torture victim (Metwally), and those involved in obtaining the supposed information from him. Some, like the CIA analyst (Gyllenhaal), are visibly shaken and horrified by the methods exercised, while others, the stern Senator (Streep) and foreign interrogator (Yigal Naor), see it as necessary and effective.The film may be described by some as a political piece, but is ultimately an emotional one. Metwally's performance as the tortured prisoner is Oscar-worthy. The film does not intend to preach, but rather to question and inform the audience on a topic that does not often have a human face put on it. Renditions have been known to work, but have also been known to produce false information from innocent prisoners. The film simply depicts the emotional struggles of those involved in such grave business, and does so in a way that will affect every viewer differently. The film will keep your interest, and have you engaged in each of the character's plights.","I saw the movie yesterday and was shocked by it, but even more shocked by some of the comments I have read here. One person wrote that it was ambiguous if the victim of the torture was guilty or not--therefore... One person wrote that since he wasn't an American citizen, therefore... Some people comment that the people in the Middle East hate us and want us dead, therefore... So are we saying then that it is right to torture someone who is guilty of a crime? Are we saying it is right to torture someone who is not an American Citizen? Are we saying that it is right to torture someone who may hate us and want us dead? Are we saying that, as is written in the Geneva Convention, the Declaration of Human Rights and the Constitution of the United States that \"torture is wrong, but some torture is less wrong than others?\" When does it become \"right\" to torture? THAT is why this movie is powerful-- it is ambiguous, but not about torture. Torture is always wrong, and if we are willing to do it, even in the name of justice and \"National Security\" or \"freedom and democracy\" then we are wrong and we are evil; we are doing exactly what we are accusing our enemies of doing (and we are calling them \"wrong\" in the same breath.) My favorite line in the film was \"if you don't want to compromise join Amnesty International.\" Right on.","In this day and age in which just about every other news story involves discussions of waterboarding, images of Abu Ghraib, or tales of forced detentions at Guantanamo Bay, Gavin Hood's \"Rendition\" is about as up-to-the-minute and timely a movie as is ever likely to come out of the entertainment mills of mainstream Hollywood. It's not, by any stretch of the imagination, a perfect film, but neither does it merit the caterwauling opprobrium it has received at the hands of critics from all across the ideological and political spectrum.The term \"rendition\" refers to the ability of the CIA to arrest any individuals it suspects of terrorist dealings, then to whisk them away in secret to a foreign country to interrogate and torture them for an indefinite period of time, all without due process of law. Anwar El-Ibrahimi is an Egyptian man who has been living for twenty years in the United States. He has an American wife, a young son and a new baby on the way. He seems a very unlikely candidate for a terrorist, yet one day, without warning or explanation, Anwar is seized and taken to an undisclosed location where he is subjected to brutal torture until he admits his involvement with a terrorist organization that Anwar claims to know nothing about.On the negative side, \"Rendition\" falters occasionally in its storytelling abilities, often biting off a little more than it can chew in terms of both plot and character. The ostensible focal point is Douglas Freeman, a rookie CIA agent who is brought in to observe Anwar's \"interrogation\" at the hands of Egyptian officials. The problem is that, as conceived by writer Kelley Sane and enacted by Jake Gyllenhaal, Freeman seems too much of a naïve \"boy scout\" to make for a very plausible agent, and he isn't given the screen time he needs to develop fully as a character. We know little about him at the beginning and even less, it seems, at the end. He \"goes through the motions,\" but we learn precious little about the man within. Thus, without a strong center of gravity to hold it all together, the film occasionally feels as if it is coming apart at the seams, with story elements flying off in all directions. A similar problem occurs with Anwar's distraught wife, played by Reese Witherspoon, a woman we never get to know much about apart from what we can see on the surface. Gyllenhaal and Witherspoon have both proved themselves to be fine actors under other circumstances, but here they are hemmed in by a restrictive screenplay that rarely lets them go beyond a single recurring note in their performances.What makes \"Rendition\" an ultimately powerful film, however, is the extreme seriousness of the subject matter and the way in which two concurrently running plot lines elegantly dovetail into one another in the movie's closing stretches. It may make for a slightly more contrived story than perhaps we might have liked on this subject, but, hey, this is Hollywood after all, and the film has to pay SOME deference to mass audience expectations if it is to get itself green lighted, let alone see the light of day as a completed project.Two of the supporting performances are particularly compelling in the film: Omar Metwally who makes palpable the terror of a man caught in a real life Kafkaesque nightmare from which he cannot awaken, and Yigal Naor who makes a surprisingly complex character out of the chief interrogator/torturer. Meryl Streep, Alan Arkin and Peter Sarsgaard also make their marks in smaller roles. Special mention should also be made of the warm and richly hued cinematography of Dion Beebe.Does the movie oversimplify the issues? Probably. Does it stack the deck in favor of the torture victim and against the evil government forces? Most definitely. (One wonders how the movie would have played if Anwar really WERE a terrorist). Yet, the movie has the guts to tread on controversial ground. It isn't afraid to raise dicey questions or risk the disapproval of some for the political stances it takes. It openly ponders the issue of just how DOES a nation hold fast to its hard-won principle of \"civil liberties for all\" in the face of terrorism and fear. And just how much courage does it take for people of good will to finally stand up and say \"enough is enough,\" even at the risk of being branded terrorist-appeasing and unpatriotic by those in power? (The movie also does not, in any way, deny the reality of extreme Islamic terrorism).Thus, to reject \"Rendition\" out of hand would be to allow the perfect to be the enemy of the good. \"Rendition\" may not be perfect, but it IS good, and it has something of importance to say about the world in which we now live. And that alone makes it very much worth seeing.","Rendition presents a very topical matter in the form of a very tense thriller. It's a gripping, and not a preaching, movie. Seeing it in an Arab country with a mixture of Arabian and European audience gave it an extra level of atmosphere. The audience was totally gripped by the film and gave it a loud applause afterwards. The story of an Egyptian, married to an American, picked up on the suspicion of links to terrorist organizations and shipped to a friendly (with US) Arab country for \"enhanced interrogation (as Meryl Streep's character states in the film: \"we have no torture in the US\") seems to be from the front page of todays news. There is a very neat link between the various characters which appear in the movie and the pace of the film never drops. The movies'message seems to be (as stated by Jake Gyllenhal's character in the film) that by abducting and torturing suspects you create many more terrorists. The acting is uniformly excellent with Streep and Reese Witherspoon the stand outs. Not to be missed.","I liked this movie. I saw it to a packed house at the Toronto International Film Festival the day after the gala opener which must have gone over well. The director, Gavin Hood was supposed to be present for today's screening, but alas his twins were born just hours before, so he had to jet on a flight back. '2 birthings in 24 hours' was how he joked about it.Rendition refers to 'extraordinary rendition' -- a term whereby suspected terrorists in the US can be sent, without the legal consent of their parents nations, to prisons abroad to be questioned and detained.It's fairly predictable -- innocent Egyptian-American man wrongly accused of being a terrorist 'goes missing' while en route from South Africa to Washingon DC. He is sent abroad, while wife at home (Reese Witherspoon) fights to find him and free him. But what makes this movie special are some nice choices in story-telling: 1) a human-touch story of what is going on in the locale where a suicide bomb-detonated; 2) the humanity of a CIA agent trying to understand and be honest with what is really going on; and 3) the chronology of story-telling which makes it a tight, taut tale that moves and jerks at the right moments. Ah -- relief! And a mix of emotions that swirl around as the story fights for an ending.All-around strong acting with Meryl Streep as a standout vixen.","I'm Egyptian. I have a green card. I have been living in the US since 1991. I have a very common Arabic name. I'm married (non-American but non-Egyptian, non-Arab wife). I have children who are born in the US. I have a PhD in Cell Biology from the US and I travel for conferences. I make 6 figure income and I own a home in the Washington, DC area. I pay my taxes and outside 1 or 2 parking tickets I have no blemish on my record since I came to this country in 1991. I look more Egyptian than the Ibrahimi character but my spoken English is as good as his.A couple of months ago I was returning from a conference/company business in Spain through Munich Germany to Washington, DC (Home). I was picked up in Munich airport by a German officer as soon as I got off the Madrid plane. He was waiting for me. He was about to start interrogating me until I simply told him \"I have no business in Germany, I'm just passing through\". He had let me go with the utmost disappointment. That was nothing compared to what happened at Washington, Dulles airport (Which was not nearly as bad as what happened to Ibrahimi in the movie). The customs officer asked me a couple of questions about the length and purpose of my trip. He then wrote a letter C on my custom declaration form and let me go. After I picked up my checked bag I was stopped at the last exit point (Some Homeland Security crap). I sat there for 3 hours along with many different people of many different nationalities. I was not told the reason for my detainment. I was not allowed to use my phone or ANY other phone. I was feisty at first asking to be told of the reason or let me go but decided to suck it up and just wait and see. I asked if I can call my wife to tell her that I'm going to be late but was told no. When I tried to use my phone and as soon as my wife said \"hello\", an officer yanked the phone out of hand and threatened me to confiscate it. When I asked about needing to call home because my family is waiting, they said \"Three hours is nothing, we will make contact after 5 hours\". When I asked to use the bathroom, an officer accompanied me there. It toilet was funny; I guess it was a prison style toilet that is all metal with no toilet seat. Finally, they called my name and gave me my passport/green card and said you can go. I asked what the problem was, they said \"nothing\"!! I know it was only 3 hours but I was dead tired and wanted to go home to see my wife and kids.As for the movie, it was very well made. Unlike most movies that involve Arabs and use non-Arab actors who just speak gibberish, this movie the Arabic was 100% correct. I assume the country is Morocco (North Africa).","I think this was the most outstanding edge-of-your-seat thriller that I have seen in a long time. The research for the film was thorough, the writer Kelly Sane has left no loose ends. The cast was seasoned (fantastic performances all round). Omar Metwally was outstanding.The cinematography is poetic, music enchanting and the overall effect highly satisfying.Rendition goes into territory that even the media fears to tread. It is really a wakeup call for those involved with espionage and the legal web that is the \"War on Terror\". A woman walked out of the theater and asked me \"does this really happen\"? That in itself speaks of Gavin Hood's masterful achievement.","The film tackles the here and now horror of \"rendition\" with a multi-cast trans-global account of all involved. No-one gets off lightly because we see the blindness of the players as they carve out their own slice of the worldwide game piling hatred and misery on their \"enemies\" and themselves in equal measure.The interplay between the sympathetic Senator's Aide (played in scintillating style by Peter Sarsgaard) and the real Washington power-mongers is electrifying. Meanwhile out in the field, new CIA man (Jake Gyllenhaal) goes through a sea change in his attitude to the USA's new found cosiness with torture. Sudden though his rejection of what he initially tacitly condoned is, one has to ask why on earth would anyone who calls him or herself civilized stand and watch anyone be humiliated and abused in this way? The film has few heroes - perhaps Gyllenhaal's flawed and vacillating CIA man is the exception and a necessary indulgence to make the film offer a sliver of hope.The sad fact of course is that this film isn't fiction at all, but a wake up call to those with a shred of decency left in them. The awful truth is that we in the UK and USA have lost the moral plot and this film shows how low we are prepared to go. All this in the name of freedom! There's a wonderful line in the script that says that torture is a sure way to swell the numbers of our enemies. This is already happening in real life and we should listen to the message that this film delivers and start using our might and money much more intelligently!! The message seems to be that any of us who claim that rendition, torture and the abuse of basic human rights are necessary to protect our way of life are as wrong-headed and stultifyingly stupid as the Jihadists and suicide bombers.All praise to the sensibilities of a talented South African director with a eye on the gross unfairness of how power is exercised, and a cast of principled mainstream actors from the US and beyond. Oh, and by the way, the film has a sting in its tail with the ending a clever and thought provoking surprise (which I won't give away).I saw the film in an early London preview so it has not yet been widely written up but I'm glad to say that the tide of less than glowing reviews seems to be turning. The BBC review has been very strongly in support and they (and I) suspect that much of the negative comments come from those who see the world through the simple specs of Hollywood - where the good guys and the bad guys are cardboard cut-outs. Hence the reason that many of the truly great films of the year are increasingly indie and/or non-US pix.","Think of it as an extreme form of detention without trial. Without commenting and taking a side on the US Foreign Policy, the process of Extraordinary Rendition involves taking persons suspected of terrorist activities to a foreign country, an opposite to an extradition if you wish, to a place where torture is not a crime but a means to illicit information. Instead of staining your soil with blood of potentially innocent parties, you do so on foreign land where such tactics are accepted interrogation techniques.Naturally, given the severity of the tactics and attempts at breaking down a person, sometimes you would get what you want once you pass the resistance, or get nothing, or worst of all, get a confession just because the mind has been broken to the point that the subject will agree to whatever you say. It's an ugly process, and what better way to do it when you're the champion human rights, giving the nod to use whatever means necessary in the name of protecting more lives, in an age where information is key to the battle against terror, and doing so in a country where probably the rights record is questionable.Rendition is this year's Syriana, though in the run up to the new year we do have a number of political thriller contenders to take that crown, with Rendition first of all, followed by the Robert Redford movie Lions for Lambs, starring Tom Cruise and Meryl Streep (again, though now on the other side of the fence), and The Kingdom with Jamie Foxx and Jennifer Garner, though this one would probably turn out to be more action driven. Directed by Gavin Hood, who did Tsotsi and will be helming the new Wolverine spin off, Rendition is a decent thriller with a top notch cast, in a narrative that has been proved quite popular these days - the split, which provides for some ample differential perspectives to be presented through an ensemble cast.Anwar El-Ibrahimi (Omar Metwally), a chemical engineer, gets renditioned en route to going home under the orders of CIA top brass Corrine Whitman (Meryl Streep). At a detention facility outside the US, Jake Gyllenhaal's CIA analyst Douglas Freeman (oh so prophetic) embarks on his very first interrogation session, no doubt being thrust into a position that he didn't sign up for. Back home, a very pregnant Reese Whitherspoon searches frantically for answers to her husband's disappearance, and sought after an ex-flame Alan Smith's (Peter Sarsgaard) assistance, since he's working for Senator Hawkins (Alan Arkin). Throw in J.K. Sinmmons, a terrorist plot investigation and a budding forbidden love story between Fatima (Zineb Oukach) and Khalid (Moa Khouas), you have quite a bit going on in a busy picture.Given a number of casts, locations, timelines and the likes, Rendition wasn't confusing at all, and it plays out with deft handling of the material, never quick to judge, presenting ideas and thoughts from both sides of the equation. Every character has their own agenda, and the unveiling of this agenda engages enough not to bore nor to confuse you. And the best part of it all is how, very truly, they bow down to self-preservation in different forms, and ultimately, in various lose-lose situations unfortunately. It kept you guessing as well - did he or didn't he, and constantly played with your mind as to whether Anwar deserved what he's getting. It utilized one extremely smart sleight of hand which I didn't see coming until it's too late (so there goes the credit), though it did succumb to the usual stereotyping of terrorist militants, and without spending much time in depth to explore their motivations. Perhaps it didn't find a need to, given so many movies out there already touching base on this issue (Paradise Now, Day Night Day Night, Syriana even). While it turned out to be rather one-dimensional (personal tragedy to strapping of bombs to become a suicide bomber), I felt Rendition did right in not providing any saccharine sweet ending, that this fight against negative, destructive ideology, isn't something that can be addressed in a two hour movie, and I'm glad it steered clear such fairy tale implausibilities. What we have instead is a well crafted tale that sets its gun sights on the issue of Rendition, and probably capable enough to spark discussion once the lights come on, on which camp you belong to - do you support inflicting severe pain in interrogation? Yes or No? This is the quintessential question of our time. Yes or No? (OK, I'm already geared for Lions for Lambs)!","Rendition fails to really nail the issue - it chooses instead to show its colours too distinctly. And what we get instead is a decent political thriller, but one that is difficult to assess in terms of its attempted aim - after all, here we are dealing with what must be one of the emotive issues known to man - can torture ever be justified? Is the utilitarian rule of the possible gains worth the literal breaking of a possibly innocent man? Is he a terrorist, isn't he a terrorist? This is a very important topic, and a very complex one, that is treated as though it were a film about lobbying on the one hand, showing Washington and the Beltway as a ground for piranhas to make or break their careers, and on the other, in Egypt, a battle for the sanity of all involved there.Yes, it makes a good thriller; but, and it's a big but, it lacks the true depth of thought, rather than action, that will address the issue, rather than (God forbid) entertain an audience.Excellent performances from all involved - really. Good steady hand at the helm - but what it lacks is complexity - it seems complex initially but unravels the further down the rabbit warren we go.I came away uneasy, but not as uneasy as I should have, and non-plussed by the sleight of hand tricks that should have revealed real ambivalence, real moral dilemma, real grey areas, whereras instead I was left with black and white.Not the film it wants to be, it is a good political thriller, but it is not as effective a piece of cinema as it could have been.","CIA analyst Douglas Freeman (Gyllenhaal) gets to see his first secret location interrogation when Anwar (Metwally) is accused of having contact with a known terrorist bomb maker. Anwar's wife (Witherspoon) is frantic regarding the whereabouts of her husband .Don't you just hate it when the title of a movie sends you to a dictionary? I must have an old edition as this Rendition is not a musical piece. No, it's the government's way of legally taking a resident or citizen somewhere to interrogate him and possibly use some torture to get the desired information. While watching this movie I was reminded of a similar story line in the Crossing Jordan TV show (now off the air), and I expect we will see even more of these story lines. It's inevitable. The events of 911 are the catalysts. This is a tough one to watch because we don't like to see people tortured and our government not telling the truth about things. We like the idea that no matter what happens or happened that we can go somewhere to find answers, but when that door is closed to us, we are truly lost and without hope as Anwar's wife was. Performances by all were first class and it's possible we may see more of Igai Naor (I have no idea how to pronounce it) because he resembles and can act like Telly Savalas. No kidding. Violence: Yes, Sex: No, Nudity: No, Language: Yes","The powerhouse cast pulls the crowd in the theatre, despite the ominous title. Jake Gyllenhaal guested on Conan O'Brien to promote the movie and explained that 'Rendition' was a euphemism for obtaining information via torture. Since 9/11, 'extraordinary rendition' allowed the government's intelligence agency to extricate people unquestioningly without due process and use any means necessary in exchange for information.Gyllenhaal plays rookie CIA analyst Douglas Freeman (note the irony) who is torn about his assignment which renders him as a mere observer to unorthodox interrogation proceedings at an underground detention facility outside the US. Omar Metwally plays the suspected terrorist Anwar El-Ibrahimi, Egyptian national and green card-carrying hubby of American Isabella Fields El-Ibrahimi (Reese Witherspoon). Isabella and her son wait for Anwar to come home from a scientific conference when he suddenly disappears from the plane's passenger manifest. She seeks help from her college friend who works in government and learns that the Head of Intelligence, Corrine Whitman (Meryl Streep) is behind it all. Rendition is directed by Hollywood newbie Gavin Hood (who is set to do X-Men Origins: Wolverine), and begs the question of whether such 'extraordinary rendition' is exercised in real life. The movie was released locally in the wake of the Glorietta explosion (bombing/mishap?), and a pivotal scene in the movie is when a bomb explodes in a public plaza, so that must have sent chills up every moviegoer's spine. Seeing the exploding tableau with a lone red and yellow sign Aajala (Ayala?) on the upper right hand of the screen, plus the effect of silence and slow-moving images magnified the impact of the scene's real-life coincidence. There are lessons to learn from this movie and it all boils down to personal decisions we make, daily. We all have choices we can exercise at will, and we often do not always (want to) see how these affect others, who may end up as hapless victims of circumstance. What 'the greater good' is should not have to be a forced choice our leaders have to take if we each already decide correctly at the source. Now that's a utopia worth building.","Some films are designed to just entertain you, others to make you laugh, or cry, or uplift, others, like this, aim to provoke, to make you think, and to make you angry. I was angry during this film, not at the film, but at the fact that it was true, that America, the free, does torture in the illogical view that it is doing it for the greater good. The torture scenes in this movie were harrowing, the indifference of people was shattering, the film was compelling in its argument, and showed just how wrong it is to torture people. Of course now that makes me a \"bleeding liberal\" labels shoved on people by others who shut their minds to the facts that this does happen and should not. People who don't realise that as the movie said, for every person tortured,you get ten or one hundred people rise up to perform acts of vengeance. You get an ever increasing cycle of violence. This film did not make me hate America, although I can see how it could do, but it made me hate the way that America has reacted in its post 9/11 world. There is a significant quote in the film, just after we have learned that 19 people have died and seventy five were injured in the bomb scene, the quote is \"one American is dead\" - that makes the difference. You cannot kill an American, America can kill thousands but you cannot kill a single American, or they will do whatever it takes, including torture to enact justice. This is the American way apparently. Call me a liberal, call me naive (although I think the people who think torture is fine are naive) call me deluded, call me anything you like, but this film is a brilliant example of what is wrong in America and the west today. I wish this film would be shown to all school students, at a minimum. This film will stay with me a long time, part of me wishes I could forget it, because I wish this type of thing never happened, but I know it does, the other part of me wishes I would never forget, because we need to remember these shameful events to prevent them from happening again. Whatever happens to me, this film will be with me for a long time, and I will be telling everyone I know to watch it, not to be entertained, but to be provoked, because sometimes we all need to be provoked.","Rendition is one of that films which analyze the political situation in the USA after September 11th.That intention is good and the film is interesting...but not too satisfactory.Let's see why.Rendition has a very slow development which,on some moments,bored me.I would have preferred some more dynamism.Also,the film tries to show so many subjects(the indoctrination of the terrorists, the Islamic fundamentalism, the intricate world of the politics, the torture and its justifications)and they are not so well developed.But,I find Rendition a good film.The performances are great.Reese Witherspoon proves her talent goes much beyond of starring in stupid romantic comedies because her performance in here is extraordinary.Jake Gyllenhaal,the brilliant Alan Arkin and the overrated Meryl Streep also bring excellent performances.Director Gavin Hood(whose previous film was the amazing Tsotsi)makes a very good and detailed work as a director.I have opposing opinions about Rendition.For one sight,it's an interesting movie with excellent performances and a very important message.But,for the other sight,it's a slow and a little bit boring movie which tries to show a lot of subjects.I think I can recommend Rendition because it has something to say.And I always appreciate that.","Reviewed at the World Premiere screening at Roy Thomson Hall, on Sept. 7, 2007 during the Toronto International Film Festival.On the surface, this would seem to have everything going for it with a solid cast (veterans Witherspoon, Sarsgaard, Gyllenhaal, Streep, Arkin and new faces Metwally, Naor, Oukach, Khouas) a recent hot director (Gavin Hood, dir. of \"Tsotsi\", winner of the 2006 Oscar for Best Foreign Film) and a script on a current hot-button issue (the anti-terrorism law of extraordinary rendition which allows U.S. agents to transport suspected terrorists to off-shore sites where anti-torture laws do not apply).Somehow each of the cast members, perhaps due to the number of major characters involved and thus the reduced screen time allowed for each, come across as superficial stereotypes - the distraught expectant mother, the ex-boyfriend who tries to help, the CIA agent with a conscience, the cold hearted CIA executive, the pragmatic senator, the torture victim, the secret police torturer, the torturer's daughter with a secret boyfriend, the boyfriend with a secret). You're not with any of the characters long enough to identify with them much and when it all gets tied up together in the end a bit too neatly you're just left feeling disappointed and cheated.Early reviews seem to be mostly praising this but the friend whom I saw it with and another veteran TIFF goer that we see in various line-ups had the same sense of disappointment.The film just seems too desperate to make it all relevant as it tries to inspire our shock at the wrongs being perpetrated in the name of the anti-terror wars but it mostly comes across as clichéd rather than natural. When the Gyllenhaal character finally builds up the will to act on his moral outrage you're just not convinced about how he's made this character arc as he has spent the first 3/4's of the film either stunned by the effects of a suicide bombing that takes place before his very eyes and then drinking himself into a stupor while occasionally taking time out for an illicit office romance or to bark an order to underlings. It seems Gyllenhaal is the protagonist we are meant to identify with but he is too weak-willed to inspire much audience sympathy. Witherspoon as the distraught expectant mother has more of an immediate draw on our heartstrings but doesn't kick off the expose on the U.S. side of the things which we are pulling for her to do by soliciting help from ex-boyfriend Sarsgaard (who works for Arkin's senator character) after her Egyptian-American husband goes mysteriously missing after a trans-Atlantic flight. There are at least a few moments of fireworks when Witherspoon at least briefly gets to confront the CIA exec played by Streep who is pulling the forced extradition strings behind the scenes, but a few seconds of confrontation doesn't make up for the 90 minutes of gradually increasing tedium that it takes to get there and we still have about 30 minutes to go in the plot after that highpoint. The subplot built around the head police torturer and his family in an un-named North African country is more engrossing and a neat twist is pulled off in that storyline but that wasn't enough to save the picture for us.I had really been looking forward to this film but something just seemed to be missing in the way it pays off the different plot lines.","As an alternative to Rendition you could create some form of power-point presentation showing a picture of Jake Gyllenhal with the words \"TORTURE=BAD\" flashing on and off every second or so. Then you could watch it for two and a half hours. It would be slightly more enlightening and a lot more entertaining than Rendition.--Spoiler--Naughty terrorists blow up a market place in an unsuccessful attempt to kill a senior Egyptian police officer and killing Jake Gyllenhall's friend in the process. Because all the planes in America are currently being used for rendition flights the CIA cant send out a replacement for the dead bloke and tell Jake that he has to do the job despite not being a field agent.A man is stopped at customs while getting off a flight from South Africa and then kidnapped by the US security services. He's an Egyptian chemical engineer who's suspected of having ties with the terrorists behind the marketplace bombing. He's innocent. We know this because he's married to preggers all-American blonde Reese Witherspoon.After refusing to admit to being a terrorist the Egyptian is renditioned (rendited? rendified?) to Egypt for water-boarding. I always think that it sounds like some kind of sport. I expect to see pictures of happy people surfing with the slogan \"Go Waterboarding With the Family\" or some such. Anyway -insert generic Arabic sounding name here- is sent to the prison camp run by the police officer and tortured while Jake looks on with mounting horror and increasing conviction that the Egyptian is innocent.In the meanwhile we see a sub-plot about the policeman's teen-aged daughter being seduced by a bloke who is going to lots of \"Allahu Akbar\" type meetings. There is also the sub-plot involving Reese trying to get the American government to admit to kidnapping her husband for torture.Eventually the Egyptian gives up the names of his \"comrades\" who turn out to be the 1974 Egyptian national football (soccer) side. \"Brilliant!\" I thought, \"Now we get to see ageing footballers having the electricity applied to their nipples.\" But sadly it wasn't to be. Jake gives in and rescues the Egyptian, presumably loosing his job in the process.To cut a needlessly long story sideways we eventually find out that the daughter's boyfriend was the suicide bomber from the beginning of the film and that the policeman doesn't realise that his daughter died in the same incident. Bummer, that'll teach him for being a nasty torturer then.--End Spoiler-- The film falls into the terrifying category of films that want to make you a better person. I can just about tolerate it when it's a film about some horrible abuse that I don't know about but really, anyone who doesn't disagree with the policy of extraordinary rendition either: A) doesn't care; B) thinks all brown people should be tortured on general principle; or, C) couldn't spell extraordinary, let alone know what rendition means. In the end this film is a bit like Syriana which spent about 7 hours shocking us with the massive revelation that \"the oil business is a bit shady\". Rendition is a non film about a non issue (given that extraordinary rendition stopped about 2 years ago). Hollywood can make all the movies it likes about these sorts of injustices and it wont make a blind bit of difference because the people who agree with, don't know about or don't care about the policy wont see this film and those that do see it will already share the film makers moral outrage about the issue and will tut and carry on eating their organic, sustainably produced, hand knitted hummus.","Isabella (Witherspoon) is supposed to meet his husband, Egyptian-born Anwar El-Ibrahimi (Omar Metwally), who is supposed to return from a conference in South Africa to the US. When he doesn't show up at the airport, she is told that her husband has never boarded the plane. She tries to track him down, and learns that his husband is a terrorist suspect linked to a suicide bombing that occurred recently in an unnamed North African country.Meanwhile, CIA analyst Doug Freeman (Gyllenhaal) becomes a witness, albeit reluctantly, to the torture of Ibrahimi, who firmly maintains his innocence despite the glaring evidence stating otherwise. Freeman believes him, but his superiors don't.At first glance, \"Rendition\" seems like THE political thriller of the season, what with a cast that boasts of Reese Witherspoon, Jake Gyllenhaal, Meryl Streep and Alan Arkin, among others; and a director in Gavin Hood, the same guy who helmed the Academy Award-winning \"Tsotsi.\" And to some extent, the film is kept alive by the engaging performances of the actors involved plus Hood's ability to rack up the tension. But ultimately, the film contents itself on remaining uncomfortably simplifying things up - where black is black, and white is white - wasting a potentially more intelligent treatment of the theme.If only for the performance and the visual mastery of the film, \"Rendition\" earns points. But it doesn't get over the fact that what it rams down the throat of the viewers isn't exactly what it is. For the film, there's either the good and the evil. Yet the truth, as always, lies somewhere in between.","Making the movie Rendition was a very good idea and addresses an important problem that is occurring today. This movie though does fall short. It did not have the juice that Lions for Lambs or the shocking portrayals of a documentary.The acting was for me below average. Reese Witherspoon looked her part and played the way she needed to as a pregnant mother who's husband has been kidnapped. I cannot say the same for the others though. Merryl Streep just annoyed me in this movie. She played as a top employee of the CIA (I think) who gives out the order of torturing someone, but the way she played her role was just so cliché and unoriginal she did not bring anything special that she usually does in other movies. She actually ruined this movie. Then there was Alan Arkin, he played very well but there is just one problem he was in the movie for about as long he is in the advertisements. He did show you what a senator does do but not enough. Peter Sarsgaard did have a very good chance to shine in here but he did not get enough screen time. He was the key to this movie and he just did not have the chance to inspire or perform the way he could have. Jake Gyllenhall who did was just there. I'm not really sure what he was supposed to do in this movie but just stand there. I think he is an overrated an actor and showed that in here. Yigal Noar who played the father looking for his daughter could as well have really had an impact on this movie but just did not. The two actors who played lovers really did not bring enough of an emphasis to there characters at all and it just fell short like the rest of this movie. Omar Metwally who played the man being tortured gave the best performance out of all of these actors.The directing and writing was poor in Rendition. Gavin Hood and the writer are the main reason why this movie fell short in every aspect. They did not give too much meaning in this movie and did not develop the character in a efficient way. Probably the lack of development of the characters ruined this movie the most. That is why the acting was not too great. How could you write a story like this and not explain who these characters are and why they do the things they do. That is how you explain why people are terrorists, CIA agents, etc. Without that this is a horrible political movie and political statement. This movie does not even tell you the job positions of the Merrly Streep and Yigal Noar who are very important here. This movie needed to be much longer in order to truly push the message of the story forward but it just turned out to be a battle for screen time between the stars of Hollywood. Not enough clarity. Not enough development of characters, not enough reasoning and just too short.","The term 'rendition' is a euphemism for state-sponsored kidnapping, just as 'waterboarding' is a euphemism for torture and the vile 'collateral damage' means civilian casualties. Kidnap, torture and the murder of innocents is what the bad guys do. You cannot carry out these acts and claim to be the good guys. Anyone who says it is 'naive' to think so is feeble-minded.Thematically, this film doesn't work because it thinks there is an argument to be had on this topic. The filmmakers think it has to be argued through, but I can't see any educated person having their mind changed by a Hollywood dramatization. The issue is covered in such a shallow manner that this film could easily be called Rendition for Dummies.Considered in purely dramatic terms, the acting is high quality, as you would expect from a stellar cast, though the stand out is the little-known Zineb Oukach as love-struck Fatima in an ill-fated relationship with one of her father's political opponents. There is a looping time-line a la Pulp Fiction that seems out of place given the charged themes. There is also a sense that the 'bad guys' get their comeuppance, which, given the fact that we are living through these issues and they are far from resolved, is premature at best and insulting at worst.I was left with a sense that some issues are best served by being considered with the benefit of distance and hindsight.","Extraordinary Rendition is a frightening practice authorized, surprisingly, under Clinton, that allows the U.S. government to seize and hold anyone suspected, seemingly for any reason, of being a terrorist against the United States. This is a touchy issue, especially after 9/11, because supporters of the practice will always criticize the opposition as withholding vital power from the U.S. that it needs to effectively fight terror. Fanatic supporters will label the opposition as terrorists in themselves. But like a recent film that lent a similar level of humanity to the death penalty, The Life of David Gale, Rendition shows us a story of the misuse of extraordinary rendition, or at least the ease with which it can be exploited and falsely applied. The story involves Anwar El- Abrahimi, an American chemical engineer born in Egypt who is seized on his way back to America from giving a lecture in Egypt. The cause given is that he made phone calls to a known terrorist. No proof is ever given (or needed) that it was Anwar that made the calls, that his phone was never lost of stolen. Meanwhile, Anwar's extremely pregnant wife, Isabella, is back in the states frantically trying to find her husband, who got onto a plane to Chicago but apparently never got off. The flimsy explanation that he was never there evaporates when she discovers that he made an in-flight purchase using his credit card. Lately I have been researching modern Chinese history, particularly that of the astonishingly selfish and brutal dictatorship set up by Mao Tse-tung, and it is more than a little frightening to see the similarities between extraordinary rendition and some of Mao's brutal scare tactics, including his public executions (which the people were forced to watch), and extensive use of torture specifically used to extract \"confessions.\" It is pretty disturbing to notice that Mao specifically did these things to create an environment of fear in order to achieve obedience from the Chinese people. To say that the Bush administration has not created an environment of fear and continues to milk it for everything it's worth would be naïve in the extreme, and although extraordinary rendition was not created under Bush, it is clear that it does more harm than good.Adding to the thickness of the film is Douglas Freeman (Jake Gyllenhaal), who works behind a desk for the CIA and has little field experience, until his boss is assassinated and he suddenly finds himself supervising the torture of a man that he quickly comes to doubt has anything to reveal. Fatima's (Freeman's boss) daughter also plays a pivotal role, as does a senatorial aide played by Peter Sarsgaard, who might have the most satisfying role in the movie. Meryl Streep is also suitably cold and clinical as a chilly senator with a dogmatic support of the necessity and practice of rendition. As a political thriller, the movie is remarkably well-crafted and paced. But the scariest thing about it is that this is all real. The movie's goal is to get people to really think about the things done in America's name, especially when they claim to be done to prevent those same things. Conducting terror in the name of preventing terror will win no sympathy for us, nor will extracting confessions through brutal torture, which is the basest form of criminal investigation. Unfortunately, we are gradually heading in that direction, of doing these things more rather than less. The frightening question is what is the event that is going to take place at some point in the future to convince us to stop and head the other way, toward civilization and peace, or will we just keep heading toward a military dictatorship until we finally get there?","Rendition is a thriller, released in 2007 to mixed reviews. It centres on a CIA analyst who begins to question his assignment after witnessing an unorthodox interrogation at a secret detention facility outside the US. The film is based on the true story of Khalid El-Masri who was mistaken for Khalid Al-Masri.It features a cast of many big names: Jake Gyllenhaal, Reese Witherspoon, Peter Sarsgaard (who spends most of the film looking incredibly similar to Ewan McGregor), Meryl Streep and J.K. Simmons and is directed by Gavin Hood who is also responsible for ruining a fan favourite Marvel character's origins in X-Men Origins: Wolverine. The performances of the above are not that bad and that is the highest compliment I can pay them, however the performance of Omar Metwally who plays the man mistaken for a terrorist is absolutely fantastic; he completely steals the show.Jake Gyllenhaal's character is very two dimensional. I like Gyllenhaal as an actor and when he turns it on he really does turn it on, but here in Rendition something is lacking. His character is poor and nothing can really bring him to life. Witherspoon's character is just irritating from start to finish while Sarsgaard's character seems useless. The heavyweights Simmons and Streep aren't used nearly enough. The character development and characters in general need to be better written and are not well rounded or even that likable.Some of the torture scenes in which Anwar El-Ibrahimi is treated horrifically by the American government are when this film comes into its own. They are very well filmed and recreated and clearly a lot of research went into making those scenes authentic and they do, at times, become very hard to watch because we, as the audience, know that the victim is innocent.My biggest problem with Rendition though is its genre. Thriller. Here's a little piece of advice; you can't call a film a thriller when it isn't even thrilling in the slightest! A thriller, in my opinion, needs to have a mystery, it needs to have shocks and keep the audience on the edge of their seats. Rendition fails to do this majorly. There are parts of the film where it seems as though the director is trying to build up sympathy or the characters or try and give a subtle shock to the audience but it only plants the seeds for a plot twist and the seeds never really come to fruition.When I sat down to watch the film I had read what it was about and was anticipating something very entertaining as I was impressed with the storyline and the cast but as the film grew on (from what was a very boring first half into a mediocre second) I soon came to realise that I was not watching the film I had hoped. Rendition was a let down; an anti-war film that never really takes off.Having read around the film I know that it has its fans but I just can't imagine myself wanting to watch it again.","RENDITION accomplishes a lot in presenting a story that is tough to watch, tougher to believe, and for all that is a tremendously involving and electrifying movie. It is definitely a message film but that message is delivered by a smart script, a compassionate director, and a dream cast.But first the word rendition: according to the dictionary, \"In law, rendition is a \"surrender\" or \"handing over\" of persons or property, particularly from one jurisdiction to another. For criminal suspects, extradition is the most common type of rendition. Rendition can also be seen as the act of handing over, after the request for extradition has taken place.\" For many this may not be news, but for those who are not privy to our Intelligence games, the concept is a terrifying one. For this film Kelley Sane has provided director Gavin Hood with a script that examines the horrors of rendition and in doing so the two have created a story we simply cannot ignore.Anwar El-Ibrahimi (Omar Metwally) is an Egyptian-born American working in South Africa as the film begins: his very pregnant wife Isabella (Reese Witherspoon) awaits his return home but when Anwar doesn't appear at the airport, the enigma begins. Anwar has been taken prisoner in Egypt where he is tortured and interrogated for information by the cruel Abasi Fawal (Yigal Naor) while a reluctant CIA investigator Douglas Freeman (Jake Gyllenhaal) stands by, the two attempting to extract secrets to be provided to the USA: behind the scenes in Washington DC the extraordinary rendition is piloted by Intelligence expert Corrine Whitman (Meryl Streep). Isabella attempts to uncover the truth of her missing husband's whereabouts and involves an old friend (Peter Sarsgaard) to help her. Nothing goes well, not in the US or in Egypt, where the interrogator Abasi discovers the evil that is brewing within his own family. It is Isabella's persistence, Anwar's endurance, and the ultimate heroism of Douglas Freeman that allow the resolution to the nightmare.The cast is uniformly strong, the grim realities of the torture chambers are almost unbearable to watch, and the in-our-face discovery of how our Intelligence system works (especially since 911) is terrifying. Added to the DVD is a short film about two men who talk about personal experiences with 'rendition'. It is a kick in the gut and demands action from the viewer to become an activist in preventing the continuation of these tactics. Grady Harp","Hollywood hired a few good actors (including Meryl Streep, known for her political positioning and agenda) hoping to attract viewers to a propaganda movie against torture procedures used by USA (waterboarding etc). It could have been a good propaganda movie but unfortunately for them the movie is bad so it made less money than it has cost Hollywood to make it. Probably they will make a few Deadpool movies to cover the loses. It is a boring movie with a bad script, bad directing and not worth the time to watch it even if you don't pay for it.","Hi, I will skip passed the 'politics' of this movie, for they we're in it as much as an Alien base exists on the backside of the moon. That is to say, arguably so...Discussing the story and even the premise of the movie, the whole thing falls apart from scratch. Are we honestly to believe that a major player in the terrorism business would walk around, calling people across the globe with a traceable mobile phone? Are we seriously to believe that a 22 or so annalist, after a bombing that made a coworker of his die in his lap, would scratch his head, utter a 'What a day folks' and then take up the job of an observer to a professionally carried out torture, even lending a hand? I didn't...Stupidities aside, the movie was slow, sluggish even, with people staring at each other, waiting sometimes several minutes to mutter a response to the initial bit of script. Acting never convinced me, not even by veteran Meryll Streep or Jake Gyllenhaal (who made me weepy in Donny Darko) who had exactly one scene in which he was actually acting and not sleepwalking around the faxmachine that he used to 'deliver' his lines.The music score did nothing to provide gravitas to the movie and it consisted of maybe 1 or 2 themes which were rewinded time after time, or reshuffled and then put on again providing even more release to even the worst insomniac alive today.I honestly fail to see why people are impressed with such a hackneyed screenplay and story which was as straight forward as they come and yet make some people feel they saw something thought provoking, which is becoming an increasingly annoying term here on IMDb for you will find it even in the reviews of the latest Rambo entry.I wasted what felt like 5 hours with this movie, don't say you weren't warned.5/10"],"review-user":["dutchthea","JuliaGulia967264","lucad_99","Buddy-51","corrosion-2","Jamester","mohamedster","arshadfilms","flechette","DICK STEEL","intelearts","bob-rutzel-1","jemps918","Britney-Keira","Argemaluco","saareman","gundognc","Jay_Exiomo","alexkolokotronis","CountZero313","Anonymous_Maxine","josh_youngbwfc","gradyharp","vrilss","CineCritic2517"],"review-date":["6 November 2007","14 November 2007","21 October 2007","3 November 2007","17 October 2007","8 September 2007","18 September 2008","20 October 2007","18 October 2007","24 October 2007","22 January 2008","11 June 2008","29 October 2007","26 February 2008","8 November 2007","10 September 2007","14 November 2008","25 October 2007","2 March 2008","2 April 2011","12 April 2008","15 June 2012","20 February 2008","8 April 2017","11 February 2008"],"review-rating":["8","9","10","7","10","8","8","10","9","8","6","8","8","9","7","6","1","5","3","5","10","4","9","4","1"],"review-title":[" moving and thought-provoking\n"," Rendition\n"," is it ever, ever right to torture an individual\n"," flawed but important drama\n"," Masterful and Topical\n"," Story that Moves\n"," This could ACTUALLY have happened to me!!!\n"," Perhaps the most important film of the year\n"," This film piles deserved shame on our so-called democracies\n"," A Nutshell Review: Rendition\n"," Not complex enough to justify the theme\n"," Tough one to watch\n"," What 'the greater good' is should not have to be a forced choice our leaders have to take if we each already decide correctly at the source.\n"," You need to be provoked!\n"," Interesting but not too satisfactory\n"," Too many stereotypes, not enough passion to engage the audience\n"," Torture bad. In other shock news Vatican boss suspected of Catholicism, bear defecates in tree rich environment...\n"," Simplified version of a large gray area\n"," Just Not Enough\n"," a sign of the times\n"," A much needed wake-up call?\n"," A Boring Rendition of a Film\n"," Rendition: an unfortunate new word to add to our sense of shame\n"," Anti torture propaganda movie\n"," Utterly contrived...\n"]}