{"review-url":["http://www.imdb.com/title/tt0805435/reviews"],"review-text":["The One is a very aptly name show, mostly because it comes close to being the only network shows on in prime time that barely more than one person is watching.When I first heard of The One, I thought to myself \"Weee!! Another sing-song show! We don't have enough of those!\" and then proceeded to strap on my helmet and run about my home hitting my head on blunt objects and sharp corners. Because in all honesty, the constant, year round pain and suffering inflicted by having only one or two \"talent\" based reality shows running just isn't enough. We needed another one. And not just any one - \"THE\" One. The one with slightly less attractive contestants with slightly less talent. The one with slightly less of a point, though it's hard to imagine a scenario in which that's possible. The one with pointless footage of the contestants when they're not performing included. Because I care what Johnny Sings-a-lot does in his off hours! I really do! Now, you may be thinking \"Hey! On the entire continent of North America less than 4 million people watched the first episode. Doesn't that mean this show sucks?\" Well, to that I say less than 4 million people in North America have syphilis, so sometimes low numbers bring good news now don't they?. Think about it.In the end, The One may be horribly unoriginal, a show that even the airing network couldn't be bothered to promote because they too realize how absolutely worthless it is, but it's still not syphilis! Yay!","No surprise except in how quickly ABC reacted to the dismal ratings. According to published reports (Variety) the show garnered the worst ratings in the history of the ABC television network.And I quote: ABC's music talent competition \"The One\" opened Tuesday night to cancel-me-now ratings.The article went on to say that the show received a \"shockingly low 1.1 rating/3 share in adult 18-49 and 3.08 million viewers overall.\"That makes it the weakest premiere for any reality show on any network and also below all series bows in ABC history.From the first moment I saw the commercials for this I knew it would fail. We don't need another American Idol clone. But ABC should have given this show a fair chance to succeed.","From the weeks and weeks of promotion for this, ABC's \"The One\" was supposed to be \"The Real World\" meets \"American Idol.\" We were to watch these singers perform, compete and see how they lived together in a house as well. The Drama! The Tension! Where does one begin with this atrocity? Let's start with the \"judges\" who were known as \"Music Experts\" on this program. \"Experts\" implies they have expertise. Andre Harrell at least had a pedigree. He was in charge of Motown Records for a time. The other two... eh. Kate Hudson's uncle, who could have been labeled Mr. Weird Beard. He dyed his facial hair three distinctly different florescent colors. I wonder how scary he would have been with a black light! And The Paula Abdul wannabe, who did something I didn't think could happen: she was even more gushing and cloying than Paula! She then over corrected and became harshly critical after the first episode. The farce of \"critiques\" that these three offered was a true joke and an insult, not only to the process of finding the best singer, but to the audience that is now quite savvy, already having done this numerous times on Fox.There was the host. George Stroumboulopoulos was no Ryan Seacrest. In fact, he was as lackluster as can be. He actually sucked what little energy there was in the program, dry. How he got that job was the second biggest mystery of the show.The first was how did they pick the 11 competitors for this program? This was literally a talent-free talent show. OK. Perhaps that's an exaggeration. And granted, the performers all have to be relatively close in ability, because if they were not, there wouldn't be a \"contest.\" If only one person was \"good,\" there would be no \"suspense.\" So, I get that they all needed to be comparable. But they all should have had *some* chops! Additionally, the judges were running a \"Singing Academy,\" so the program was part \"Fame,\" as well. Clearly these performers desperately needed those lessons. But you need some extremely talented people to teach those with little talent to be talented. And that definitely wasn't what was happening here.It seemed in casting the show, the priority was on the \"homelife\" elements, as all of the players were very attractive to look at, in equal parts to how badly they vocalized. But the filmed segments in their house were so chopped and sliced, you couldn't get into the stories that were starting to happen, so the show didn't capture the events there, either.As badly devised as all of that was, \"The One\" had an incredible, unbelievable, fatal design flaw built into the results that made it completely laughable.The audience phoned in their votes for who they liked the best, just like on \"AI.\" But then, after the audience vote was revealed, the bottom three contestants were forced to sing a final song. The \"music experts,\" based on that performance, chose one person from the three to save for the following week. And THEN, the contestants who were safe got to vote for who they wanted to keep from the remaining two, sending the remaining contestant home.The \"design flaw\" was that the contestants had the final say. I mean, if you were in a music competition and you wanted to get as far along the path as you could, would you vote to KEEP the better singer, or would you try to get rid of your toughest rival? Any first season viewer of CBS's \"Survivor\" could answer that one! And that's exactly what happened on the program. The person who had the better potential was lost, and the contestants voted back \"the one\" who had no talent at all! On top of that, the contestant who was just saved from the bottom by the \"experts\" was also allowed to vote against the remaining two! It was a complete farce! Maybe if they let the contestants vote first, at least the \"experts\" would save the better of two evils to finish. But this just confirms how not ready this show was for broadcast, how unsatisfying the whole process was to view and how misguided the producers were in attempting it.","I was very disappointed when this show was canceled. Although i can not vote. I live on the island of Aruba. I sat down to see the show on tuesday. And was very surprised that it didn't aired. The next day i read on the internet that it was canceled.It's true not every one was as much talented as the other. But there were very talented people singing.I find it very sad for them.That they worked so hard and there dreams came tumbling down.Its a pityAriette Croes","I was really beginning to enjoy this show. It just started out slow and it wasn't given the chance it deserved. It is summertime so many people are not at home watching television. I know there are a few talent and singing competitions but I enjoy them as do many other. believe it or not when American idol is done for the year I miss it. Even though this was not American idol I thought it had potential. I feel bad for the singers on the show who wee really starting to grow on me. I wish they would reconsider and put the show back on. I think it was a hasty move to cancel. My only complaint about the show is I did not care to much for the judges.","I loved this show. Such talent; and I am so disappointed that it is canceled, after only just beginning. I looked forward to this show all week long. And so sorry for the people who were hoping to be The One. I would have loved to see who would have won. It just began, and in my opinion,it should not have been canceled. I hope these young artist have been viewed by talent scouts, and have the opportunity to reach their goals. I voted, and sat waiting for it to come on; never knowing that it was canceled. And I could not believe that it was. I am amazed that it had low ratings; because it was in my opinion one of the best reality shows on TV."],"review-user":["fortey","mikelancasterghs","DeanNYC","ariettecroes","pcapra05","Sandraleealex"],"review-date":["21 July 2006","30 July 2006","21 February 2007","3 August 2006","4 August 2006","1 August 2006"],"review-rating":["1","1","1","8","7","10"],"review-title":[" Saints be praised, we're saved!\n"," Cancelled after one airing?\n"," The (N)One.\n"," A good show\n"," To soon to cancel!!!!!!!\n"," An excellent show, and wonderful talent\n"]}