{"review-url":["http://www.imdb.com/title/tt0858437/reviews"],"review-text":["***May contain spoilers***I had very high expectations for this film, based on the trailer. I knew a bit about the real Ed Gein, so I figured this was a medium-budget Hollywood version of the real events. Man was I wrong.First, the writing apparently came from an eight-grader who barely knew anything about Ed's history and cranked out the script in about 20 minutes. The movie completely passes over the most interesting facets of Ed and his relationship with his mother (not to mention what the real police found in his house) and decides to focus primarily on the young deputy who looks like he just wandered onto the set. Likewise, all of the male characters seem to be ad-libbing their dialog throughout the entire movie. I'm not exaggerating.Don't even get me started with the historical goofs in this movie. Seriously, who the hell directed this? This movie is supposed to take place around 1957, but the cops are carrying modern side-handled batons, some of the stuff in the hardware store look like they came from Lowes, and when the cop gets to a payphone he dials 9-1-1 (didn't exist back then). Also, Ed was a small guy, scary like Anthony Perkins' character in Psycho (who was supposedly based on real-life Ed), not this burly dude who ended up looking way too much like the bad guy in Men In Black.Another thing that really bugged me was the appearance that the makers of this film shot the whole thing in an abandoned, 3 building set. Because of the \"clever\" camera angles, you never see any actual town, and the interior of the sets looked like old, long-abandoned shacks. Pop a cash register on a saw-horse and bam!--instant hardware store.I'm usually pretty forgiving of low-budget horror films, but this one just begs for it. All you had to do was include most of the real events (even embellish them!), pay five good actors instead of 15 crappy ones, and for Pete's sake take 5 minutes and think about the time period once in a while. My advice: Google Ed Gein, you'll be far more entertained.","I was interested in seeing this film, because I was hoping to see a reenactment of the actual story that inspired so many of the all time classic horror movies, but what we got was a low budget spin on the acts of Ed Gein, not the story of Ed Gein. Kane is a large presence, but Ed wasn't. He flew bellow the radar because he was quiet, slow, and unnoticed, yet this movie shows him as a bully? I also wanted to know why they stuck Michael Berryman's character in the movie? Ed Gein didn't have help digging up body's, and the truth would have been much more twisted then the fictional situation. It may be a silly observation, but we know that the Gein house was basically a rats nest, and only the room his mother lived in was clean, yet there's an early scene where Ed's in the hall, and the carpet looked like it had never been left longer then an hour, without cleaning. I didn't hate the movie, but it was just another spin on a true serial killer, yet somehow they decided the truth wasn't as good as the fiction? It's worth a watch, but not if you want a true account of the gruesome truth of Ed Geins rampage.","In Ed Gein : The Butcher of Plainfield the horror icon Kane Hodder takes the role of one of the most infamous serial killers in American history. A man who is the basis for such legendary cinema madmen as Norman Bates, Buffalo Bill, and let's not forget Leatherface. Gein a real life serial killer who went on a brutal wave of violence in the 1950's when police officers searched his home and found the following items. Human skulls mounted on his bed posts, various things made out of human skin such as lampshades, clothing, and a chair, also in the home police were shocked to find a box of preserved vulvas that Ed admitted to wearing.I was scrolling through netflix instaview and noticed this little gem, being a huge TCM fan I try to watch every Ed Gein related media I can get my hands on. And as a bonus this one just happens to star the great Kane Hodder of Jason Vorhees and other horror fame. I've heard a lot of complaints about this film not following the facts. And for you who feel this way and think that is reason enough to dub this a bad movie I'd love an example of a based on a true story movie that follows the real life account fact to fact not changing one detail for the sake of making it cinema friendly.Now with that said and out of the way I enjoyed this film from start to end it reminded me of my childhood and how much fun the 80's slasher genre was. If this film would of been released in that era instead of 2007 it would of seen a theatre release it would also of been a great drive in movie experience. While it does nothing new for the genre it does do a good job at sticking to the old' classic slasher formula of extreme violence and over the top blood and gore delivered in a fashion that can only be described as brutal and unforgiving. The makeup effects in this movie are beautiful a true symphony of screams and blood soaked bodies.The story may not be 100% accurate but that's no reason to over look this movie. If this film would of had a title that had nothing to do with Ed Gein a lot of the people belittling it due to this fact would probably watched it and came away loving it especially fans of the Friday the 13th series and children of the 80's splatter generation. If you can find a copy of this I recommend you give it a shot and once again for all you Netflix subscribers out there you've nothing to lose as it is currently available for instaviewing I have a feeling it will feel familiar and comfortable for all you long time horror fiends.7/10","There are many reasons I'm not a fan of fact based films, but more than any other is how the filmmakers give themselves creative license over the story. If they have such great imaginations then why not use that talent to make something original? Otherwise stick to the facts. This could have been an okay movie if only they had done just that. Ed Gein was an insanely frightening human being. It's been said if you were to take Michael Myers, Jason Voorhees and Leatherface, wrap them into one person, Ed Gein would still be sicker/scarier. So why can't someone make a movie about him that can convey this? When will they figure out that reality is ultimately scarier than fiction? I've read books and watched news programs about him and, now I'm not a screenwriter or anything, but I believe there's enough documentation on Gein that it shouldn't take a whole lot to write a story about all these atrocities he committed without creating murders that had never even been documented. I'm aware that he was only found guilty of 2 murders but with all the evidence found in his home and barn there should have been plenty of other ways to put this film together rather than using the deputy's relationship with his Mother, and girlfriend as filler, and far too much of it.I guess what I'm wondering is this... why at the end of the movie did I know more about the supporting characters than I did about Ed Gein? Why didn't we get to know his Mother, Father and brother and the relationships between them... what made him the psychopath he was... what abuse he endured as a child that may have contributed to the man he became? Instead, the only thing we got of his childhood were flashes of him as a little boy... running.In the end I give it 4/10 stars. Thats 2 for the gore and 2 for Kane Hodder. Even though it was kind of bad casting in my opinion, considering Gein was a smallish man, and possibly effeminate and Hodder is anything but small and nowhere near what I would consider feminine. Maybe I was just excited because he was Jason Voorhees.","I stopped watching this film half way through. It was just terrible! Boring, contrived subplots. A complete lack of the pathos seen in Norman Bates, Buffalo Bill, or Steve Railsback's portrayal of Ed Gein. A movie doesn't have to be historically accurate, but the true story of Ed Gein is so much more interesting than this third-rate melodrama that was completely made up for no good reason! Ed Gein as portrayed by Kane Hodder is a cartoon sadist. The attempts to show the trauma inflicted on him by his mother are just weak exercises in recycled style. And this movie wanted to be stylish, but it even screwed that up. Fortunately, there is a better film of this story. 2001's Ed Gein told the story efficiently, and offered a few real chills as we watched a sick man not in control of himself. Steve Railsback, who played Ed Gein that time, was already famous for memorably portraying another famous serial killer: Charles Manson. His Ed had pathos. His film is the one to see. Avoid this mess.","I have watched this movie quite bemused. I am not sure whether it was attempting to be a horror gore fest in a Rob Zombie type affair or an exploration of real events.In either case it missed its mark. It's not particularly historically accurate with characters being chopped and changed for the sake of the story. The performances were neither compelling nor bad.For me, I would have preferred a more psychological approach and this film could easily have gone down this route without spoiling the overall effect.","With a catchy title like the Butcher of Plainfield this Ed Gein variation and Kane Hodder playing him will no doubt fly off the shelves for a couple of weeks.Most viewers will be bored silly with this latest take on the life of Ed Gien.The movie focuses on Ed's rampage and gives us a(few)glimpses into his Psycosis and dwelling in Plainfeild.Its these scenes that give the movie a much needed jolt.What ruins this is the constant focus on other characters lives and focuses less on Eds.Big mistake here.Kane Hodder is a strange choice to play Gein,but He does pull it off quite well,and deserves more acting credits than he gets these days.Prascilla Barnes and Micahel Barryman also show up.3/10","This movie was really bad. First they didn't even follow the facts for it. Half of the movie was made up and it was more about the deputy whose mother was one of Ed Gein's victims. The acting was horrible, except for the guy playing Ed Gein, but its not hard to mess up playing a weird guy. though i think it was horrible i gave it a three because they started it off with actual crime photos. that was the best part of the movie. As soon as the introduction of the movie was finished the movie went downhill. The writer of this movie tried to spice it up, but it didn't need to be. The story of Ed Gein is interesting enough without falsifying information.","What a waste of time to watch this movie. Poor picture quality, poor sound, poor acting and definitely not based on actual facts. The deputy's \"girlfriend\" did so much overacting, as did the sheriff, that it was more comedy than horror. The deputy tries to make an emergency phone call by dialing 911...PROBLEM...in 1957 that emergency number was not in existence. That is just one example of glaring inconsistencies.The \"scary\" aspect was way underdone. Just did not come across as horrific.I did think that the actor playing Gein did the most admirable acting job in the whole movie. I could well see mental disturbances in his character portrayal.Sorry...this one just does NOT get it!!","This was, without a doubt, the worse horror movie I have ever seen.... Forget the fact that the story had little to do with the facts of Ed Gein... Ed Gein's story is horrific & this movie ignored the facts and strayed way off course. Acting, on all levels, was pathetic. Story, again, for some unknown reason didn't go into the horrific facts. Could have been so scary if it would have stuck to the facts. WHAT WERE THEY THINKING? TERRIBLE MOVIE! Steve Railsback version was much, much better. Don't waste a penny on this terribly made flick... And, why ignore the reality of the horrific events? That alone would make for a great story. Man, makes you wonder why this would ever be approved for release. Why spend so much money on a movie that will never make a penny (except for my wasted $5...","OK, why complain about this movie? It's fiction. Deal with it. If you want to see the biography, go watch it. This is an original, fictionalized version of what happened in Wisconsin. People who are obsessed will complain about this, as they do every other deviation of the facts. Sad but true. I think making Kane Hodder the man in which the film is named after was a great idea. I thought it wasn't so good at first, I'll be honest. But that just made it even scarier. If you like Kane Hodder, Ed Gein or movies based on real events, I think this is a good movie. But if you're obsessed (like some other people) stay away from this movie and all others.","Inaccurately detailed account of the effect Ed Gein had on the lives of Plainfield, Wisconsin, following the burdened sheriff's department and, in particular, the new deputy whose life would change forever when the psycho kidnaps/brutalizes his mother.While Kane Hodder proves that he can be even more menacing without make-up as a serial killer, he doesn't look at all like the Ed Gein we have read about, and seen photographs of. Director Michael Feifer's camera always keeps the actors closed in tight, perhaps a sign that he didn't have enough budget to fortify a realistic county. I felt a bit claustrophobic with this style, hoping that we could see more of the rural trappings within where Gein moved freely, creeping locals who were seemingly unaware that he could be some serial killer kidnapping folks. But, the camera only gives you so much, so you are forced to look at the faces of the characters up close, so the cast had to be up for the challenge. Unlike other users who have commented rather badly about the cast, I never found any of the actors unconvincing. I agree that the film's direction geared more towards the deputy's relationship with the sheriff's daughter and his beloved unflappable mother, may be a mistake because the title is \"Ed Gein\", not \"Days of the Lives of Plainfield's Deputy out to find Ed Gein\". The screenplay and film's execution clearly set up the fact that deputy Bobby Mason's(Shawn Hoffman)mother and girlfriend would be targets of Gein. Priscilla Barnes easily has a handle on Bobby's mother, Vera, making her a concerned and proud parent of her boy. Adrienne Frantz is Erica, Bobby's girlfriend, a pretty little chick whose doomed to be the final girl, who is badly hurt in a car crash when her man drives haphazardly down a dirt road after finding out Vera went missing. The film shows brief glimpses into Ed's psyche, with his mother barking orders reaffirming to the viewer that his childhood was a difficult one that has warped this man. We also see Ed in his barn carrying out gruesome deeds on a trapped victim, a kind waitress who is tied to a table, kept sedated as he removes her limbs. He eventually creates a costume from her flesh. As an Ed Gein film, it doesn't hold up I'm afraid. Researching the back story, it seems the filmmakers took liberties to craft their own tale of a lurking psycho always seeking fresh victims. This interpretation, unlike two previous films(\"Deranged\" & \"Ed Gein\")stays away from elaborating what drove Ed to commit his deeds, using only images of an angered mother and voices driving him over the edge into rage and sadness. Another major problem is that Ed Gein isn't supposed to look like a scary, hulking menace and Hodder's character would be the first suspect in an investigation for missing and dead people. And, I'm hard-pressed to believe the real Ed Gein could suffocate a caretaker with his arm, snap his neck after underpinning his head between two trees, before smashing his skull with a log. I think, though, that Hodder, judging from this film, could be utilized in slasher films without wearing heavy make-up, because he has a sinister presence that can be a real asset if you are wanting an effective psycho. Unlike other films on Ed Gein, which infuse bits of twisted black humor, this particular tale is completely dark. Ed Gein never seems anything but an imposing figure on the edge of snapping at a moment's notice.","Did we really need another movie-version of the life and crimes of Wisconsin serial killer Ed Gein? No, of course we didn't, but clever producers realize there's always room for one more, especially because all horror movie fans agree that Ed Gein simply is one of the most  perhaps THE most  fascinating sick individuals in history. And the producers of this movie were even extra clever, as they managed to cast no less than Kane Hodder in the titular role. Hodder is already a bit of a horror legend on himself (depicting Jason Vorhees multiple times in the \"Friday the 13th series\") and his name alone is guaranteed to attract even more viewers. I've lost count of how many movies  both fictional and non fictional  there already are closely inspired or loosely inspired by Ed Gein. There are the strictly factual and almost biographical ones, like \"In the Light of the Moon\" and \"Deranged: Confessions of a Serial Necrophile\", but of course the most commonly known horror classics simply used little morbid characteristics of Gein's utterly demented persona, like \"Psycho\", \"The Texas Chainsaw Massacre\", \"Motel Hell\", \"House of 1.000 Corpses\" and \"The Silence of the Lambs\". As you can probably derive from its juicy title as well as from the DVD cover art, this particular isn't too concerned with accuracy and merely just sets out to shock and provoke its viewers with a whole lot of gruesome images and perverted insinuations. It feels as if director Michael Feifer wants to make us believe his film version is truthful, but repeatedly \"forgets\" about the facts in favor of sheer horror movie excitement. Kane Hodder portrays Ed Gein like he was a muscularly shaped and relentlessly unstoppable killing machine, whereas in reality he was a scrawny and miserably timid guy whose horrendous psychopathic tendencies only gradually come to the surface after his arrest. Although Gein only ever got charged with two murders he commits nearly a dozen of vile kills here, so you know you don't have to check out this film for its informative value. Still I don't want to bash this straight-to-video production entirely, because there really are a handful of positive things to say as well. The make-up effects are effectively nauseating and the Californian filming locations were aptly chosen in order to recreate the depressing 50's Wisconsin atmosphere. And in spite of his unfit posture, Kane Hodder isn't such a bad choice to depict Ed Gein. He hardly has lines to speak but looks menacing throughout the entire playtime.","Only reason to see this very loose retelling of the Ed Gein story is to watch the former Jason Vorhees in action. He is big, scary-looking at times and quick to kill. The rest of the movie is the purest junk, although it is moody due to the almost constant low-light shooting. The story line bears little resemblance to the actual Gein case, but I didn't even mind that until the damsel-in-distress finale. Gein was caught red-handed, but I doubt he was making off with a pretty young thang, very much alive, when they finally caught up with him. Talk about beauty and the beast! Badly acted and written, but it is nice to know Kane Hodder is still working. Bring back the real Jason Vorhees!","Ed Gein, one of the most famous serial killers of all time, he was the inspiration for famous movie killers like Norman Bates, Leatherface, and Buffalo Bill. He is also one of the most sick and disturbing killers of all time, I watched a documentary on him, so I know his story pretty well. When I saw this, I was curious because I thought it was supposed to be like a documentary re-enactment, but I have to say that this was just a pathetic waste of time. First off, the facts are completely wrong, with a few minor exceptions, and secondly, this was just a stupid Hollywood story when these horrific murders really happened and they just made it into a cheap buck. Not to mention that if they were going to make it into a horror movie, this was poorly acted! Ed Gein, he lives in a small town in Wisconsin called Plainfield, but he has a little secret that the whole town is being effected by, he digs up dead bodies, as well as brutally murdering people. Bobby, a deputy, is on the case to get Ed Gein, only, no one knows who the killer is at first, just finding crime scene after crime scene. But things get \"personal\" when Ed starts messing with the policemen's family and friends.Of course this movie was just ridicules and completely insulting to the true story. I always thought that bad acting is a necessary tool to a horror flick, but for this story, it should have been a better acted film, not to mention, it should have been more of a documentary than a stupid cliché'd horror film. Please, stay away from this film, it's completely pathetic and untrue to the story of Ed Gein.1/10","Finally!!! A good movie made on the most demented serial killer in history. For those less familiar with Ed Gein, he was basically the madman who was known for grave robbing and skinning his victims (which most horror fans ripped off). Shot in a period style that reflects the bleak plains of Wisconsin perfectly, this is easily the most atmospheric horror film yet to depict Gein and his gruesome killings. Kane Hodder (Jason from Friday the 13th series) and Michael Berryman (Hills have Eyes I & II), deliver chilling performances in this serial killer opus that easily leaves behind the lackluster former Gein attempts. So far I'd say this is one of the better horror films released this year (Turistas = 0).","PLEASE people! DO NOT bother with this poorly directed joke. The direction was totally wrong from the outset. Where is the history of his mothers' emotional interference and the general madness in the original family? Why is ED portrayed as this large, overbearing imposing figure full of anger and hate? What IS this crap? The writer and director obviously did no research into the history and just wanted to cash in on the infamous Gein name. The fools who made this movie took so many liberties with the truth, it's ridiculous. If you want t see a brilliant Gein film. go back to the minor classic \"Deranged\" to see how Ed really was. There is humor in that film, and Ed is portrayed as more of the sad, lonely slight man he was, according-to HISTORY. Where is the background story here? There is just poorly set-up shocks (that are not shocking) that we've seen before, and more accomplished as well. Take the worst Texas Chainsaw massacre ripoff, and add this one to that list. Had to give it ONE out of ten because rating wouldn't accept ZERO. I want my money BACK. If anyone regards this film as 'stunning' is possibly getting a financial kickback to do so.","Ever since he played a goon in Lone Wolf McQuade, actor/stuntman Kane Hodder has been busy. His film, Hatchet, got all the publicity last year, but he still makes a couple of more films every year. He should have skipped this one.Hodder seems to be the king of the slashers. he has played Jason Voorhees from 1988's Friday the 13th Part VII: The New Blood (1988) to Jason X (2001). He is working on a new film that appears to be a Halloween remake. He is very much what I would call the serial killer type with his methodical, expressionless thirst for blood.However, there wasn't much blood in this movie and very little action occurred on camera. It felt as if I was watching an episode of real law enforcement on A&E.I won't put the blame entirely on Hodder's shoulders, as the rest of the actors didn't contribute much either.Michael Berryman (The Hills Have Eyes, The Devil's Rejects) just ran his mouth until Gein shut him up. Adrienne Frantz (\"The Bold and the Beautiful\") was cute. Veteran actress (\"Three's Company\") and Penthouse Pet, Priscilla Barnes did a credible job. I am sure there are other horror favorites, but they all just seemed to run through their roles.","I am a big fan of horror movies, and know a lot of info on serial killers. Obviously the director of this one refused to research the film he was creating, because half of the movie was fictional. More than that, the character of Ed Gein was portrayed in the wrong light. I did not rent the movie to worry about the Deputy and his girlfriend Erica. I rented it to watch Ed Gein and his legendary story. This movie was awful, the only reason I gave it a 2 out of 10 is because the gore wasn't too bad. Acting= horrible Actors= sub par Movie= waste of time.A big upset all around, but i wont give up my search for a good horror movie.","I have done some research on Ed Gien, and I have found a few interesting things. Like the fact that Ed Gien, was quiet and a loner, not some buff over bearing jerk as in this movie. I will say that I didn't finish this movie but I will. I will cringe through the fact that all of us, Wisconsinites, talk like we are from Kentucy. You know the funny, but oh so sad factor in this movie, is Wisconsin isn't as hot as they made it look.This movie is not only an insult to Wisconsin people, being a Wisconsite myself, but it is a complete insult to a man that was proved to be an insane, lonely man. He killed two people and the movie couldn't even get that right. Ed didn't get that close and personal and scare people, he shot the two and only people, he killed. So, why do these movies lie and say \"BASED ON A TRUE STORY\"? This is not based on nothing but the lies the director came up with in his foul head.A joke and nothing more!OK, I would like to add on to this. I did finish this oh so sad movie, and I personal would like to laugh at the director. Do your homework when making a movie. I would like to inform you that there are no Mountains (for those who have never been in Wisconsin) and oh THERE IS NO DESERT! What the hell, there was more pine trees and snow in Ravenous and that was suppose to be shot in Californa. OK, for those who know nothing about Ed Gein, I would like to give you, your history lesson. Ed Gein was thought to have killed his family, but it was never proved. He killed a bartender, she was shot at bar close when no one was around. He took the DEAD bartender back to his house. 10 years later he SHOT and killed the store clerk, he stoled the cash register and the store truck. He was caught because of this murder, he came in the day before when her son was there and asked about antifreeze. The day he killed her, he was in there buying the antifreeze, and the reciept that only had antif..... was the only evidence they had to start a world wide man hunt. He robbed graves, in fact in robbed 56 graves. He hate the people he dug up and he made furinture; lamp shades, couches, chairs, and other things. He had a family that he had dinner with once and awhile and they threw all the meat he ever gave them out when he was caught, considering he was caught at their house. He was arrested and hid in the back of a cop car, in fear of what may happen to him. How do I know all of this? I read the book the judge that tried him wrote. After this movie was over, after watching the whole horrific thing, not only am I offended by the directors horriable view on what Wisconsin women look like. I mean it was hard to tell who this guy had on the slab half the time, you know cause Wisconsin women are all BLONDES. Please! I am overly offended by the lack of homework this guy did and the poor job he did making this movie. I have no idea who this Kane guy is and I think he may be OK in something else, but he did a horrible job playing Ed Gein. After all of this I am so sad I wasted the 3.99 on the movie. Movie after finished was completely untrue, this movie is like me saying that the world is flat and George Washington wasn't our first president. Come on people, that is your history, and this is Wisconsin's history. To end this rant, how would all of you feel if I made a movie and George Washington looked like Brad Pitt (some of you may think that is fine, but it would be not true) and he lived and wasn't the president and whatever. You can't rewrite history.","Old Ed was active back in the late 1950's He was apprehended 16 November 1957. The PR-24 Police Baton was invented in 1974. Yet the cops in the movie are all carrying the PR 24. Back then it would have been a standard \"billy club\" not the side handled PR 24. Sheeze, if you are gonna make movies do your research and get it right. Also it makes no mention of Ed's usage of the bodies. He tanned most of the skins and made various articles including a lampshade, a belt and several masks. He also had a large selection of \"shrunken heads\" that several local children knew about as he often babysat for them. He was found incompetent and committed to the Central State Hospital for the criminally insane.","I'd already read the reviews and board posts so I went into this movie knowing just two things: it had a bad title and Kane Hodder was the main character.Let's do the latter first. Kane Hodder really can act right down to realistic crying with tears. I thought he was especially menacing when doing mad-with-frustration. And maybe it's because I'm a Boomer, but I do believe Hodder gets hotter by the year, and I'm thrilled to see him in this role.Now about that title ... can a movie be renamed? It's a decent movie if you aren't in immediate need of fast-action cuts and head-to-toe gore, though there is plenty of that. I get that this is \"in the same universe\" as Ed Gein, but that doesn't make it an Ed Gein movie. It should have been presented as an alternate universe and \"what if\" fiction.If you can keep yourself planted in a fiction frame of mind, and you like slasher (kinda) movies then you might want to see this flick.Stars lost due to stupidity in title and false story presentation.","\"Inspired by a true story...\" my hind end. This farce resembled the true story of Ed Gein in only the most remote sense. He was not a hulking, maniacal brute, as portrayed by Kane Hodder in this film. \"Coincidentally\", Mr. Hodder is one of the actors credited with portraying Jason Voorheis in several of the \"Friday the 13th\" films. In reality, Gein was a mousy little man who barely stood 5' 3\" and didn't weigh 135 pounds sopping wet and with a brick in each pocket. This doesn't mean that he wasn't sick, and that he didn't kill people, but he didn't hold nubile young beauties hostage so that he could torture them. While he did possess a good number of ghastly trophies, most of these were acquired by the robbing of graves, and not by wanton, wholesale butchery.This is a story that could have been told in a compelling fashion without radically transforming Gein into a Jason Voorheis clone. Actor Steve Railsback, who also portrays Gein in another movie, much more closely resembles the actual murderer.Ed Gein, and the acts that he committed, where gruesome and horrifying enough without this kind of cheesy, flagrant embellishment. It's as if the film makers were saying that the atrocities committed by Gein weren't enough... that they could use with a bit of spicing up. If I could give this miserable excuse for celluloid excrement half a star, I would, and that would be generous.","I agree with the first reviewer. The real Ed Gein was nothing like the one depicted in this movie. In the first place, the real Ed Gein was NOT aggressive. He was a shy, quiet man. The guy in this movie got mad real easy and when he got mad, he LUNGED at people. There was a scene where he went to the graveyard to dig up a body and the night watchman was there. All it took was a couple of lines and Ed got mad and killed him. That did NOT happen in real life. There are a lot of serial killer movies being made these days and quite frankly, NONE of them are accurate. Either the makers of the movie are lazy and don't research the real story enough, or they are calling themselves \"spicing up\" the movie for interest purposes. Whatever the reason, they just kill the story by adding a bunch of made up stuff. I think the worst one i've seen to date was the BTK Killer by Uli Lommel. Man talk about a waste of celluloid. That movie was so bad i will deliberately AVOID any Uli Lommel movies in the future.","What a surprise... Given Lions Gate Studios key art on the poster, as well as their marketing and publicity, one would think \"ED GEIN: The Butcher of Plainfield\" would be just another horror film, but Writer/Director Michael Feifer creates a riveting true-life story with the help of a brilliant, subtle performance by Shawn Hoffman (as \"Bobby Mason\") and a solid, riveting turn by Kane Hodder (as \"Ed Gein\").Normally, a direct to DVD film just doesn't measure up, but Shawn Hoffman's scene in the farm brought me to tears -- if this wasn't a smaller film, people would be talking about an Academy Award for this kind of performance... Not to many male actors can bring real tears multiple times in one film.And when Kane Hodder shows the sensitive side of this monstrous Ed Gein, you can't help but feel it's real.Caia Coley and Pricella Barnes truly shine in their supporting roles, believable and powerful, understated yet memorable.Auteur Michael Feifer has created another world yet captured the true-to-life disturbing horror that was Ed Gein's life.Watch this film and you'll see what great work is being done by the up-and- comers of today.Top Movie ReviewsTopMovieReview@yahoo.com"],"review-user":["nickdose","causeiwantto2001","xpunk_rock_poetx","Evil-Dead-Girl","happyreflex","ssoppy","argentobuff","j-w-price","shay204","jwindsor-6","leatherfacefan1","Scarecrow-88","Coventry","ctomvelu-1","Smells_Like_Cheese","malik_la213","rcb_bettcher","lastliberal","KanKeller","thepeck79","ncharleybear","spoken","tmccull52","jonm11100","topmoviereview"],"review-date":["20 May 2007","10 July 2007","29 May 2010","9 April 2007","2 April 2007","3 June 2007","3 March 2007","1 May 2007","4 April 2007","12 March 2007","9 June 2007","29 June 2008","6 December 2008","11 November 2008","5 June 2007","28 March 2007","14 March 2007","25 January 2008","4 May 2007","29 April 2007","22 November 2008","19 August 2013","1 March 2013","7 August 2008","11 March 2007"],"review-rating":["2","6","7","4","2","4","3","3","1","1","7","5","5","5","1","9","1","4","2","1","1","5","1","10"],"review-title":[" Don't waste your money\n"," Why create a story when the real thing is much more gruesome?\n"," Fun Gore Filled Slasher\n"," Not Horrible... But Not Entirely Factual\n"," It's just awful!\n"," Gein and best forgotten\n"," Hodder engages,the rest of the movie doesn't.\n"," this movie was bad\n"," Not worth the money it took to produce\n"," My Take\n"," Good fictionalized version of a true story!\n"," Ed Gein-The Butcher of Plainfield\n"," Ed Gein: America's favorite and inexhaustible source for horror!\n"," Kane Kane baby\n"," The Only Thing That Was Butchered Was The Story\n"," Do not miss this one!!!\n"," insults the true story\n"," A documentary would probably be more interesting.\n"," Not what its cracked up to be\n"," What on Earth?\n"," Another super blooper\n"," Decent movie, Lousy title, Kane Hodder gets hotter\n"," Is it Jason Gein, or Ed Voorheis?\n"," Cool is the rule but...sometimes BAD is BAD\n"," Ed Gein - A Surprisingly Stunning Film\n"]}