{"review-url":["http://www.imdb.com/title/tt0840359/reviews"],"review-text":["I think its safe to say that if you only really watch box office standard films or any premium production don't bother with this film as you will hate it. If you are an overly critical film buff don't bother either. If you love science fiction films and don't care what capacity you get a glimpse of the future in then you'll be mildly entertained. It is very obvious that the budget for this was super super low but what they have done with the money is worth a pat on the back. Some of the burning fire scenes were pretty bad and the evacuation scenes were terrible but it is quite obvious that they had some good support from a computer perspective as the planet scenes and the alien images were quite inventive. The dialog is down right hilarious but acting not altogether poor. As for the story well, I'm not too sure what actually happened at all to tell you the truth.","It is OK movie if it would be done by high school kids for their friends. It is way below limits be called \"professional\". There isn't plot, no actors' play and visual looks like you see it through the plastic film. I was so glad that I have FF button on my remote, 32x worked really well. I understand that everyone need to start somewhere, but it shouldn't be reason to bring it to the public. If you have concerns about quality and budget - \"Open water\" was made on $60000 and more than half went to the guy who provided the security in the ocean and trained sharks. And that movie looks 100 times more professional and it was an event in the indy film-making.","This movie is proof you can't just go to a Redbox and read descriptions of films and pick one and give it a try.While I'll give 'em great credit for having produced a film with halfway-decent special effects on such a low budget, and at least a halfway decent script and story line... unfortunately, it was only just that: halfway decent.If you like movies where things aren't all neatly wrapped up, and don't mind low-budget effects, you might like this film. Honestly, it wasn't really my cup of tea. I should've just gone to bed rather than spend my time watching.For a better science-fiction movie produced on an even LOWER budget (!) have a look at \"Primer.\"","I'D BUY THAT FOR A DOLLAR!!!I did buy this film for a dollar and I've seen much worse for much more!!This is a Scottish sci-fi film from Mark Stirton and according to the Making of (hysterical by the way) the production only cost $8000. Eight grand!!! That wouldn't pay for half a minute in Hollywood!! Nevertheless ---- This is top fun film making. If you like things gritty then you're in for a treat. These are some rough character with rough voices and harsh swearing. I didn't mind, but my girl friend did!! The actors do a fine job and it's interesting to see people that I've never heard of or seen before. It meant I had no idea who was going to die first.If you watch a movie for it's 'latest of the latest' visual effects then watch a Star Wars. The effects here are OK, but kinda weak in space. But the monsters are very well done if a bit pred like.Stirton does an amazing job with not very much and I'd love to see his take on a real Hollywood movie. It least it wasn't predictable and I almost fell off my chair when one dude got his head blown off!!! OK, so it is a little derivative of other sci-fi, but for this budget it is an amazing attempt and anyone who thinks making a sci-fi film for 8 g's is easy or happens a lot clearly knows nothing about the film industry.Good marks for a good film, extra marks for working so hard, extra extra marks for a really interesting Making of. No standard bull here, all the problems of production are gone into making it like Lost in Mancha only with a film at the end. But why no commentary? KEEP GOING SCOTS!","WOW!! Talk about a film that divides the audience! This is a real love it or loath it kinda movie. Personally I really enjoyed it. I noticed that other reviews are comparing it to Pitch Black - this is kinda dumb as the only thing they have in common is SAND! People can be real stupid. No, this film is far more in common with The Thing (how people fail to notice is amazing - they even have the same basic music) Lots of Carpenter touches are there, blue collar heroes, sharp humor, endless rolling landscapes full of death and things not understood. Perhaps what stops this film being a real classic is it's deference to other Carpenter works. Not least Dark Star which it has something in common with. I'd be interested to know how much it REALLY cost? $8000? Is that even possible? Maybe it was based on a short film that cost $8000? But I did find myself strangely moved when the various space dudes died. They are so underplayed that it's like watching a documentary at times. Having said that the script is kinda clunky and only about half of them can act however and I'm not sure the big guy playing the Captain is one of them. But his gun is AWESOME!! Give it a chance, if you like early Carpenter you might fall for it, just don't expect 2001.","OK, so maybe it's because I'm from the North East of Scotland and I talk just like the guys in this film, but I found this great fun. Cheap fun to be sure, but plenty of effort has gone into making the film look great and the actors certainly give it all. I was actually quite effected when they died. In particulare when the Captain finally fell. The script? Well it;s a game of 2 halfs. The opening half of the film is well written and sharp. The last half hour is not so great, with many questions left unanswered. This will doubtless annoy others as it annoyed me. But nevertheless, good fun and a very smart first feature from Sturton.","\"The Planet\" is an astounding piece of film making. For a mere £8000 Stirton Production have turned out one of the most original sci-fi films for a long time.Starring the physically intimidating Mike Mitchell, the film is a mix of great special effects, strong storytelling and well planned action. From the opening space battle, to the pounding finale, everything about this film appears well above it's budget.To start with the special effects, while certainly not \"Revenge Of The Sith\" standard, they are on level, if not above, the likes of Babylon 5 and Farscape. And for a snip of a price as well. The detail and the movement is superb, and captures the imagination from the off. The design of everything, ships, weapons, entities is second to none. The imagination and creativity involved is a real surprise for a film of this budget.Another surprise was the strength of the story, and the arc it takes. There are a few twists and turn, most of which are well written into the script, surprising and well played out. I was surprised that, two years in the making and first imagined 15 years ago, how relevant some aspects of the story are to today's society. With the happenings around the world, there may be a certain resonance with the lengths the mercenaries are forced to go to in order to survive.Even the sounds effects are spot on, as is the atmospheric music. The use of light and costume add further to the professional look. Balmedie Beach in Aberdeen looks a desolate and lonely place.In all honesty this film looks 10, if not 100, times the budget spent, and that's testament to a creative, hard working team of people, from the director, to the cast, to the effects via the producer and sound team. Wonderful effort, I recommend you get your hand on a copy ASAP","I was trying to work out why I enjoyed this film?? Its not because of money spent on it that's for sure!! Did I see a painted water pistol in there? Maybe they don't have the same sort of visual effects houses in the Scotland? Or maybe they just didn't have any money? The making of clearly shows a gang of very plucky guys making a movie against the odds. Awesome! But what I really liked was the grit of the performances. Mike Michell and Patrick White play the lead parts like 2 normal guys. No Hollywood histrionics here.OK, so the effects work isn't very good. The spaceships just don't look as good as they should in todays FX world and I've seen much better free stuff on youtube. But the film holds together very well once they get to the Planet. Was this filmed in Scotland or just by a Scottish crew? Or is it just better effects work? Did they edit out the water? By the end I kinda loved this film and was disappointed when they all died.","On many levels it's very good. In fact, considering that this was a low-budget British indie by a first time feature-director with a largely neophyte cast, it's a magnificent achievement. I don't know how much it cost. The figure of £8,000 was bandied about in publicity but you never know how reliable a figure like that is. The point is that this film looks like it cost a couple of million quid and it clearly cost a tiny fraction of that Great special effects, terrific production design, effective props and costumes, excellent photography, good acting and direction, an impressive score and an absolutely stunning sound mix. Even having said that, much of the script was great. The characters were clearly identified and all had something to do. This is a movie about ten men all dressed roughly the same in one location and it would be easy for them to be nameless, faceless blanks but these were ten characters - mostly that was done through the dialogue and the way they reacted to things. Throughout the middle act, when the plot was developing, the script told the story well and showed how it affected the characters. If the whole film was like the second act, it would be stunning.Before the ship blows up, twelve people make it to individual escape pods or 'e-pods' which blast away from the ship. They're not much more than automatic metal coffins and the poor sods inside are trapped, cramped and have no real idea where they're going - but that makes sense. I like the e-pods - they're an excellent idea done very well and make more sense than a nice, roomy escape capsule. I also like the way that we are specifically told, later, that they are designed for ship-to-ship escape but can just about make planetfall in an emergency - because, let's face it, these guys were bloody lucky that their ship was blown up so close to a planet. That said, it doesn't look to me like there are 116 unused e-pods still on the freighter and you have to wonder how the prisoner is able to get into an e-pod - but in he gets. (And it has just occurred to me: shouldn't the Captain have gone down with his ship rather than being the first guy out of there?) Anyway, the e-pods all land on a barren planet with nothing but sand and sparse vegetation - or at least on a sandy, sparsely vegetated part of the planet which may have icy wastes and lush jungles elsewhere. Nah, it's a planet in a sci-fi movie - it will be exactly the same all over. We have to accept that all the e-pods come down within a few miles of each other so that the ten survivors are able to meet up, firing flares into the sky to locate each other.The Captain, a muscular mountain of a man who could have a pretty good career in action flicks if he gets the right agent, decides that they should try and contact 'Captain Behan' with whom they were intending to rendezvous. But they cannot do this from the planet, they need to get into orbit. The engineer says that if they combine the power units from two e-pods they can probably give one of them enough juice to lift itself on anti-grav doodads high enough to blast above the atmosphere. It can all be done on automatic but it will need a 'pilot' to send the signal. The captain valiantly volunteers for this but in a commendably sensible move the engineer points out that putting the heaviest man into the somewhat dodgily repaired e-pod is ridiculous and that it needs to be the lightest member of the team. That's Kid. I really liked the way that he now points out that his name is David and the Captain starts using it, treating him with dignity and respect. That was good storytelling and good characterisation.","If people are excited by this film it's because the director created a huge amount with very little. It really is worth a look. Trouble is that no amount of clever can cover the fact that some of the acting is pretty crap. But even then the bar is set quite high.I for one am looking forward to whatever this production team is involved with and that's no bad thing. With more money and better actors a better film could be made.But even with the budget problems, this is a DVD I was glad to watch. At least once and the making of is very funny.I've seem much worse for many more dollars.","Every once in a while you stumble across a movie that takes you by surprise and this is one of them. On the surprise scale this would rate as sharing a hot tub with Jessica Alba whilst a band consisting of Elvis, Jimi Hendrix, John Lennon, Phil Lynott and Keith Moon play you music for the night. The reason why this film will surprise you is that for the meagre budget they had (£8,000) and that this was done by a bunch of mates who just wanted to try it out they have produced something very slick and looks easily 100 times more than its budget.The plot is simple a crew of mercenaries carrying a dangerous prisoner through space come under attack and are forced to crash land on a nearby desolate planet. After some checks not only does the planet not exist according to star charts but they are not alone as it seems and something very unfriendly begins to pick them of one by one. It sounds like very standard Sci-Fi fare mixing elements of Aliens. Predator and Pitch Black but it takes all these and makes them into something that feels fresh and original.The Location shooting in this is fantastic, utilising Balmeddie beach in Aberdeen to the maximum and you genuinely feel that you are one an alien world. The seemingly never ending sand dunes and clever lighting effects give it a very bleak feel , you truly think the crew are stranded on an alien world. Also the action sequences are superb, the opening assault on the freighter a great showcase of what special effects can be achieved on a budget and the firefights as well as the stunning finale all showcase the inventiveness of the film.As for the team of mercenaries the cast excels themselves. For a low budget independent movie the casting here was done via local media outlets and they seem to have picked some possible stars for the future. Local body builder Mike Mitchell whilst not a natural actor slots into his role as the Arnie-Esq leader of the mercenaries. From the rest of the cast there are two stand out performances Patrick Wright as second in command McNeal and Scott Ironside as the rough and ready engineer Vince. Both have some the best lines in the movie and Scott injects a good bit of humour into the movie with his performance. Patrick gives a well rounded performance as the cool as ice second in command.Director Mark Stirton can be very proud of what he has achieved and shows that Scottish cinema need not all be 'Kilts and Ceilidhs' or 'Slums and Drugs' Scottish films can be fresh, inventive and most of all a lot of god damn fun. This film is Scottish (with a north east flavour) to the core and praise to the actors and directors for keeping the accents intact which adds to the charm of the piece. Although the budget limitations show from time to time (the only fault i could find) that is to be expected. This film, its cast and crew deserve all the success they get and then some more. I for one wish Mark and his crew every success and theirs is a career to keep a very close eye on.Rating - 9/10 The first Scottish sci-fi is bold, fresh and inventive a real triumph.Movie reviews, news and opinion like no other plus the kick ass bi-weekly pod-casts.www.fightrunner.co.uk contact@fightrunner.co.uk","i was having a horrid day but this movie grabbed me, and i couldn't put it down until the end... and i had forgotten about my horrid day. and the ending... by the way... where is the sequel!!!the budget is obviously extremely low... but ... look what they did with it! it reminds me of a play... they are basically working with a tent, a 'escape pod', a few guns, uniforms, camping gear, and a 'scanner' thing. that is it for props. Maybe this is even a good thing, forcing the acting and writing to have to step up and take their rightful place in film, as the centers of the work, instead of as afterthoughts used to have an excuse to make CGI fights (starwars).The cgi is fine. It is not exactly 'seamless'... but imho it still works. why? because there isn't too much of it, and what there is, is not 'taking over' with an army of effects house people trying to cram everything they can into the shot. it prompts the imagination... it's some relatively simple stuff, with decent composition (especially the heavy freighter shot.. there is one long shot that must be at least ten seconds...that tracks the entire length of the ship... it must be a record for sci fi battle sequence film making in the past 10 years, to have an action sequence that lasts longer than 0.75 seconds), and some relation to the story. it might look old or not 'state of the art', but it doesn't look stupid and it doesn't take away from the story.The acting is good, except the characters die too fast to get to know them. Now, as for the plot.... mostly it is good... why? Because it doesn't try to explain itself. It just happens. It's called 'the planet', its a mystery, get it?? Nobody knows why there is a statue, and they don't find out either. The mysterious cult? The weird scientist with the tattoo? What do you expect to find out in less than 90 minutes? This isn't War and Peace. And, thank god, it's not star wars/trek either. No midichlorians, no 5 minutes of expository boring dialog that has no purpose in the story. The characters are stranded, and are only able to figure out a few basic things... it is not a star trek episode where they find out it's leonardo davinci or a child like space wanderer. It is mysterious, and i liked that. I don't know why, maybe I can identify with these guys more , since they don't know whats happening, and i don't either... they don't talk a lot of space gibberish or have magic boxes telling them what is happening. Anyways. What can I say. This was well worth the dollar I payed at the 'red box' machine at the supermarket. It was also, imho, a better piece of storytelling than starwars parts 1 2 or 3. Like I said, it sucked me in, wanting to know what was happening, and I couldn't stop watching until the end.","The '7' rating is not necessarily a smear-- this movie was done on a low budget-- but done well within its limits.A usual pot-boiler plot-- Ship carrying a prisoner is destroyed in space, people and prisoner escape in pods, land on unknown planet where their presence wakes something up. Mayhem ensues, a lot of ammo is expended.The special effects were spare and properly done, emphasizing future technology with holographic displays and controls instead of relying on bulky, cheap looking plastic props. Plus the pacing of the story moved without allowing the viewer to lapse into boredom where they start picking things apart.I peg this one as a lite Saturday afternoon flick. You can get up and hit the fridge without pausing it and it'll still be enjoyable. Even better, your girlfriend can talk all the way through it without damaging your enjoyment-- and she'll be happy: after all, she got to TALK to you! It's THAT type of movie.Anyways, the actual story line has s few holes in after they hit the planet, but hey, this is a Guns 'n' Ammo action movie. Cohesive story lines are not necessarily required so long as you have Beer and chips at hand. So don't get get yourself into a brain-cramp over the ending.","Got this the other day from the Creators on DVD. I saw this advertised in a free magazine whilst family were stopping in a hotel, had never heard anything about it. After reading it was filmed on Balmedie beach i just had to buy it. I used to take the kids to the dunes in the film all the time whilst living in Aberdeen.1st off Im not a big Sci-Fi fan (baring Star Wars) I was really just wanting to see what they had done with this film location, I was presently surprised. This didn't turn out to be a standard Sci-Fi, more like a mix of sci-fi and survival horror.Had a good storyline, which was different, had great special effects for the budget that it was produced with £8000. Acting was better than average for a low budget film. The way they have edited out the whole coastline to make it feel like the dry desert planet that they are on was nice.Weapons in the film were realistic and the creatures were cool kinda like predator in invisibe mode.All in all I will buy any future releases from these guys, maybe a all out horror next (Hint Hint). The extras on the DVD were very informative on giving background for the producers, I would like to see some of them shorts included as extras on a next DVD release.Excellent work keep it up","People seem to be expecting Citizen Kane here! The Planet is a B-monster movie and as such is good fun and different enough to be enjoyed. The director clearly has something to offer - not so sure about some of the cast. As for the effects? £8000 ain't a lot of effects budget.I for one would happily recommend this outing to a sci-fi head or anyone who doesn't take monster movies too seriously. If so? Watch 3colours blue instead.I noticed one review saying it had ripped off Alien. Like Alien didn't rip things off. The best thing about the film? The director. The worst thing about the film? The cast. Maybe it's time for the Director to move from Glasgow to London and find some talent. In the meantime - well done. At least you're trying to do something.","Even with it's low budget this movie could have been worth watching if there was a story to tell here. It started out pretty good, and fairly engaging and believable. The actors and characters were interesting although there wasn't much character development. My favorite scene was when they were all eating their rations. Some seemed to hate it, and some seemed to think it wasn't too bad. The story starts out very airtight. And then... And then it dipped into a little horror which is usually a death sentence for most sci fi. Suddenly no scientific basis for any of the goings on. No real believable end game for the villain? No real explanation of what's going on. Generally if a movie has to use the F word for every other word it usually spirals down from there too. I still get offended believe it or not. I often wonder what inspires people to make bad sci fi? Isn't there a universe of fantastically good stories out there? Don't people feel like they are wasting their time and everyone else's when they put out stuff like this. Why do we get so much mediocre sci fi like this? No female actors/characters either? None at all? This had the makings to be another \"Predator\" but alas fell far far short. My final comment - poor editing and finally too low a budget to build a real campfire? What gives? My advice for any low budget sci fi movie production companies out there. Make sure you got a good story before you start, and edit out bad special effects - it's better we see nothing than something that looks fake or ridiculously fuzzy.","Got the chance to see this at a friend's house today, and was impressed with what it achieved on such a small budget. Not that this ever bothered me anyway, since I love low budget sci-fi like Dr Who, Blake's 7 and Dark Star. Hell, even Outland wasn't a big budget affair, so whilst money helps, it takes more than throwing cash at things to make them good.The story is straightforward at first, with a group of mercenaries paid to escort a prisoner through space. Their ship is attacked and they are forced to land on the nearest planet. They then discover the prisoner has made it too, he's a stone cold nut case and that's only the start of their problems.The effects, except for the gunfights, are minimalistic and add to the film without overwhelming it. Computer effects look a bit dodgy at times, but serve their purpose well and add to the story, lending a futuristic feel to the proceedings. Films like I, Robot could have benefited from this approach instead of being largely style over substance and substituting special effects for a plot, like all too many of Hollywood's offerings.Whilst none of the actors get Oscar material, it's tightly scripted and shot and at an hour and ten minutes doesn't outstay its welcome. The characters don't get fleshed out much, but then they didn't in Predator either, which it resembles in feel. Big man Mike Mitchell is a good stand in for Arnie and is a good combination of brains and brawn.Some people may be annoyed at the lack of explanation towards the end, but I like it. Unlike a lot of films and shows which leave things unexplained, it is not so obscure that you can't get a handle on it at all, and I'd like to see a sequel where the nature of the aliens is explored further.A cracking little film from an enterprising team, done on the cheap but a fun way to pass an hour. If this is what they can do on a shoestring I'd like to see what they would do with a bit more cash, and hope the film industry and the talentless armchair critics don't knock all the creativity out of them first.Recommended.","I was excited about this movie after reading other reviews. What a disappointment! There are so many ways that this movie is bad. The computer graphics were lacking to say the least. I found the acting stiff and unbelievable. Watch the sand as the lost \"e-pods\" (what an original name!)are found. Where did all the tracks come from? I immediately recognized portions similar to other movies, ie Alien, Pitch Black. Come on,one huge ship to transport one prisoner? And what is with the prisoner? Does he speak, can he speak? I kept waiting for something to tie the bits of the story together, but it never came. If this movie was made on a low budget, it shows. The only part of the movie I liked was when it finally ended. I don't mean that I liked the ending, I didn't. I just liked the fact that it was over. A trip to the dentist would have been more enjoyable. In my opinion. don't waste your time on this one.","I have to confess that I know some of those involved, I was in the forerunner to The Planet, Evil Unleased, however this was more than 10 years ago and I had since lost contact with them. I happened to be watching BBC Scotland News and a piece regarding Scottish Cinema, this mentioned and showed clips from The Planet and comments from it's director Mark Stirton, this prompted me to order a copy of the film on DVD.Now to the film, the level of acting, writing, directing and sfx is up there with some of the best around, OK it's not Star Wars but I've seen many a Hollywood product that is far inferior. It is very strange watching a film spoken in my local North East Scotland accent but that soon passed.^Mild Spoilers^The Planet draws on several sci-fi classics; Star Wars, Alien, Pitch Black, Forbidden Planet and Predator, a handful of the merchant crew of a deep space transport ship survive their craft being attacked and destroyed by unknown ships, they escape onto a deserted desert planet, one by one they are killed by invisible attackers, the ships only passenger, a mysterious prisoner also makes it to the planet, a battle ensues as the crew fight to survive.The Planet is a brilliant piece of sci-fi film making that certainly hides it's limited budget, well done to Mark, Mike and all those involved, I look forward to your next work.","I felt compelled to write a review after seeing the only review which gave this film a suspiciously high 9/10 rating. I say suspicious because it looks less like a review but more like a publicity statement. Perhaps the filmmaker himself, or one of his mates, has written that \"review\"? Naughty, naughty.I watched this movie on the Propeller channel on Sky TV expecting it to be truly awful. The special effects used were to be honest very, very good for a low budget film, and some of the acting wasn't that bad either, but most of the acting was really awful, but well done for trying, as I expect most were pals of the filmmaker.I think the filmmaker has done really well by trying to punch above his weight. I did find some of the film funny because it was trying to be super cool when it just wasn't.If you don't take this film too seriously and watch it whilst drunk with some mates you might well have a good time but probably not in the way it was intended. This film is no way a 9/10 but worth watching for a laugh bearing in mind it was made on a very very low budget and in fairness due credit to those involved in it's production.","Crazy Scottish warrior race, stranded deep in outer-space, low on food and budget free, started ten now down to three, who will help these men of pluck, with visual effects that semi suck, but I kinda liked the freaky being, if I met one then I'd be fleeing, but not if I had Scottish mates, we'd f'n swear and avoid that fate, so in the end it wasn't botched, it was a DVD I'm glad I watched, but if they ever make a sequel, dump some actors, not all were equal, some were good, with gritty acting, some were wooden, and should maybe pack it in, but the action kept me watching all, the shooting, shouting, didn't stall, I'll tell my friends not to fear, and watch again in another year.","I loved this movie! Yes, it is rather cheap and I'm sure plenty of reviews will be snooty about that. But my goodness what a lot they pack in for the cash involved. I was reminded of the early work of Sam Raimi. Yes it is rough, but has good energy and plenty of fun. The acting ranges from the very good in Scott Ironside and Shawn Paul Hasser, to the not so good in some of the lesser parts. Is it a cult movie? Well it grew on me. First time I liked it but by the 3rd viewing I was loving it. The movie is probably a 7 out of 10 but I'm giving it 8 for sheer cheek. Anyone who can pull this off for 8 grand is worth watching. Almost makes me want to visit Scotland!","Quite an accomplishment for a first film on a micro budget. Obviously all the haters & whiners haven't an inkling of what it takes to produce a film.The movie is gritty and the effects aren't the greatest... However the plot is coherent, the acting is decent and the pacing was sufficient to hold my complete attention through out the whole movie.This movie was shot with an £8000 (about $12,000 US?) budget. Mr Stirton also only had TEN days for shooting. Considering this, it's a miracle that this movie was A LOT better than some SciFi flicks I've seen that cost a hundred times more!","This is the second time I've had a negative comment deleted for this film, and I believe that the IMDb user who is reporting \"abuse\" on these comments is doing so only to skew the results in his favor, and I believe he or she is likely involved in some way with the film. As a result I now vow to re-submit a different negative comment each time mine is deleted. I now see it as a moral imperative to stop someone from getting away with underhanded marketing practices. This site is an open forum for opinion and just because my opinion of the film is a negative one does not mean that someone involved in the work should attempt to continually censor or remove it. To that person I say this... report the comments and have them taken down automatically as often as you desire. What you will achieve by doing so is this: an endless stream of continually different negative comments instead of one persons opinion that could be forgotten and overlooked. In other words, you are doing your own film damage. I will not stop re-submitting my valid critique and I have more than enough time on my hands to make good on my vow.Now, on with my opinion of this terrible film: Terrible special effects that tried to reach far beyond the limitations of the budget. Blatant and unashamed plagiarism of other sci-fi movies (like Pitch Black). Terrible acting. Endless slow motion scenes of characters walking aimlessly across sand dunes. Meandering dialogue that does nothing to further the story. Characters wearing turtle neck sweaters on a desert planet with two suns. A \"cargo\" ship staffed by a camouflage-wearing crew of gun-toting soldiers (why exactly would you need forest-camouflage in space anyway?). Some of the worst casting choices in the history of no-budget film-making - a steroid swollen \"captain\" who comes across more like a muscle-beach jock than a trustworthy commander, and a \"convict\" who looks and acts about as dangerous as a bunny rabbit. 70 minutes in length, 35 of which could have been trimmed out if the director had any concept of \"compression of time through editing\"...I won't go on. Suffice it to say that while some components of this awful movie can (and should) be forgiven due to it's low budget; the bad conception, laughable plot holes, and snore-inducing script are unforgivable on *any* budget. The end result is a tedious, dull, waste of time. Sorry guys, I hate to be so harsh on an amateur film, but you've no excuse for turning out this kind of work.","I've got 10 plus year old computer games with better special effects! Plot is choppy and very predictable. Most of the actors seem like extras with no experience! Everyone has Scottish accents. It's like watching a crew of 'Scotties' from Star Trek without the personality or charm. Needless scenes of people putting up tents! Tents with all of the supposedly high tech equipment! Actors looking like they were not sure the camera was on them. Nothing to make you care if these people survive or not! Looks like it was made in someone's backyard and garage using low end equipment! Nothing seems original or even slightly entertaining. Do not waste your time!"],"review-user":["o_mcguigan","PortosM","john in missouri","dsmithy74","zoe-1000","aberdeen44","Viper12345","banssra","ukscifiboy-1","redford99","fightrunner","fliphop","Rabh17","stetheboro","brian42-2","jlandgraf","pphree","hrairoorah","Stevie G","john-4471","jbbanger","director500","glphil","The_Dead_See","niwdog"],"review-date":["1 September 2007","13 March 2009","5 November 2008","31 July 2008","19 January 2008","28 December 2007","15 August 2006","15 June 2008","12 April 2008","19 July 2007","20 August 2008","25 November 2008","2 August 2008","22 December 2006","31 August 2007","25 August 2008","23 December 2008","30 August 2007","17 September 2006","14 January 2007","16 June 2008","17 January 2007","27 July 2014","28 November 2008","15 August 2008"],"review-rating":["3","1","4","9","10","10","7","10","10","9","9","7","9","10","2","10","1","10","3","10","10","7","1","1"],"review-title":[" Pretty budget alright but worth the merit\n"," Budget doesn't matter. It just isn't professional\n"," Just plain weird.\n"," I'd buy that for a dollar!!!\n"," The Thing 2?\n"," Great fun indeed!\n"," fantastic\n"," All about the acting\n"," Space...\n"," Interest over budget\n"," The Planet\n"," yes yes yes!\n"," Well done lite sci-fi action\n"," Sheer Brilliance\n"," b\n"," Why can't we make good sci fi anymore?\n"," Great low budget effort\n"," Terrible movie\n"," Astounding Local Film Making *Mild Spoilers\n"," Not as awful as I expected\n"," Never blue or gray.\n"," loved it\n"," Mr Stirton's little miracle\n"," Awful. Avoid at all costs.\n"," horrible\n"]}