{"review-url":["http://www.imdb.com/title/tt0807716/reviews"],"review-text":["Hehehe. This was one of the best funny road movies ever! I laughed so I fell out of the chair. With many Norwegian and foreign celebrities playing themselves. Harald Zwart is the producer, known for films like Agent Cody banks and of course One Night at McCool's.It is about Norwegian crazy fans, going to the world cup in Soccer in Germany 2006. And all sort of crazy fun that comes with it. It was hilarious. I couldn't stop laughing. I haven't had so much fun in ages. Rumors say it will come a number two, but I do not know. It will be hard beating this one. recommended to everyone! It is a must see film. I was suppose to see it at the cinema, but I had work at the times it where shown. And been trying to rent it for a month, but all the time rented out. Got it today on DVD. Well worth it.","Norwegian movies have never been something outstanding. Our Swedish and Danish neighbours have always been way ahead of us. We only have a handful of good actors and actresses, and they have been way overused. That's why it is such a delight to see some new faces in a Norwegian film, even though it is about football/soccer (which I hate), and the guys are middle-aged overweight grey-haired men with one of the weirdest accents in the whole damn country. The movie doesn't break any boundaries. Hell, it doesn't even reach for the boundaries. The actors aren't good actors, they are actually regular football fans just the way they appear in the movie. But, I must say, this movie was very enjoyable - I laughed through most of the movie, and the end made me feel patriotic even though I hate football/soccer and don't even celebrate on May 17th, our constitution day. On scale from 1 to 10 for Norwegian films; I'd give it a 8.5. Internationally: Sorry, but I can't give it more than a 5. Watch the movie. Enjoy it! :)","This was one of the few Norwegian movies I actually looked forward too see. It started of as a few commercials with a motley bunch at football matches. Then they made a movie out of it. The leads are not pros (and you can see that) but they still do a very good job and the movie all in all blew me away.Norway is known for making crappy movies (no offense)but I had a good feeling about this one. Even thou I'm not interested in football I wanted 2 see it. the story is a lot better than expected and the laughs just keep piling up. there are loads of cameos from Norwegian celebrities and players. the characters are well portrayed and you feel for them. IF You're EVER GONNA SEE A NORWEGIAN MOVIE. LET IT BE THIS ONE!!!!","I hate football!! I hate football fans! I hate cars! but this film was the funniest thing I have seen in quite some time. I was given the great opportunity to see this film at the weekend, and all I have to say is I laughed till I cried, and when is it going to be available in the UK and Denmark. Girls, this is one football film you will need to see, its hilarious!The fact that this film started out as some crazy commercial for a telephone company is just amazing, the guys may not be well known actors, but this is good down to earth real humour, with real people, and I for one applaud them for taking this to the screen.WELL DONE!","I am a huge fan of Harald Zwart, and I just knew that I had to see this movie, even though I can't say I'm a soccer fan. But watching this just filled my heart with joy, and I had a great time in the movies watching it.Bjørn Fast Nagell does a tremendous job directing this movie, and even though you notice the main characters are new at acting, they grow with the movie and makes it what it is. Even though it is supposed to be a soccer movie, there is surprisingly little soccer in it. The whole idea is to show the six guys making up the word N O R W A Y on their trip to the World Cup in soccer playing in Germany this year. If you're only gonna see one Norwegian movie this year, this is the one..","This is one of the most awful movies I've ever seen, probably only surpassed by the dreadful and utterly meaningless Blueberry. How can Harald Zwart even have put his name on this crap. I'm feeling every ounce of respect I had for him waning fast.So what is it about this film that makes it so poor? Is it the story? Yes. Is it the actors? Yes. It it the whole \"look and feel\" of the movie? Yes.To start off with the story, my god!It's about as cliché-ridden and predictable as what you would expect from a drunk 14-year old who is late writing his/her paper on \"What I did this summer\". The feel-good vibe the makers try to achieve just completely drown as we suffer through yet another embarrassing turn to the story.The actors are amateurs, I know, and thus we cannot expect them to be of the same quality as professional actors. But for this to work, the characters HAVE to be charming and/or funny (preferably both), so that the viewers don't mind the cheeky acting, or perhaps it even adds to the characters. In this case, not even close baby! You start off disliking the characters mildly, and by the end of the film (I think it's about 90 minutes long, although it feels like 4 hours) you have a strong desire to hurt somebody to get your mind of these annoying stupid guys! It should be impossible to find this movie's attempt at humor successful unless you're actually yourself like these stupid hickeys. Their before mentioned lack of talent and credibility as far as acting goes, only makes the foolish and overly simple scenes fall harder to the ground. Even the family of the people involved will have a hard time finding this anything but very, very embarrassing (I'd rather have my sister make a fool of herself on American Idol).Finally, why cram in a bunch of misplaced Norwegian celebrities? They look even more out of place than the actors, if this is possible. These celebrity cameos just add to the cheap feeling of the film and is in itself a pretty see-through shot in the dark at trying to improve something broken even before inception.I cannot even begin to stress how much I'd rather watch paint dry than ever watch this movie again...","This movie is actually so poor in its desperate attempts at being \"feel good\" and casual it really made me embarrassed watching it. I can't imagine how the inner circle of Norwegian celebs and press must have felt trying to pretend to like it at the star-packed premiere. Its great media reviews is a sickening example of how ridiculously small and inbred the Norwegian media scene is. Had a foreign film of this quality reached the silver screen it would have gotten the rain of rotten tomatoes it truly deserves.The combination of literally amateur actors, home-made style visual effects, awkward dialogue, painfully idle attempts at working class humour and the overly cozy and meaningless plot, really makes this a movie of rock bottom quality. Stay away."],"review-user":["kevintempel","stiaand","furby79","sonya_o","gullungen","fuglis","heinrobert"],"review-date":["24 July 2006","28 July 2006","12 July 2006","30 October 2006","9 June 2006","16 July 2006","17 July 2006"],"review-rating":["9","5","10","8","9","1","2"],"review-title":[" Great fun!\n"," A true image of Norwegian football-fans\n"," Norway's best comedy ever!!!\n"," I laughed till I cried\n"," An incredible funny road movie\n"," This movie is so poor, it made me be embarrassed to be Norwegian in the process...\n"," Incredibly awkward\n"]}