{"review-url":["http://www.imdb.com/title/tt0819714/reviews"],"review-text":["Naturally, before watching this film, ones expectations are high. The tale of Dylan Thomas and his lovers promises to be exhilarating. The stars used in the production hold high promise. However the result is different. There is just something not quite right about this film.Whilst it manages to capture the viewer with moments of cinematic beauty, The Edge of Love fails to entice. In some scenes the cinematography is perfect. The set design and costume cannot be faulted. The glamour and horror of the era are portrayed perfectly. But the story itself does not piece together. The sudden friendship of the two women seems too soon and lacking in explanation. The characters have little depth and I felt no real sympathy for any of them. It almost seems as if several crucial scenes were omitted.The film itself is fairly disappointing, but perhaps worth watching for the moments when everything comes together because when this happens the film is stunning.","With the shadow of La Knightely looming large, I really wanted \"The Edge Of Love\" to be another \"Atonement\" - a big, beautiful looking, poetic wartime romance - but it wasn't. Do not get me wrong, there are many good things in \"The Edge Of Love\". It just did not touch my heart the way that \"Atonement\" did.The acting is uniformly fine. Tabloid darlings Keira Knightley, and Sienna Miller especially, proved that their performances in \"Atonement\" and \"Factory Girl\" respectively were no flash in the pan. They were both excellent. Cillian Murphy is also good as Keira Knightley's war traumatised husband and Matthew Rhys got to the heart of the indifferent, drunken, selfish chancer that was Dylan Thomas.\"The Edge Of Love\" looks fantastic. Contrast and compare the cinematography of the 'London during the blitz' setting of the first half with the bleakness of the Welsh coastal town of the second half. The first half of the film presents almost a fantasy world: Dreamy and just out of focus. Smoky pubs, soft lighting and shadows. The second half of the film presents a hard reality: Harsh pebble beaches and wide open spaces. Rain, grass, pain and small town mediocrity. In the former romance flourishes amid the cigarette smoke and the alcohol; in the latter romance fractures, and there will be a reckoning for bad behaviour.(I will say at this juncture that most critics have written that the film loses it's heart when it moves out of London. I disagree. I think the film becomes real and true once it moves to Wales. The second half is my favourite half of the film.)But sadly, and whisper this very quietly, \"The Edge Of Love\" is just a little bit too dull. Mood movies, and \"The Edge Of Love\" is definitely a mood movie, have to walk a very fine line between immersion in atmosphere and the demands of plot to keep the punters interested. Too often \"The Edge Of Love\" falls into the former. It needed more story.Not a bad film, just one that could have been better.","Set during the Second World War in both London and Wales, this film portrays the complex relationships between four real-life characters: the Welsh poet Dylan Thomas (played by Welsh actor Matthew Rhys abandoning his American accent from the US television series \"Brothers And Sisters\"), his Irish wife Caitlin MacNamara (British actress Sienna Miller), his first love Vera Phillips (another British actress Keira Knightley) and Vera's husband the British soldier Captain William Killick (Irish actor Cillian Murphy). Many of the incidents represented are a matter of record but other occurrences are simply speculation on the part of screenwriter Sharman Macdonald (Knightley's mother).In truth, it is Keira Knightley's film. Her striking physiognomy always makes her a pleasure to watch, but this is the finest performance of her young (still only 23) career, as she effects a decent Welsh accent and even sings in a nuanced act of thespian of which she can be proud. Director John Maybury does not make the character or the poetry of Dylan Thomas any more accessible but the bonding and bruising between his wife and his lover make for a humanistic tale.","This is primarily about love in WWII, yet we must remember that it's also a biopic for Dylan Thomas and those around him at this particular stage in his life.The movie's timing is just great. It really captures what I think would have been the spirit during those times; smiling and hoping you're not going to get bombed. While it may prove boring to some, the movie does have a particularly dangerous edge to it.At one point, my heart was racing towards the end as the movie hits its climax. It really does feature some poignant moments that are handled with skill by the four main actors. Cillian Murphy is on fine form here, as is Matthew Rhys. Both are polar opposites and it makes for an interesting watch. The relationship formed between Sienna Miller and Keira Knightley's characters is wonderful and we have the acting to thank (and watch out for a cameo by Suggs of 'Madness'). Despite all of this, it's a rather slow movie. Coupled with the fact it's just shy of two hours, it's quite a slog to get to the conclusion.Overall, it's a solid non-fiction war movie with many wonderfully crafted moments that were no doubt helped by the splendid number of well-known British names behind the scenes. But it really does drone on for too much at times. Still, a worthwhile watch. 7/10","Despite the title and unlike some other stories about love and war, this film isn't too sticky and pink, because love is as a rose: With thorns, that is. The four leading actors set their characters realistic and with a good sense and balance between the tragic and the down-to-earth. The music and lyrics of the cabaret/chanson-esquire songs (sung b Keira Knightley herself) drag the viewer deeper and deeper in the film, from one place to another, between the brutal war and amongst the peaceful love. Some people may find it too much a biopic, but it ís mostly a romantic story, even though it consequently follows the life of Dylan Thomas and the triangular relationship which is steeped by joy and jealousy. London gets visualized from another angle for once, the bohemian life of Dylan during the bombings of the Germans is set in a floating atmosphere of small bedrooms, pubs and bars. The independent women, the soldier and the charismatic poet are constantly swept in both feelings of love and anger. Maybe the end is too twisted and hangs somewhat loosely to the rest of the film, but all in all this is a great romantic story.","I went to see this as the Edinburgh Film Festival the other day and I have to say I was a bit disappointed.The score and the cinematography were lush and gorgeous and the acting was very good but the script lacked characterisation. I realise that Dylan Thomas was not meant to have been an overly pleasant man, but I failed to see why the seemingly likable, headstrong character of Vera Phillips ever fell in love with him. He came across as completely selfish and sleazy with virtually no redeeming qualities and it frustrated me that there seemed to be no explanation for every woman fawning over him. Characters made choices out of the blue and eventually I just grew to dislike all the characters I have loved in the first half.What also grated about this film is that sometimes I swear I could have been watching 'Atonement' the amount of time Keira Knightley said \"Come back to me.\" I really hope she wasn't trying to relive the glory of 'Atonement' through this film because I am afraid she will be sorely disappointed. Even though I personally did not enjoy 'Atonement' I can recognise that it is a marvellous film and sadly \"The Edge of Love\" just cannot compare.","This will be rough and tumbly, as I've just watched the film under less-than-ideal (ahem) circumstances. Let me say first off that I feel sorry for fans of Dylan Thomas: Matthew Rhys is charming beneath his mop of dark curls, his eyes twinkle with mischief, and his expressive voice lends itself well to what few lines of Thomas's poetry he recites, but Dylan Thomas as a character in this film is such an abominable wastrel and a cad that at best he's Satan with a pot-belly and a Welsh accent.Apologies, too, for this being all over the map. What doesn't work about the film, or seems to work against the filmmakers' intent: Dylan the cad, as above noted. Then the \"friendship\" between Caitlin Thomas and Vera Phillips, which seems pasted into the film from a photoshoot of Forties style between Sienna Miller (Irish accent off-and-on, and perpetually atrocious) and Keira Knightley (in full shrill-and-brittle mode, right up until the last twenty minutes). In declaring herself \"an independent woman\" to her admirer and future husband William Killick (Cillian Murphy, and more on him below), she seems to be speaking-- abrasively-- from some future era of organized feminism, a young woman of the Sixties dropped into the Blitz. In film time, Killick's patience with her outlasted mine by about an hour and ten minutes.Other unworkables: A most unconvincing Blitz. I know that the war isn't the focus of the film, and they had to be shooting on a tight budget, but the grainy newsreel bits just don't cut it. (Nor, especially, does a flashback sequence toward the end, shot to look like an old home movie-- and where, I wondered, did they get the color film stock for those home movies when color film was being rationed even to the major studios?-- which comes off as saccharine and desperate.) Killick, waging war in a Greece that looks exactly like the shale quarry used in any thousand old Doctor Who episodes, doesn't fare much better, but the shock and resolute terror in Murphy's extraordinary blue eyes lend a jarring reality to the material.Another shortfall: There's no story, really, no arc. There's a dramatic \"bump\" in the last reel, but all in all it's the rambling tale of two ostensibly despicable people (those being Dylan and Caitlin) who sponge off a truly decent person (poor Bill Killick) through the medium of a person who ought to know better, and who may or may not deserve to profit from the lesson she learns about love and fidelity en route (that, of course, being Vera).A final grumble, and one that might sound perverse: if those involved in a production feel uncomfortable about staging intimate scenes, might we please return to the dignified days of the discreet fade-out? Not that simulated intercourse isn't ever less than awkward on screen, but if you must resort to shooting a love scene in a way that makes it seem as if we're watching the participants-- here Vera and William-- through a kaleidoscope, then please: cut the scene or call for a rewrite.What works: The film looks good, in a can-do Masterpiece Theatre way. The Welsh coast is stunning and bleak, all misty light. Keira Knightley's singing voice is surprisingly sweet (which gives one hope that she won't do too great a disservice to \"My Fair Lady\"). Ms. Knightley herself, despite her prickly defensiveness in the film's early scenes, exhibits a quiet strength and maturity toward the end: a new thing for her, and most refreshing.But the show belongs to Cillian Murphy. I think this is his best role to date. From the dashing romanticism of Killick in the film's early scenes to the battle-stunned soldier-come-home later on, he brings true shading and subtlety to the film. More importantly, he brings humanity. Dylan sweet-talks most effectively (he's a writer, after all), but the poetry of the film lies in William. He's the angel to Thomas's demon, and without him \"The Edge of Love\" would be a sad, bitter, ultimately pointless affair.","So keira knightly is in it...So automatically we compare this film to attonement. Aside rom the fact that this film is also wartime and her appearance is uncanning, these films are totally different.The Actors work well, i think one good thing is there is no memorable person, they are a team.If you want a film where things happen, then id advise another as the story of this film is about human interaction and their physche's damaged by their experiences and how their lives are intertwined.This film have genuine interaction, perfect pause moments that make you hold your breath. No its not exciting, but it is gripping if you can empathise with these characters. At moments i wondered if this film may have been better as a theatrical play rather than a movie. We expect a lot from movies as everything is possible, and yet with theatre we allow for interaction and rely on belief.There are things wrong with it if your looking for a blockbuster, if you look for nothing and allow the film to take you in, move you, allow yourself to forget these stars, and not to judge them as actors but let them become people, you will truly ind yourself moved.GO ON!! give it a go!","Can you capture the moment? When first you hear rain on a roof? Some things are beyond the sum of their parts, expressing the poetry of life. The things that matter.Poet Dylan Thomas captured the seemingly inexpressible \"A good poem helps to . . . extend everyone's knowledge, of himself and the world around him.\" (Bob Dylan named himself after him). So why has it taken so long to make a film of the great Dylan Thomas? A simple biopic could have missed the point. Writer Sharman Macdonald has taken a different, better approach.In The Edge of Love, she creates the world of passions and complexities that fill the poems so we can swim in them. The lives of four friends. Dylan, who lusts and loves to the full. Wife Caitlin (Sienna Miller), his feisty support. War-hero William (Cillian Murphy), who saves him from a street brawl. And then there's his childhood sweetheart. Vera. Dear Vera. Take your breath away Vera. She's Caitlin's closest friend. William's wife. And, like a muse, the 'star' in Dylan's dark sky.It all kicks off in the 1940 London Blitz, with bomb shelters in the Underground. Enter Vera (an impressive Keira Knightley) under makeshift stage spotlights. She meets Dylan for the first time again in years, her heart is flushed. Their eyes shine through the smoke of the room. The purity of their former passion. Dylan (native Welsh-speaker, Matthew Rhys) is no sanctified, sanitised poet. Master of his vices he must experience them all fully. He introduces his beloved wife then continues to woo Vera.The Edge of Love is a visual treat. The soundtrack leaves you wanting for more. Performances are possibly the best by these actors in their careers. As a lush love story it's pretty good. As an insight into Dylan Thomas and the reality of poetry in all our lives, not bad at all. And as a tribute to a great man, inspiring.The production has been at pains to project the spirit of Dylan Thomas without compromising historical accuracy too much. Dramatic tension involves a pull between artistic freedom and conventional morality. Audiences looking for an experience based on the latter may be disappointed. And it will play less well to audiences whose boundaries are those of Albert Square.Sharman Macdonald seemed aware of the headstrong nature of artistic freedom and its limits when she spoke to producer Rebekah Gilbertson (granddaughter of the real William and Vera). \"Think of all the things that you don't want me to write about,\" she said,\" because I have to have carte blanche.\" For Macdonald, the limits were if she should cause offence to Dylan's memory. But for many artists, especially men, the limits are those which wife and family could set on them. A woman is not going to let lofty ideals interfere with practical common sense issues, and will even put her children's interests before her own (This occasionally happens the other way round, as when towering genius Virginia Woolf refused to let loving Leonard bring her down to earth - in The Hours).In spite of the tension between Caitlin and Vera, these two women become closest buddies. It is one of the main (and very beautiful) themes of the film.The film's colours tell a story in themselves. In a drab, wartime Britain, Caitlin and Vera are vivid highlights in an ocean of grey. Shortly after meeting Vera's lit-up-in-lights stage persona, we encounter Caitlin through her searing blue eyes, sparkling in a darkened railway carriage. Her dramatic red coat cuts a dash through streets of colourless homogeneity, triumphing on a beautiful staircase as she reunites with Dylan. But Vera's lipstick red brightness is less enduring. For her, marriage is second-best, even when she has become possessed with genuine love for her husband.Outstanding cinematography extends to using montage to juxtapose images, in a manner similar to poetry's juxtaposition of unrelated words to create further meaning. Horrific war scenes in Thessaly are intercut with screams of Vera in pregnancy. Giving birth or is it abortion? We are not told immediately. Pain is universal and goes beyond time and place to our present day.Constant echoes of Dylan's poetry throughout the film lead us beyond earthly opposites. It reminds me of Marlon Brando reading TS Eliot in Apocalypse Now. A light beyond the horrors of the world. A different way of seeing things. \"I'll take you back to a time when no bombs fell from the sky and no-one died  ever,\" says Dylan to Vera as they walk along the beach. Elsewhere, Caitlin recalls childhood with Vera: \"We're still innocent in Dylan,\" she says.There's a time to leave your knickers at home or share a universal cigarette. (Not literally, perhaps.) A time to be inspired. Enjoy what is possibly the best British film of the year.","Welsh poet Dylan Thomas excused from serving in active duty is doing his bit for the war effort producing bits of prose for some propaganda branch of government in Whitehall.Thomas is portrayed as a freethinker believing in free love married to a woman with an equally demanding artistic streak and likewise with a penchant for extramarital romance. Thomas writing and reciting his poetry in systematic domestic mayhem throughout becomes somewhat priggish towards the end, resting somewhat uncomfortably on his society connections and pulling rank on a war veteran, who had shot up his house, and who was incidentally married to the woman he had been having an affair with.The real story of this film is the love of two women, one (Keira Knightley) whose first love was Thomas (Matthew Rhys), the second (Sienna Miller) who is Thomas's wife. At times it reminds of The Singing Detective, as in very good television with slightly sinister overtones laid on top of scenes of surreal camp absurdity.","From the start of \"The Edge Of Love\", the viewer is transported to the striking world of WW2 London. We follow the lives of four people who might have been created just for this movie, an exploration of female friendship and the strains caused on it by marriage and infidelity. Except one of the characters is named Dylan Thomas, perhaps the greatest English poet of the 20th century. And his reactions to the world around him were not only selfish, but at times truly despicable. This movie is based on Thomas' writings about love and romance. These were adapted with a sharp screenplay by Sharman MacDonald (Keira Knightley's mother). The director, John Maybury, does claim that the three other lead characters were actual people. All four are performed very strongly. Sienna Miller is Dylan's wife, Keira Knightley is the cabaret singer Vera Phillips. Matthew Rhys is Dylan Thomas, and Cillian Murphy is William Killick. The first section of the movie takes place in London during the Nazi air raids, with Vera being pursued by Willaim, a soldier waiting for deployment. By a chance encounter, Dylan meets with his first love, Vera. From there Vera meets Caitlin, Dylan's wife. While the three are drinking, William successfully breaks Vera's guard. The film follows their lives as Vera and William are married and he is sent to war. Vera has become pregnant, and returns to Wales with Dylan and Caitlin. There they face a gritty existence, with Vera supporting Dylan and Caitlin with her husband's war pay. Through these times, Vera's and Caitlin's friendship grows. So does Dylan's infatuation with Vera. She gives in. This creates the first test for the two women. When William returns from war, he barely recognizes his wife, and has no bond with his infant son. Things get worse, as Dylan idly watches his friend struggle with battleground fatigue (post traumatic stress disorder). William realizes something has happened between Dylan and Vera, and in a drunken rage shoots up Dylan's house.\"Edge Of Love\" starts as a stylish romance in war torn London and ends in the stark, gritty life of motherhood, infidelity, and attempted murder in Wales. The treatment of PTSD is well done, and should speak to an American audience. Some day (see ending).Each star has a great moment. Miller when she is yanking out stitches in her head in response to her abortion of another man's child. Knightley and Murpy when he finally bonds with his son. Oh hell, almost all their scenes are awesome. And Rhys when he purgers himself on the stand to get Vera's husband sent to jail. Yet, the real star of the movie is Jonathan Freeman's cinematography and John Maybury's direction. They seem to understand that no matter how good the story or how historical Thomas is, this is a film dominated by two great actresses of our time. And they cherish their scenes with stunning shots. While this isn't best picture material, it is a very good movie (much more engaging than \"The Dutchess\"). It has a visual lyricism that accentuates the use of Thomas' poetry. Also, this is clearly Knightley's second best performance of her career, and perhaps Miller's best. I have always had a weakness for the Artist in struggle, whether it's Hulce's Mozart, or Hoffman's Capote. But I was stunned at how little sympathy I felt for Dylan Thomas. His struggles with alcohol are well known. But his antagonism of William and Caitlin to gain possession of his first love Vera makes him out to be.....a bad man.So is this Academy Award Worthy? Clearly no. At least, not this year. It will be released state side in March, 2009, making it ineligible for the Academies. This is 9 months after it was released in Britain. Between Atonement, Miss Pettigrew, and Brideshead Revisited, the US has had its fill of WW2 British period pieces. Too bad. This film is better then the other ones, except Atonement. But in this one, Knightley's soldier does come back, but as a shell of the man who left her.","Where would Hollywood have been without Fredric March as Robert Browning or Dennis Price as Lord Byron, famous lovers in their day? Even an actor as normally straitlaced as Michael Redgrave once brought some moody charm to a portrayal of W.B. Yeats. Writers' lives are an endless source of inspiration.But of all poets it was Dylan Thomas, the roistering, free-loving Welshman who enjoyed a pint or two (and drank himself to death in New York at the age of 39), who was closest in spirit to the film industry. During World War II, he produced scripts for British propaganda documentaries. He even wrote the screenplay of a vapid melodrama called The Three Weird Sisters, in which three old maids in a Welsh village plot the murder of their rich half-brother. All that is now forgiven.In John Maybury's The Edge of Love, Thomas is played by the Welsh actor Matthew Rhys. It's not a full-scale biopic. The film covers four years in the poet's life during World War II, when he lived with two women: his wife Caitlin (Sienna Miller) and a former lover Vera Phillips (Keira Knightley), whom he met again by chance during the war. It seems he loved them both. The relationship of these extraordinary women -- to Thomas and to each other -- is at the heart of Maybury's absorbing film.How it came to be made is a story almost as remarkable as that of the lovers themselves. Rebekah Gilbertson, the film's producer, is the granddaughter of Vera Phillips and William Killick. William, a war hero (played in the film by Cillian Murphy), married Vera while she was still in love with the poet. Gilbertson was inspired to make the film when she discovered a book about her grandparents, Dylan Thomas: A Farm, Two Mansions and Bungalow, by David Thomas, describing their tangled lives. Sharman Macdonald, who wrote the screenplay, is the mother of Knightley. The part requires Knightley to sing, and her mother included songs especially for her. Surely no film with such felicitous family connections deserves to do other than succeed.We begin in London during the Blitz. Bombs are falling, sirens are wailing, and Phillips is singing to sheltering crowds in an underground Tube station. In a pub, by chance, she meets Thomas and discovers after all these years that he has a wife and child. Phillips and Caitlin form a friendship untroubled by jealousy or rancour and are soon sharing beds and bathtubs, listening to Thomas read his poems, exchanging intimate secrets and smoking their heads off, as everyone did in wartime. Caitlin turns out to be more experienced in the ways of the world (\"My first was Augustus John, he seduced me when I was 15\"). But it's the refined and soulful Phillips who stirs Thomas's deepest responses and eventually succumbs to his charms. In the meantime, she has reluctantly married Killick, who has seen her in the Tube station and been instantly captivated by her beauty (if not her singing).It is an intense and strangely beautiful film, though Thomas himself may be its least impressive character. He is best remembered for Under Milk Wood, his verse radio play about a day in the life of the mythical Welsh village of Llareggub, whose name spelt backwards was not something polite English teachers drew attention to. I once had a vinyl recording of Richard Burton reading the poem (he appeared in a film of Under Milk Wood in 1971), and I've never forgotten the creamy, seductive quality of his voice. The legendary charisma, the magnetism of the man, is something I missed in Rhys's performance. Thomas comes across as a strangely pallid, even secondary, figure compared with the women in his life.In his previous film, Love Is the Devil, Maybury explored the turbulent life of painter Francis Bacon and his sadomasochistic relationship with his lover and model, George Dyer. The Edge of Love seems to me a richer and more satisfying film. If you ask what insights it offers into the springs of Thomas's creative inspiration, I would have to say Llareggub. But as an insight into his egotism, his smouldering moods and his general indifference to the feelings of others, it is wonderfully sad and revealing.Thomas had a good war, boozing and writing while other men (including Killick) were being traumatised by the horrors of battle. In one scene near the end, Thomas's behaviour towards his friends seems unforgivably callous. But this is not, after all, Thomas's film. Murphy gives us a magnificent study in doomed passion and the emotional debilitation of war. Miller is charming and pathetic as the wife. And Knightley looks almost too exquisitely delicate to be real (as she did in Pride and Prejudice). But this is probably her finest performance. And in every respect the film is worthy of her.","With its ww2 timing, falling in and out of love, and easy on the eye Kira, this is re-Atonement. This a relationship story with focused main characters working out the the balance between first and fast love in the home front of WW2. Poet Dylan Thomas philanders his way between wife and ex in dark and smoky Blitz London and later in windy wales. Vera's ex and next spark off each other as the poet and soldier become a sideline while the girls bond and share. An easy watch that works well in the era bouncing along with just a few dips in pace. Would work well with French subtitles but then I may have been to too many art house movies lately.","THE EDGE OF LOVE – TRASH IT ( C ) Keira Knightley's most Boring movie till dateShe & Sienna Miller looked gorgeous...But the movie didn't live up to the expectations the locations were stunning but the movie was very slow Cillian Murphy acted really well as always and I think Matthew Ryes was totally miscast (He only looked like Dylan Thomas), he couldn't stand up among them, he wasn't charming as Dylan Thomas was suppose to be, Anyways there was Bad Direction & Poor Writing as well Both Keira Knightley & Sienna Miller Couldn't Save this One though their Performances Were Really good. I really wished that if they worked on story a little bit more so it would have been more interesting and intriguing for us.","I was fortunate to attend the London premier of this film. While I am not at all a fan of British drama, I did find myself deeply moved by the characters and the BAD CHOICES they made. I was in tears by the end of the film. Every scene was mesmerizing. The attention to detail and the excellent acting was quite impressive.I would have to agree with some of the other comments here which question why all these women were throwing themselves at such a despicable character.*******SPOLIER ALERT******** I was also hoping that Dylan would have been killed by William when he had the chance! ****END SPOILER*****Keira Knightley did a great job and radiate beauty and innocence from the screen, but it was Sienna Miller's performance that was truly Oscar worthy.I am sure this production will be nominated for other awards.","An odd, willfully skewed biopic of Dyan Thomas in which we hear little more than a dozen lines of his poetry. Instead we have to endure a raw character exposée seen through the prism of his proto-bigamous relationship with wife (Sienna Miller) and childhood love (Keira Knightley). Matthew Rhys plays Thomas with sufficient charm to inoculate us against his otherwise repellent self-interest and Cillian Murphy makes up the persistently tense lovetet.The film never seems to decide on where it's going. There's no arc so much as a viaduct from one end of the war to the other. Maybury seems much more interested in his two female leads (who wouldn't!?) than in the man who brings them together and then divides them. Miller is the choice of the two (I found Knightley competent at best but then I have never found her sympathetic) but they both offer dreadfully inconsistent Welsh accents. Other funny decisions include too much for the inconsequential character of William (Murphy), arty production (eg double crossfades) that is neither impressionist nor symbolic and the old chestnut act of period footage which doesn't blend. 4/10","I'd like to think that there is a space in the market for \"intelligent\" and \"adult\" films which aren't just about exploding robots, hidden magic worlds etc. This film ticks many of the required boxes, but I think it plays into the hands of fans of non-intelligent and adult films who are always ready to say \"where's the story? What am I supposed to get excited about?\" There is a definite problem that there is no clear protagonist. It's very easy to be sniffy about McKie and Hollywood story structure: but, on the other hand, it's very hard to make a film unless you have a protagonist who is in jeopardy and who changes as a result. Vera (KK) probably gets the most screen time: but she doesn't really change much. William (Cillian Murphy) is the character who faces the greatest danger: but we don't see the film through his eyes. Overall, I think the performances and the film-making generally are good enough: there is also plenty of adequate dialogue and texture in the writing: but the story isn't really strong enough. It's really a Sunday evening, one hour, made for TV drama which fits very well with the remit of BBC television: but I can't see why it should be on the big screen. Re Sienna Miller as Caitlin, I heard Mark Kermode deliver a spectacular condemnation before I saw the film. I sort of agree that the accent is all over the place but that for me wasn't the real problem: I just don't think she is mad and bad enough. The gooey ending with KK and SM struggling to part, and sort of promising always to be friends, is absurd. At no point in the film has their friendship ever been an important issue for the audience, and it is ridiculous to expect the audience to start caring about it here.","This is a masterful piece of film-making, with many themes simmering and occasionally boiling over in this warts and all study of the poet's bohemian, self-indulgent wartime years that span the aerial bombardments of London and the outward tranquillity of a Welsh coastal retreat - the borderlines between friendship, lust and love, dedication to art and experience versus practical concerns, jealousy, rivalry, cowardice and egotism versus heroism and self-sacrifice and more. A mature, subtle script that suggests and occasionally brings into dramatic focus the underlying tensions is well served by perfect performances (apart from the odd inappropriate smiling that Keira Knightley is prone to, though perhaps under direction this time as the other characters themselves often mention it). But above all the exquisite visual composition of each moment, with inventive and elegant use of close-up, camera angle and lighting, including pointillistic faux home movie footage, is a wonder and joy to behold. It's as continuously beautiful to look at as a Bertolucci, but the relationships here are more convincing and the narrative more engaging than some of that master's work. A very rare type of film these days - it holds the attention and stirs the emotions without abandoning artistic integrity and succumbing to manipulative, superficial shortcuts.","Quite disappointing actually. I was never a great fan of 'Atonement' and this movie does nothing to rehabilitate Keira. She was wonderful in Pride and Prejudice and I loved her in Love Actually. In this movie Sienna Miller was better. The famous poet was not very sexy and William the beloved husband looked like a stiff. Why was Vera suddenly so very much in love with him? She did not even like him when they married end only her own letters made her romantic toward him. The war-scenes looked like they were copied from Atonement and were not very realistic. The pace of the movie was OK and kept me in my chair, but the rest sorry. No.","This film is about the complicated friendship, romance and deceit between two men and two women during the World War II.A lot of effort has been put to make \"The Edge of Love\"look the right period. However, I find this effort too excessive, particularly in terms of the tone of the colours. Most of the first half of the film is processed so much to have a strong bluish tone. It's hard to make out who's who in this tone.Another detrimental point is the fancy use of image splitting lens. There are many scenes that have three or four images of the same thing, such as three Keira Knightley smiling face or four pairs of arms in embrace. That simply makes the film confusing and hard to follow, instead of being artistic.As for the plot, it is plain boring. The way the story unfolds is not engaging at all. Sienna Miller's unstable character is annoying. In fact all the main characters are annoying and unlikeable. Keira Knightley's accent is impossible to understand, making it a further impediment to understanding the plot.I strongly advise avoiding \"The Edge of Love\", unless you watch a film only to appreciate great costumes, nice sets and lighting.","This film fails on every count. For a start it is pretentious, striving to be \"significant\" and failing miserably. The script was banal in the extreme, nobody at any time said anything remotely interesting. It was impossible to care about any of the characters. Knightly was a self-regarding waste of time whilst Sienna Miller was just a waste of time. The bit about the soldier who went off to war was a cliché even before the film Atonement used it. The use of the Second World War as a backdrop was in itself a cliché...the bombs, the sheltering in tube stations etc...employed to import a bit of much-needed drama. Why anybody thought for a moment that this film was worth making is quite beyond my comprehension. It was yet another case of \"let's get the costumes looking authentic, never mind about the story, the script or the acting!\"","It's the blitz over WWII London. Nightclub singer Vera Phillips (Keira Knightley) reunites with old flame poet Dylan Thomas (Matthew Rhys). His unstable wife Caitlin Macnamara (Sienna Miller) joins them. British officer William Killick (Cillian Murphy) is taken with Vera. He eventually gets her to marry him. He leaves for war and she discovers that she's pregnant. She joins Dylan's family in Wales seaside homes. The style leaves the movie feeling artificial. The problem is that it infects the characters' overwrought romances. Everything and everyone feels fake. In the first half, it's hard to watch these great actors putting down big emotional scenes that ultimately don't work. Leaving London does help to strip the movie of its glossy unreality. It allows the emotions to gain true weight. The second half is better but it's not quite enough.","THE EDGE OF LOVE. I even found the title intriguing. Can the edge of love grow in many strange directions? Does madness live beyond this edge? At times, it feels like the film seems to be missing something. It's hard to describe. It's either that or it's just that sometimes you feel strangely disconnected from the characters, which somehow makes it even more difficult to stop watching and just turn off. You just can't seem to turn away from this private little world in which one man and two women live. John Maybury definitely has his own unique \"grammar\" in film, which he himself makes fun of along with actor Matthew Rhys in a commentary track which is as much fun as the movie itself.THE EDGE OF LOVE is set in WWII London and Wales, and is based on the life of Welsh poet Dylan Thomas, played to perfection by Rhys, who obviously had tons of fun doing it, capturing the poet's childish yet magnetic vibe. Sienna Miller, an actress who deserves to be known for more than just her personal life splashed in tabloids, plays Dylan's charismatic, sexy yet formidable Irish wife Caitlin with extreme skill.There are other women in Dylan's life, of course, but only one poses any real threat to Caitlin: a Welsh woman named Vera (Keira Knightley), a gorgeous creature who sings cabaret in the underground pubs of London as bombs shake the ground above. Vera is Dylan's childhood friend and \"soulmate\". The bond between the two is inexplicably vibrant on screen. Again, it's like a private world that you are only ever afforded a glimpse into, yet cannot resist. It's like visiting aliens. Dylan loves Vera passionately, yet he is married to Caitlin, and honestly loves Caitlin too. Caitlin grows to love Vera as a best friend, though she does give Vera fair warning that if she messes with Dylan behind Caitlin's back, there will be hell to pay. It's so bizarre to see these two young women having so much fun together, enjoying each other's companionship while this undercurrent of jealousy seethes. Dylan of course loves the attention of two women at once, but there is this palpable lack of malice. All you feel is this childish wonder in him.Just a tip for those who might be curious: There are no three-way sex scenes or situations other than Dylan loving both his wife and his childhood lover at the very same time, while the three live in the same house.Early in the film, Vera, as much a modern free spirit as Caitlin, meets an English soldier named William (Cillian Murphy) who falls in love with and marries her. Does she return the love? Vera doesn't know. She tells him that only after he comes safely home from fighting overseas will she let him know. He is only gone for a year, give or take, but he has seen enough horror to scar him for life, and William is still so disturbed by the mysterious bond between his wife and Dylan Thomas that what happens next is inevitable. Murphy's acting is top notch, as per usual, and William becomes the one character in this foursome dynamic that you can actually relate to on any level. You can \"become\" William, and then, again, it's like you're among aliens, childishly innocent and idealistic aliens who are also extremely narcissistic, shameless samplers of everything life has to offer regardless of who gets hurt or destroyed, yet never truly meaning to \"hurt\" anyone. Theirs is the belief that you can love many people in your life, that you can have be involved sexually with many people without it affecting your capacity to love your spouse. Dylan Thomas has plenty of poetry \"groupies\". Caitlin also indulges in sex on the side with various men. Again, the only true threat to Caitlin is Vera, if Vera and Dylan sleep together. Because then it \"means\" something. The threat to William is obvious as well.It is only after Vera has William's baby that she begins to realize that there is something to be said for having someone love you, actually love you, for real, in the \"real\" world. The dreamy little universe she has shared with Dylan no longer sparkles like it used to, because the unexpected love she feels for the husband she has taken for granted has changed her. Dylan, however is not quite so ready to give up the notion that Vera's heart is his. When Vera reads Dylan his pedigree and tells him that William \"makes her real\", it redeems her character, defines it. Ultimately, the three-way bond between Dylan and the two women has to be cut. This means the end of the fragile friendship between Vera and Caitlin, but it leads you to ask: Was it really a friendship? Was anything between these three \"real\"? Or was it all this world of ignorant bliss and sexual freedom?Like this review, THE EDGE OF LOVE is strange and hard to describe. You can call it a highly unusual romance/historic war drama/period piece, very quirky, with memorable visuals and great acting by all four leads. One thing's for sure: it's different.","Keira Knightley and Sienna Miller stars in the story of two of the women in the life of Dylan Thomas. Knightley is Thomas's boyhood sweetheart he re-encounters during the Blitz. Meeting at a bar they reconnect, however things become complicated when Thomas' brings his wife (Miller) along the next time he meets her. The women hit it off and things proceed at pace until the trio are joined by the man who will become Knightly's husband. This further complicates things as jealousy begins to show its face.Beautiful to look at, extraordinarily written and wonderfully acted (everyone disappears completely into their roles) this is a sumptuous feast for the eyes and the ears. It's so nice to see a film about adults being adults. On a purely visceral level I really enjoyed watching the film because the film is so artistically pleasing. Rarely have I ever seen a film that is this beautifully crafted.The trouble with the film is I'm not entirely sure of everything that happened. Something seemed to be missing and a couple of times I had to replay the film to see if I missed something. Its not bad, but its not completely satisfying as a result. (I tried to look up on line to see how much of the film is true but I couldn't find anything) Still I think this is a film worth seeing. It's a beautiful film for adults with probably the best acting the leads have done.","I saw this movie last night and must admit I was not eager to see it. However, I came away extremely moved by the way a simple plot was handled and acted.Please see this movie and do not assume that it is a 'love story', It is in fact a very moving and strangely worrying depiction of human behaviour and attitudes to personal and social issues of both 'then' and 'now' Please see it.I was also pleased to see some new and raw talent being used highly successfully in Ciallan Murphy. I haven't experienced this kind of sincere and human display of emotion for a long time. I was reminded of a young Dirk Bogarde and although that may not be fashionable by today's standards, I found it very refreshing and extremely hopeful for the movie industry. More please!!"],"review-user":["Chinarose77","seawalker","rogerdarlington","pdelamore","detkor","anon_is_good","chaney1888","jennymurphy1990","Chris_Docker","aidan-mann","jmelvin1-1","bartekfm","gannett","saadgkhan","lostidols","Framescourer","kjewitt","stowbury","staveren-1","Gordon-11","tcleeve","SnoopyStyle","PeachHamBeach","dbborroughs","murphy-boy"],"review-date":["19 February 2009","1 July 2008","13 July 2008","23 July 2009","7 October 2008","19 June 2008","10 October 2008","8 July 2008","17 June 2008","28 June 2008","16 November 2008","8 March 2009","11 November 2008","28 July 2010","23 June 2008","17 July 2008","28 June 2008","3 July 2008","22 September 2008","19 October 2008","25 June 2008","7 August 2016","16 September 2010","20 October 2009","29 June 2008"],"review-rating":["5","6","7","10","5","6","8","10","7","8","6","7","3","9","4","5","8","5","1","5","9","7","6"],"review-title":[" Moments of Cinematic Beauty\n"," Not a bad film. Just one that could have been better\n"," A humanistic tale\n"," At times, edge of seat stuff\n"," Love divided by four.\n"," Worth a glance if you're REALLY interested otherwise it's not worth the entrance fee.\n"," With \"friends\" like these, who needs the Wehrmacht...?\n"," Give it a go..\n"," Best British Film of the Year?\n"," This film has moments of cinematic beauty.\n"," Portrait Of An Artist as a Bad Man\n"," An intense and strangely beautiful film...\n"," In a word \"re-Atonement\"\n"," Keira Knightley's most Boring movie till date\n"," Gritty Shades of Black...with One shining light.\n"," Meandering\n"," Is there really a story in there?\n"," An art-house movie of the highest calibre\n"," I am afraid I don't love Keira that much anymore\n"," Artistic execution of a boring tale\n"," One of the worst films I've seen for a long time\n"," overwrought romances\n"," Their own little universe...\n"," The performances and the technical aspects make this worth seeing\n"," See this movie.\n"]}