{"review-url":["http://www.imdb.com/title/tt0964510/reviews"],"review-text":["Jesse yet again delivers, after almost 12 months of hype about his upcoming production it finally reaches the dark world of the internet with more than a brilliant approach to amateur film making.DBP is a original, nail-biting commentary on a troubled child growing into an even more troubled adult. if i had more than two thumbs, i would give more, but i think two will be enough.Great work from all cast, especially by Marissa and Elizabeth, the character of Emily as an adult has given me shivers so far and i'm afraid of where she'll go next.An excellent watch","Drawn by Pain is easily one of the best pieces of cinema I have ever seen. Here are my reviews of the episodes released so far: Episode one was even better than I expected and from everything I had heard about it, I expected quite a lot. I am very impressed with the actors already. The father was creepy and played perfectly. The little girl is so expressive, she uses her eyes to convey such emotion. The animation was superb. The cinematography was amazing, each camera angle capturing the feeling of the scene perfectly. The editing was done so well, each scene blending seamlessly into the next. The music captured the emotions quite well and drew you into the story. I just can't say enough about how wonderful this episode was. It definitely whets my appetite for more! Episode 2 was even better than the first one! Everything I said about the first episode carries through, only you get to see even more of the character development. I can not wait to finally see episode 3, or the rest of the series for that matter. What is developing is an intriguing, character driven storyline with all the trappings of a big Hollywood production, but without the pretension. So much is said, with so few words. This series is something like you've never seen and perched to become a real success.This episode was FREAKING AWESOME! No other words describe it! WOW! Everything that I've said about the previous episodes holds true for this one, and yet it was even better! I don't know how you manage to take something amazing and make it even better! The further character development proves that this is a completely character driven piece. The cinematography excels as it always has and draws you into Emily's pain, fear, hate and emotional roller-coaster. I can't wait to see Episode 4... or the rest of the series for that matter. You have truly outdone yourself!As much as I have loved the other episodes, episode 4 is the best yet. I love the character progression. I feel like we are really coming to know Emily, her pain, and her internal struggle. The other themes I've stated in past reviews are continued. GREAT cinematography, the writing is superb, the actors are right on with their portrayals and have made the characters their own, and the animation is simply amazing! Another great job from the DbP crew!","This young filmmaker has a talent for capturing his audience quickly with unusual camera work and sparse but intense scripts. The concept here of combining animation with live footage is remarkably well-executed and the soundtrack is very good.The decision to release the movie in twelve parts online puts the onus on the director to make each episode fascinating enough for the viewer to invest in buying each upcoming episode. I only wish all motion pictures had this kind of commitment to keeping their audiences entertained throughout their stories.Highly recommended.","This new movie by Jeskid is awesome! Check it out and you'll be amazed. The story of Emily Waters, once a girl from a broken home, whose only means of escape from an abusive father was through her sketchbook. Until one night her drawings manifested into reality and saved her, and now using this power she fights against those who would do evil. Both live action film and hand drawn animation blend together to create a unique and original experience that will shake your soul and blow you away. The music is incredible as well, it really intesifies the emotional experience and draws you deep into the conflict. Directed by Jesse Cowell and animated by Erica Langworthy, starring the beautiful Marissa Parness, with music by Nico Audy-Rowland, Daniel Collins, Jeff Strathearn, Matt Sisco, and Selcuk Bor. Support this film and support Jeskid, he is a very talented guy. Go see his film Shades of Grey as well.","The story of a little girl who was driven once by fear and now by pain, she becomes woman and a vengeful crime fighter. Her power is to manifest strong anime characters onto herself. This movie fuses animation with live action as she wields her animated sword through all that stands before her. She struggles to deal with life, her demons, and her fears.Young Emily watched her parents fight and argue. She watched her Dad leave her motherless. Emily soon discovered she had the power to do something about it. Emily grew through life traveling as a loner and at night she had the power to make a difference in the world.This movie is a great blend of animation and real action. There are many themes and metaphors that run deep through the movie. This movie is broke up as a 12 part series.","Contains SpoilersBut if you weren't dropped on the head as a child and then used as a football then you'll agree with me that this is one of the worst and yet hilarious series ever made. Centreing round a woman who as a young girl was beaten by her father who also killed her mother, she spends her time drawing, but wait for it, then she becomes her superhero drawings and goes on to fight crime, therefore being \"drawn by pain\", so clever. The story itself is actually OK, but it's just how it's done, Jesse the writer and director has no idea how to write a script, just listen to a monologue featuring the 8 year old version of the hero and it sounds like it was written by a 30 year old man, while her dad, who sports a great moustache, just walks around the house all day while looking angry, just showing how bad the characterisation is, especially the bit where he gets angry in the first episode and begins repeating the phrase \"no more\" while holding his wife's head before killing her using the marble work surface. The following bang sound effect and just his terrible acting as all he can convey is angry just is brilliant, including after where he goes to beat his daughter using his belt which is all done with him moaning and looking angry in slow motion. The episodes themselves could contain easily a good clean script ranging over 5 minutes, but oh no Jesse doesn't want this. Little Jesse, is shitting out post modernism as if he'd just eaten Donnie Darko and then douched himself to death. Pointless camera jerks, all at weird angles, overly repeated lines and even pointless sequences just muddled up every now and again to fill the overlong episodes. In conclusion the idea isn't bad it's just how it's done, also there is a great character of a fat guy on a bench who doesn't come up enough and is great, i just wanna hug his Lil chubby cheeks cause they look so soft. The character development is non existent as the main character just says the first philosophical sounding thing that comes to her head although they all contradict one another. But all in all, mainly s**tIndiana Jones 4 however is much better, Type \"Jeeharv\" into you-tube as well, the results may make you weep at the beauty of the world also you'll hear a lot of cheap sex jokes, mostly gay ones."],"review-user":["swar_cr02","LadyPOC","Elnea","silverspaceship-1","holpar3","harvcw"],"review-date":["25 March 2007","22 March 2007","23 March 2007","24 March 2007","23 March 2007","23 May 2008"],"review-rating":["10","10","10","9","10","1"],"review-title":[" Drawn By Pain FTW!\n"," A Must See!\n"," Intense, gripping and well-executed\n"," Support Drawn by Pain\n"," A girl develops special powers through her drawings.\n"," If you liked Catwoman then you'll love this treat\n"]}