{"review-url":["http://www.imdb.com/title/tt0974014/reviews"],"review-text":["I saw the world premiere at the Toronto International Film Fest, this is a great film.Real-life husband and wife Paul Bettany and Jennifer Connelly star as Charles and Emma Darwin in the midst of their struggle through the writing of and decision to publish \"Origin of Species\". Their consideration of the ramifications it may have for their family and the future of humankind are conveyed in such a manner that one suspects only an off-screen couple could achieve.Jon Amiel (who gave a heart-felt introduction) and John Collee do and excellent job of bringing Randal Keynes' biography to life. They created some very poignant and human moments, great cinematography and sets and a generous helping of tongue-in-cheek about the still divisive theory of evolution.The surprise star is Martha West who plays Annie Darwin, the character around whom much of the story unfurls. She plays the precocious young girl to a tee. If this performance is anything to go by her star should be on the rise.All in all a great film, and although it is a period drama the issues that drive it are still very much alive today.","This is definitely a touching movie, and a great expression of Charles Darwins personal struggle. The movie is not only about his struggle to get his book \"the origin of Species\" published, but also his relationship with his oldest daughter. His daughter was at start the only person in his family to approve of his views, something that she as well had to pay for. Een more than him at times.Now, this is not an evolutionary propaganda film, as a matter of fact I think it managed to stay very neutral. A hard thing to do in my opinion. of course it does not condone the way the characters was treated by the church, quite the opposite actually. If you need me to use the big words to shed light on this film; it will be liked by deists and atheists alike, but goes away from theism. The movie talks about evolution, and that's it.Paul Bettany as Charles Darwin was incredible. Of course we all may think of Darwin as that old man with the funny beard, but this movie centers around the man in his late 20's, early 30's. Jennifer Connelly (Emma Darwin) is great as always, but the actor who impressed me was Martha West as Annie Darwin, Darwins daughter. Definitely on of the best child actors of the decade. The story is about Darwin and his daughter, and it is beautifully acted.Except for a few jumps in time that was momentarily confusing, the production of this film is pretty flawless. Some scenes were Darwin observes nature is just marvelous, and is almost like taken out of a high production National geographic documentary.I must admit though, I'm not quite sure of why they chose \"Creation\" as the title. I doubt it is an irony, the movie is too respectful for that. Well, I'm sure there's a meaning too it, just don't let it scare you away. I give this movie a 9/10. This is truly a great tribute to Charles Darwin, and please give it a chance.","Bettanny & Connelly beautifully act out this biopic on Charles Darwin. The movie focuses on Darwin's personal life and how it was effected by his scientific endeavours. I believe many viewers watched this movie with a pessimistic mindset (maybe brought on by their own religious beliefs). Some, I believe, were offended by any mention of evolution. However, this movie does not attempt to argue for or against religion in any way! Instead it centers around the inner battle of a brilliant man, who's ideas were revolutionary and scorned. The movie gives a unique perspective into the life of Charles Darwin, and allows one to appreciate his works and convictions. This film is definitely worth seeing. The cinematography is well done, it is historically accurate, and the performances are sound.For one who wants to understand the man behind the theories, it is great! But you must see it, optimistically, as a focus on the MAN and not his theories.","Paul Bettany did a great role as the tortured father whose favorite little girl dies tragically of disease. For that, he deserves all the credit. However, the movie was mostly about exactly that, keeping the adventures of Darwin as he gathered data for his theories as incomplete stories told to children and skipping completely the disputes regarding his ideas.Two things bothered me terribly: the soundtrack, with its whiny sound, practically shoving sadness down the throat of the viewer, and the movie trailer, showing some beautiful sceneries, the theological musings of him and his wife and the enthusiasm of his best friends as they prepare for a battle against blind faith, thus misrepresenting the movie completely.To put it bluntly, if one were to remove the scenes of the movie trailer from the movie, the result would be a non descript family drama about a little child dying and the hardships of her parents as a result. Clearly, not what I expected from a movie about Darwin, albeit the movie was beautifully interpreted.","Of all the greatest men in science, Charles Darwin stands taller than most. His superior intellectual searching and inevitably, his persistent exercise in evolutionary logic, gave mankind the tools with which to eventually determine the Origins of Man. In point of fact, this film, ably directed by Jon Ameil, is called \" Creation \" and answers the eternal question for all open-minded students, teachers and inquisitive scientists alike. Moreover, the poignant film also endeavors to unveil a portion of the private life behind the real Darwin. (Paul Bettany) Darwin himself was not only a practical man, but a deeply sensitive father and husband. Herein audiences discover that throughout his life and during his subsequent marriage to his cousin Emma, (Jennifer Connelly) Charles pays dearly for his revolutionary ideas. The story touches his association with Captain Fitzroy (Ian Kelly), Joseph Hooker ( Benedict Cumberbatch) and his most ardent supporter Thomas Huxley ( Toby Jones). However, it also reveals just how deeply he loved his children, especially his favorite daughter Annie. (Martha West) All in all, the movie is exceptional and for audiences of every age, a Classic story. Highly recommended. ****","CREATION received wonderful reviews when it premiered at the prestigious Toronto Film Festival but, those reviews notwithstanding, the film had difficulty picking up a distributor in the US, apparently because of the fear that it would offend the religious right.The film is based on the book, Annie's Box, which was written by Darwin's great-great- grandson, Randal Keynes, so I don't suppose there's any doubting its veracity. Against that the film is very much focused on Darwin's family situation and the death of his young daughter, Annie, in particular and not on the great man's work. It's a sometimes powerful yet strangely uneven telling of the tale. We see Darwin as a family man who struggles to accept his daughter's death, a man who is torn between his love for his deeply religious wife and his own growing belief that God has no place in the world. He finds himself caught in a battle between faith and reason, between love and truth, all the while dealing with the death of his favourite daughter, Annie.Charles Darwin is played by acclaimed British actor, Paul Bettany, probably best known for his role as the mad monk in THE DA VINCI CODE (2006), while Mrs. Darwin is played by Bettany's real life wife and Oscar winning actress, Jennifer Connolly.There's a palpable tension between the actors, Connolly is particularly good as the understated Mrs. Darwin driven to distraction by the loss of her daughter and the consequent loss of her husband. Darwin's master-work, THE ORIGIN OF SPECIES, comes to light and the film depicts a cosy little world of English gardens in turmoil as a happy marriage is ripped asunder by the loss of a child.As a film that deals with the loss of a child and the resultant impact on what had previously been a perfectly happy marriage, CREATION works well. It's beautifully shot, with some touching scenes, not least of which concerns the death of an ape, which, when you think about it, is quite apt. What's less apt is hearing Darwin muse, \"What if the world stopped believing that God had any sort of plan for us?\" Why on earth would he care whether a God he no longer believes in has a plan or not? Which brings up the main problem with the film - as a movie about Darwin and the writing of Origin, it completely misses the boat. It's all religion and no evolution. Where's the Beagle? The Galapagos? Where are the vampire finches? Or woodpecker finches for that matter? Darwin has figured the whole thing out before the movie starts, he's even written most of the book, the film is solely concerned with the question as to whether he should publish or not.This is a film that, far from offending the religious right, plays straight into their hands by focusing not on the genius of Darwin but on the moral and religious dilemmas which he faced. It's an awful pity that a film about Darwin is mired in religion, particularly given that he was such a strong advocate for free thought on all subjects and that it was his stated object to avoid writing on religion, confining himself to science, believing, as he did, that the disciples of differing theories should not attack one another with bitterness regardless of their beliefs.It's just a pity that the religious loo-las of today aren't quite as even tempered, though I suspect such wilful ignorance would quickly melt even the great man's resolve. They have long since melted mine. And with that in mind, I strongly recommend going to see the film if for no other reason than to annoy the nuts from the religious right.","I believe the reason this movie did not get the recognition it deserves is because of the many misconceptions of Darwin, pro and con. I would say the real man is depicted here without sterility. He is what he is. Although the movie is but a snapshot of the man the technique of storytelling expanded his life far beyond the years touched on in the movie. This is deep movie, a pondering of modern life and the way we think, and can provoke a study into the man whose thoughts (and other who used him) have certainly affected our lives. There are some movies that the historical context is so great that it is the primary job of the actors to stay out of the way. The history carried the day and the actors did their job. Good work to them, I say.","This could have been a great movie with plenty of educational potential for teachers around the world about evolution, biology, the creative work in science, research and Darwin's life, but it is not.The screenplay is mostly historically inaccurate and transforms a true story into a Mexican soup-opera melodrama. While it is true that Darwin gradually lost his religious beliefs, this was in great part due to his findings during the voyage of the Beagle and not solely due to the loss of his daughter. He was certainly disturbed by his loss, but that did not made him literally insane, delusional and detached from his friends and family. The such portrayal of Darwin is an invention of the script writer. Thus it cannot be used in any way as place to learn a bit about Darwin's life and psyche. According to most historians, Darwin had the theory ready by the end of the Beagle voyage, and kept it from going public because he wanted to develop further the consequences of it and check against more data. In the movie, it is an imaginary conflict of Darwin with his religious beliefs and the mental illness that he developed after his daughter's death that kept him from going public.The movie brings a modern situation, the creationists vs scientists debate, into the life and times of Darwin, thus it is anachronistic. It depicts Thomas Huxley not as a man trying to develop further understanding of biology but as someone eager to \"kill God\", in his own words from the movie, and destroy the church, who would accept the theory of evolution for such purposes and not because it was a synthesis of plenty of disconnected data. Huxley is presented as a very arrogant and insensible person, a combination that I interpret was an attempt to ridicule active atheists who speak up against religion. In real life, Huxley accepted Darwin's ideas after publication only gradually, and before the work of Darwin he thought that there was not enough evidence to support evolution. His first support of evolution was published one month after the Origin of Species became public. He was agnostic but did not think it was necessary \"to kill God\", only thought that there was not enough evidence to believe in the supernatural. The debate creationists vs scientists appears throughout the movie, and creationists catch-phrases such as \"It is only a theory\" are part of the discussion. Of course, no such dispute or catch-phrases existed at that time. In fact, the Anglican Church published a positive review of the Origin's saying that they saw God's work in evolution, in some sense, quite in fact in contradiction to the way that the clergy is portrayed in the screenplay.Another awful aspect of this movie is that it gives the wrong impression to the general public that scientific research is done by a solitary crazy man who just writes a lot. Nothing could be further from the truth. The conception of the theory of evolution was the result of thorough observations of living forms by Darwin during five years in the HMS Beagle, and was developed gradually as it can be seen from Darwin's notes of the voyage. Even though the Beagle voyage was the sole most important part of Darwin's life to the conception of \"Origin of Species\", the voyage is briefly mentioned only once at the beginning, and no attempt is made to show that the book came as an elaborate analysis of observations. To make it worse, Darwin is shown performing a single experiment (pigeon breeding) to test his theory and, in the end, quits it. And I'm not really sure whether such experiment did actually occur.Great disappointment. It is not in any way a homage to Darwin and science.","As you sit there, quietly evolving, spare a thought for Charles Darwin. He was more than the venerable man with beard you may remember from your schoolbooks. He had a wife and children, and spent much of the long hiatus between writing his big theory and actually publishing it, coping with his wife, beautiful Emma, who, if she looked at all like actress Jennifer Connelly, was beautiful, but not at all ready to give up on God. She was also having to deal with Darwin's all-consuming guilt over the fatal illness of his eldest daughter, for which he seemed to have believed he was responsible in at least one way.This, Charles Darwin's homelife, is colourfully evoked in the slightly Gothic new film, Creation. As it opens with a flashback to a failed attempt to steal 'savage' children from a Pacific island and take them home to convert them into Good Christians, it has us on its side from the start; even more as it nods to Francois Truffaut's 'L'Enfant Sauvage'. Paul Bettany as the man himself is on-screen most of the time, like a contestant in the Channel Four 'big brother house' permanently in close-up. The way the story jumps backwards and forwards in time gives it the feeling of a ghost story too. And there are other pieces of Darwin's life we rarely get to think about, such as the relationship he built up with the female ape, stolen from her jungle family and living in solitary confinement in an English zoo until her death. All in all, it's quite an emotional roller-coaster, although not at the expense of recreating the world of the late Victorians very convincingly.","I saw this film on 19SEP2009 at the Cambridge Film Festival. The Beagle's only in a couple of short flashbacks, the whole thing is about Darwin's life from 1841 to 1859, when he was ensconced in Kent with his growing family, 200+ pages of Origin had already been drafted and he was wondering whether to complete the book. The script is based on Randal Keynes's book Annie's Box (Annie, Charles's daughter, died when she was 10). It is mostly a family drama, but does include sex scenes - however, the participants are married, both on and off screen. Not too exciting, not much science but a well-made film that's pleasant to watch and pushes the right emotional buttons. A bit of a romantic weepie, actually. I suppose the conclusion is that you can be an agnostic free-thinking scientist from an atheist family background and still be an emotional romantic as well as an excellent father. Some of the characters and Darwin himself state or wonder whether he \"killed god\" but the viewer is able to doubt that. What is beyond doubt, given the deadly struggle for survival and the web of predation on the meadow-bank (well-known before Darwin and completely uncontroversial) and the failure of Darwin's prayers is that the idea of a kind, providential god who loves \"his\" creatures is untenable. I really cannot see many Americans objecting to it very much. Some may have problems with the title, which is probably the most controversial thing about the film, or with the fact that Bettany does not have horns, a tail and a pitchfork.","I just finished watching Creation and to be honest i am a little confused about what the director tried to tell. The most part of the movie is dedicated to the family life and the sufferings Darwin and his wife endure because of the death of their daughter and illness of Darwin. The story speaks very little about Darwin's struggle to publish the theory and the debate around Theory of Evolution in the society at that time, which to me, would have been the essence of Darwin. That said, the movie is made beautifully with amazing cinematography and art direction. I love the background score of piano and violins creating a sense of melancholy and drama in the story. Some dialogues are also very well written and stays with you afterward. However, don't except to witness the struggle of a scientist that has a proved thought against the society and church. This is a family drama of a scientist's life. I give it 5/10.","There are spoilers in this review, but if you know about the life of Darwin, this won't spoil the movie for you.Many people have speculated that Darwin was inspired to write chapter three of the Origin (The Struggle for Existence) by his own experience of watching his beloved daughter Annie die. This movie dramatises this concept and extends it by speculating that Darwin was haunted by this memory (and even by Annie's ghost) and only finds peace by finally publishing his magnum opus. It is a good concept and was the basis of a best selling book, Annies Box.Much of this movie is well executed. Let me list what is good about this movie:1) Paul Bettany & Jennifer Connelly & whoever played Annie Darwin. They were perfect, period detail was beautiful. 2) The premise. The concept is simple and accurate to the history of his life. Darwin's life is changed utterly by the death of his young daughter Annie. He sees that nature is merciless and loses his faith in God. He was a polite society man, a loving father and never wanted to cause a controversy. He was therefore tortured by his theory and procrastinated endlessly about publication. Haunted by the memory of Annie, the insistence of his friend, and finally a letter from Alfred Wallace (who has independently come to the same theory) Darwin finally decides to publish. What went wrong: 1) The direction. This movie has very frequent flashbacks and flashforwards. OK that's good, but not if the viewer is sometimes confused as to whether this is the past or the present. In the present Darwin sees Annie as a ghost or a hallucination who goads him to finish his book and in the past she is his real living daughter. There were scenes when I had to ask myself was this Annie as the ghost or was this in the past? The only way to tell was to look at Paul Bettany's hairline! 2) The script: Was this about Annie? about Darwin? about the publication of the Origin? I think it is meant to be about all three and perhaps that is too much to take on in one movie.3) The pace. The first 30-40 minutes were excellent and set the movie up for some dramatic point where Darwin is finally goaded to publish. However the remaining hour is spent with scene after scene about Darwin tortured about his theory and his illness in the present, Darwin tortured by watching Annie die in the past, Darwin tortured by his losss of faith and increasing distance from his wife. It seems like it takes a full hour for Annie to die. This was viewer torture.Perhaps the life or Darwin is not really suited for cinema. The man was the ultimate patient nerdy scientist. It took him decades to develop his theory and decades longer to publish. He was a loving father, he was tortured by his theory, and he became an atheist in the end, much to the chagrin of his wife. He wrote so many letters that there are many excellent and fascinating biographies of him. He remains one of the most fascinating men of all time, which just adds to the tragedy that this movie is not better than it is.There are some good scenes in the movie, but ultimately it was sadly a bit boring by the end. Don't believe the nonsense talked about this being too controversial for the US, in reality it is simply not controversial enough.","\"Creation\" is a partly biographical, partly fictionalized account of Charles Darwin's relationship with his eldest daughter, Annie and his wife Emma as he struggles to write On the Origin of Species. It is based on real-life letters and documents of the Darwin family. Hence, the movie delves very deep into the life of Darwin.Cast wise, I can't complain. Paul Bettany delivers in what is an award winning performance as Charles Darwin. His dialogue delivery, costume, posture, expressions etc gives us clear insight into the kind of dedication and authenticity that has been incorporated into the movie. Jennifer Connelly as Darwin's wife Emma depicts the internal conflicts going on in her mind owing to his controversial book and daughter's death is a splendid way. Rest are very notable in their role.\"Creation\" is a bit slow, but that's very important to understand the turmoil and mental instability and social burden endowed by Charles Darwin into writing his revolutionary yet controversial book during his times. The manner in which Charles Darwin struggles to find a balance between his revolutionary theories on evolution and the relationship with religious wife, whose faith contradicts his work is pictured and acted wonderfully. The Cinematography is beautiful and the Soundtrack by Christopher Young truly deserves more recognition.Overall, \"Creation\" is a very good biographical movie. It moves slowly through the entire spectrum of Darwin's life. It's a slow,but beautiful and faithful bio drama. A must Watch.My Verdict : 7/10","The film is worth a watch, probably rented on DVD as opposed to in theaters. It presents an argument (science vs. religion) that has been raging since Darwin's time, and it does so without forcing the audience in either direction. No one can deny the importance of such an argument, and that alone gives the film some weight. Sadly, the film ultimately abandons this line of thought in favor of family melodrama, centered on Darwin and his wife. This is also well-executed, but it fails to maintain the very high initial level of interest. Nonetheless, in both halves Paul Bettany gives a noteworthy performance as Darwin himself.After watching the film, I found the trailer to be rather misleading. It focuses solely on the first half of the film (science vs. religion), and frankly the film should have as well. In spite of this, overall it is a well-made period piece that people should check out. Fans of melodrama will probably enjoy it more than those who were looking for evolutionary debate, but it contains enough of both to keep audiences interested.Full Review at MacGuffinFilmReviews.blogspot.com","CREATION is not a film about the development of Charles Darwin's Theory of Evolution, and if that is what the audience expects it will be disappointed. What this little film presents instead is the midlife crisis (the film takes place in 1858-59 and Darwin was born in 1809, having completed his 1840 'Voyage of the Beagle' after the famous time he spent from 1831 -36 on the HMS Beagle as a naturalist gathering data) when Darwin had made his observations of nature and natural survival of the fittest and was struggling with writing of 'The Origin of Species by Means of Natural Selection', a book that would threaten to incise his relationship not only with Christian society but also with his fervently religious wife Emma. It is a story of the tortured man coping with the dichotomy between science and religion, between a man obsessed with his scientific discoveries while longing to be a good father to the children he loved. Yes there is discussion of his scientific theories, made mostly in his stories he told his children, but the book on which it is based, Randal Keynes 'Annie's Box' (Keynes is the great great grandson of Darwin) - a book of diaries and quiet notes about the Darwin and his oldest daughter Annie whose death as a young girl nearly destroyed Darwin - is more concerned with opening the windows to the family life of the great scientist than expounding the scientific theory we all know so well. John Collee's screenplay serves the film well as does the careful direction of Jon Amiel. Charles Darwin's presence is illuminated by Paul Bettany's performance and the difficult role of his wife Emma is played with great sensitivity by Bettany's real wife Jennifer Connelly. The pivotal role of Annie (Darwin's eldest daughter who seemed to have inherited all of the curiosity and imagination of Darwin) is portrayed by first time actress Martha West (daughter of actor Dominic West): it is Annie's death that alters the course of this story, that event and the final reconciliation between Darwin and Emma after Emma actually reads the completed book (The Origin of Species). The supporting cast is excellent: Jeremy Northam is the unforgiving cleric Reverend Innes, the other Darwin children are very natural in their acting - Freya Parks, Harrison Sansostri, Christopher Dunkin - and Toby Jones adds sparks as Thomas Huxley who declares that Darwin's theories prove that God is dead! The cinematography by Jess Hall is excellent - especially in the scenes involving man's first connection with the apes. The musical score by Christopher Young rather blurs all the action into a Victorian mush, but the actors and director are able to make us forget that ill- conceived add-on. In all, the film is a family story - it just so happens that the family is that of a great man about whose personal life we know very little. Impressive work. Grady Harp","On the Origin Of Darwin. In my opinion he is the unofficial founder of freethinking. He may not have been the first to challenge the beliefs of Christianity but upon the publication of his literary work, \"On The Origin Of Species\", everything changed. By everything I mean the very purpose of life and a step closer on mans endless journey for meaning. Science took a rapid leap forward in its race with religion and subsequently modern science was established. For Britain this proved both a shining moment of conquest and a deadly blow to their status amongst the Vatican Church. Needless to say it's been over a century since Charles Darwin passed away leaving only his work to be marveled at by modern scientists, and his life to be immortalized by modern filmmakers. Who better to do so than BBC films with their adaptation of Randal Keynes' (a distant relative of Charles Darwin) biography entitled \"Annie's Box\". The book was written to tell the tragic tale of Charles and Emma's eldest daughter Ann Elizabeth Darwin. Her life was cut dismally short due to a strange illness that is yet to be identified. Our story picks up after Darwin's, who is played by British talent Paul Bettany, voyage around the world, but before having penned his most famous work. He lives a troubled life in the countryside of England with his family and loving wife. His wife Emma (Jennifer Connelly), a devout Christian, doesn't share her husbands love of science and for the most part tries to ignore his research. This barrier has an awful affect on Charles' health that dwindles due to an inner battle that forces him to choose between science and religion. His only crutch is his eldest daughter Annie (Martha West) who manages to evoke her father's happiness in a way no one else can. But his relationship with his daughter is beginning to way heavy on the rest of his family who feel rejected by a man who is struggling to come to terms with reality. Those who know the history of Darwin's life will be overwhelmed to find a film that so justly portrays his most personal events. Directed by Jon Amiel (Entrapment) and written by John Collee, \"Creation\" travels the less obvious route of highlighting a period in Darwin's life that proved most challenging. Those expecting a biography of his life from start to finish will be disappointed, but might rejoice in the fact that it focuses on a time of far more importance. There is a multitude of layers that encompass this story involving a deeply moving rendition of a loving father, devoted husband and a keen scientist. For Paul Bettany this role is clearly a career highlight allowing him the chance to play a British icon in a way know one would have imagined. His own intelligence, knowledge of the character and ability to immerse himself in character is precisely the right mix for a role of this sort. Paired up with his wife Jennifer, herself a fine actress, and you have pure magic on screen. She was the obvious choice for the role of Emma Wedgwood, a woman blindly devoted to the church, which she brings to life elegantly yet with a sharp presence. Their on screen chemistry is made easy by their off screen relationship, but never for a moment do they lose sight of their epochal roles. Every scene in this film is accompanied by intense emotional drama, and it is this drama that makes \"Creation\" more than just a biopic. There is a lot to be learnt from this story and will certainly be an education as to the impact Darwin's life had on the course of history. What BBC Films have added to the production is their understanding of natural history and how to capture its brilliance. Over the years we have been exposed to our natural world in documentaries such as \"Planet Earth\", which have managed to capture the very essence of our world. In \"Creation\", you can look forward to a few scenes that pay homage to these documentaries and the incredible work of the BBC. This is a perfect marriage of dramatic structure and historical fact combined into a film that will leave you with a greater understanding of the life and times of Charles Darwin and his immense contribution to life, as we now know it.","Creation was a great idea for a movie, but failed at delivering it.Both the story of Charles Darwin and his theory are interesting and add something to the other. It isn't a battle against religion, but there's a side-effect to science that pushes you away from God. Both Darwin's theory and life reflect this. However, the problem with this movie is that it's not equally divided and all-together too long.Part of the movie has interesting scenes that show his theory in relation to life. The bigger part of the movie is trying to be sentimental about Charles Darwin losing a daughter. This would be fine if it weren't for the biggest part of the movie and if it weren't done in such an easy uninteresting way. I've been more engaged by a lot of cliché movies than by this. I can deal with the use of flashbacks, but bringing the hallucination of a daughter in to ease the narrative and form a repetitive reminder of how sad things are, that's too much for me.If you're going to tell a boring story about a father who has lost a daughter, you don't need Charles Darwin to do that. It's a pity because there was a lot of potential.","This film was a bit of homework for me, since I'm studying Darwinism this semester. 'Creation (2009)' is an account of naturalist Charles Darwin (played by Paul Bettany), whose book \"On the Origin of Species,\" published in 1859, is probably the most influential and important work in the history of science. It is commonly believed that Darwin delayed publication for twenty years, possibly due to a religious conflict with his wife Emma (played here by Jennifer Connelly). However, my preliminary research seems to suggest that Darwin didn't dither at all, instead withholding publication until he was certain that his theories were empirically supported. Certainly, the film does linger most emphatically on the former – probably apocryphal – version of Darwin's life, with particular emphasis on the death of daughter Annie. Did Darwin really blame himself for Annie's death, having married his first-cousin? The narrative of 'Creation' does a lot of temporal jumping around, often cutting to flashbacks without any warning, and bizarrely giving Darwin schizophrenic visions more at home in 'A Beautiful Mind (2001)' (which, by the way, gave John Nash visual hallucinations that the real economist never experienced). I would have liked some more focus on Darwin's voyage aboard the Beagle, especially the work in the Galapagos Islands that first spawned his theory of evolution by natural selection.Still, this is a beautifully-made film, and Bettany and Connelly give superb performances that are sure to empty the proverbial tear ducts. There's one absolutely stunning sequence, a time-lapse montage, that depicts the apathy of organismal interactions; the world as an indifferent \"battleground\" in which only the fittest survive. It's a hard pill to swallow, but then it's the only pill that isn't a placebo.","Real-life husband and wife Paul Bettany and Jennifer Connelly star in Creation, which recounts the period of Charles Darwin's life prior to the publication of \"On the Origin of Species\" in 1859, his infamous, world changing tome on evolution and natural selection. Darwin's research created an enormous rift, a schism between the believers of his day and scientists. He was said at the time to be going to war against God, and even to have \"killed God\".The film revolves around Darwin's life with his wife and four children. Jennifer Connelly is excellent as his extremely devout and loving wife. A revealing scene at the beginning when she leads the dinner table in prayer and Charles fails to say \"Amen\" is foreshadowing of what will follow and of the stark differences between the two. She is convinced that he will be eternally damned and bring misfortune to their family by rejecting God.Darwin is torn between his strong love for his wife, her faith and his even stronger reason. There are beautiful moments of him observing animals, dissecting their behaviors and the sequences that make up their lives, explaining phenomenons of selection to his children, the first born, Annie, having a very morbid curiosity. We see him interacting with England's first orangutan, Jenny, playing with it as if it were a child, deciphering her every look and action. Annie, the eldest child, later dies and Charles becomes haunted by her death, having been closest to her. In my opinion this part was too long, bizarre and drawn out. I did not like the trippy scenes where he seems to be losing his mind and is pursued by the ghost of his daughter, shouting and ranting. Although Charles thinks that his wife blames him for her fatal sickness, she very poetically says: \"The truth is, if I knew then what I know now, I would marry you tomorrow\". Their bond is solid and unbreakable despite tremendous differences of belief. When Charles finishes his manuscript he hands his wife the final copy, telling her she can burn it if she does not agree. She stays up reading it nights on end and finally presents him with a package, the book ready to be sent to its publisher. In the end, reason and perhaps love as well, triumph, as he makes an accomplice out of his staunchest adversary.It is fascinating that Darwin received a full Christian burial at Westminster Abbey, proof that his ground-breaking ideas were seen as controversial of course, but were already then recognized as vital knowledge for the advancement of the human race. The movie definitely draws heavily on Darwin's family life, its joys and its troubles. I happened to like this aspect but Fabio said it was like watching a documentary on, I quote, \"Hitler's passion for ping-pong\". This is true in some respects and I can't disagree with his desire to have learned more about Charles Darwin's theories from this film than we do. It remains nevertheless a well executed and flawlessy acted period drama. My rating: 7 Fabio's: 7 Total score: 14 Please visit http://paulinasmovies.blogspot.com and become a follower to read more reviews!","'Creation' premiered in North America at the Toronto Film Festival to rave reviews, then opened in a handful of cities across North America and seems to have sunk out of sight. Several of us petitioned to have it shown more widely, but nothing came of it. The National Center for Science Education tells me this seems to be lack of interest, rather than any particular anti-evolution campaign.Having now watched the Blu-ray release, my reaction is mixed. It's a superb acting job by all concerned, especially new-comer Martha West as Darwin's eldest daughter, Annie, who perfectly portrays the spirit of Charles' and Emma's 'dear child' who died at ten. It's easy to see Paul Bettany as Darwin, in perhaps the first film version to show the invalid Darwin suffering from nausea, shaking palsy, and hypochondria. His spirit of scientific inquiry is caught as he makes notes on the newborn Annie, and later uses the same approach on Jenny the Orang-utan.The film is not (and perhaps does not try to be) an historical account, nor is it a scientific documentary a la Nova. 'Creation' I think refers more to the agonies of Charles Darwin wrestling with the scientific, philosophical, and personal issues inherent in his study of evolution, and specifically the Creation of his book, Origin of Species. The well-known themes are present, but presented with great intimacy: Charles' physical reaction to the suggestion 'You have killed God, Sir!\", his delay to publish Origin in consequence of psychosomatic illness, the arrival of Alfred Wallace's letter, and the final flurry of writing. The ghost of his daughter hangs figuratively (and in the movie literally) over this act of Creation. Annie can with her father dispassionately watch a fox catch a rabbit, while her younger sister cries \"Not fair!\" Factual and errors and misleading interpretations cause me to deduct one star. Emma was not Catholic. There is no basis *at all* for the major theme of sustained brittle tension between husband and wife over Annie's illness and death, or over religious differences: the documentary record is they were a loving, devoted couple throughout this period and indeed throughout their marriage (see Deborah Heiligman's \"Charles and Emma\"). There is no evidence of a sexual dry spell: they had ten children, before and after the Origin. Creationists will delight in several erroneous notions: Huxley is not a horrid diminutive atheist. Nothing in the record or Darwin's nature suggest he tried to make a Deal with God to save Annie's life. The Theory of Evolution is not the tortured reaction of a father who has lost faith upon the death of a child. The Darwin's country parson was a narrow-minded fellow who both disliked, not a wise spiritual counselor.And yet I would recommend this film to anyone interested in the Darwin story: the process of scientific creativity, the workings of the scientific mind, and the dynamics of the real-life husband/wife team of Bettany and Jennifer Connelly as a key to the historical couple.Supplementary materials include interviews with Lewis Wolpert, world famed developmental biologist who's take is similar to that of Richard Dawkins; a theistic evolutionist who thinks natural selection is the way God works; and a self-labeled Young Earth Creationist who thinks the outstanding scientific question of the age is how we can see galaxies billions of light years away when we *know* the earth is only 6,000 years old: his conclusion is a variable rate of the speed of light.","I have read reviews of this film that found it 'disappointing' and 'confused'. I am at a loss to understand why this should be so. From the beginning I found it a remarkable experience and a complete joy to watch.Spoiler: The opening titles overlay a beautiful visual of the evolutionary process, and this introduces the story with a serene and sweeping style. The film isn't about the process itself though, it concerns Charles Darwin's struggle with his conscience, his love for his wife, his deceased daughter and his search for truth.The appearances of his daughter are the manifestations of a tormented mind that knows it has \"killed God\". The daughter is an adult, making adult comments about his work and torturing Darwin with personal doubts. Was he in some way responsible for her death? Husband and wife in real life Paul Bettany and Jennifer Connelly give truly wonderful performances as Charles and Emma Darwin, as does Martha West as Annie. Bettany's size and awkward gait give Darwin's character a genuine sense of reality, whilst Connelly seems very comfortable with her English accent and occasionally somewhat severe persona.It's easy to misunderstand the times in which this film resides. The grip that religion had on society and the inner struggles that a man like Darwin must have endured to seek the truth in what he witnessed. Science and religion have always been awkward bedfellows and although it didn't cost him his life, as it did with so many earlier men and women, science put a barrier between husband and wife, fact and faith. This film portrays that barrier supremely well.I give Creation ten stars, because I think it's beautiful, profound, superbly well acted and a genuine, no-extraneous-frills-required look at one of the world's true geniuses.What seems obvious to everyone today (well, almost everyone... see Bill Maher's wonderful \"Religulous\") was hidden for millennia. The truth, once it was discovered, was undoubtedly painful for many. Creation examines that pain, and the realisation that we are all that we possess.A wonderful cinematic experience.","From the moment Paul Bettany blazes onto the screen in Jon Amiel's newest film Creation, I am hypnotized as this is his most powerful performance of his career. Charles Darwin, the famous scientist who came up with, which many consider the most profound and anti-religious vision of our existence, is portrayed more charismatic and tender than one would have thought. This is probably due to Bettany's stunning portrayal of the colorfully warm and devoted father and husband.The controversial book \"On the Origin of Species\" by Darwin depicts nature as a constant battle, a fight that is constant and ever-evolving. The film, however, doesn't focus on the book as it does with the battle in Darwin's heart. The film takes place very early in Darwin's life. He's not the old, grey-bearded man that we learned of in our Science classes. He's vigorous, full of life, and shows much promise for his career and life for his family. He's married to his wife Emma (played by Jennifer Connelly) and has four children; Darwin couldn't have life any better. But it is the loss of one of his children that ails the man's health, both physically and mentally. The grief weighs so heavily on his heart that the Darwin that had once been a devoted family man has transformed into an emotionally unavailable and vacant body.Director Amiel, in his best work to date I might add, and writer John Collee adapt this tale from the book \"Annie's Box\" by Randal Keynes. The narrative isn't always engaging and paced well. The film moves slowly and plays like a psychological thriller at times bringing tension and haunting moments. The problem with this is that it takes a turn to psych-thriller mid-story, so what we thought is a biographical film touched on by high hitting drama, takes a sharp left and becomes almost a horror film.Technically, the film is quite exquisite. Stunning art direction by Laurence Dorman places us in the early 1800's. Darwin's residence is quite the striking eye-candy. Costume designer Louise Stjernsward and make-up designer Veronica McAleer provide the perfect combination, especially to Bettany, to connect the viewer to a particular time in history. The highlight of the picture,however, aside from the star-turn, is the boisterous score by Christopher Young. In his best musical work to date, Young offers many missing qualities to pull us through the film. When it's downtime in Creation, Young's score often makes up and detonates beautiful strings and percussion.The rest of the cast does some solid work for themselves. Bettany's real-life partner Jennifer Connelly takes on the role of Emma Darwin with full force. She works the room with Emma's engraved yet subtle pain for the loss of her daughter and the constant anxiety for her husband's health. I'm afraid it's the underdevelopment of her character that doesn't allow her to run with the role. To top it off, any time she shares the screen with her husband, she is completely upstaged and nearly invisible. The screen debut of Martha West, who plays Annie Darwin, Charles and Emma's dead daughter who haunts him as life goes on without her, gives an incomparable performance, probably the best child performance of the year. It is West who is given the best lines, emotion, and development of all the supporting players. She will be an outstanding talent to keep an eye on in the future. Toby Jones (Infamous), Benedict Cumberbatch (Atonement), and Jeremy Northam (Gosford Park) all do work respectively.In the end, when walking out of the theater, you take Paul Bettany's harrowing work with you. Incredibly impressive and stands a fair shot at awards consideration, at least worth the consideration, due to the stacked Best Actor race this year. The film however, doesn't warrant any real hard-hitting drama. The film takes a safe and soft route which offers nothing new to the realm of biopics. Its results are simple moments that do not mirror the qualities a good film.**½/****","As a non-theist Im not going to comment on the great mans theory which changed the world 150 years ago. Safe to say, science is based on evidence, religion is based on blind faith. Nuff said there then.The film was produced by the BBC, and to be honest, it could quite easily have been shown on television. While the acting is superb, the film itself isn't really worthy of a full blown cinema release. That said, if it reaches a wider audience this way, then so be it. But I have seen many period style dramas on BBC TV and they were well up to the finished standard of this. Just don't expect too much of a big budget thrill ride when going to see it.In some ways, I found the movie almost going out on a limb to apologise to religious fundamentalists. While it attains a good sense of tension the whole way through, I couldn't help wanting it to get to the publication of The Origin Of Species much quicker than it actually did (you'll wait right until the end for that). And it seemed to dwell much more than I was ever aware on Darwin's struggle with himself and his wife Emma, portraying him almost as some kind of insane lunatic at times - which is hardly true. There are many other errors and facts missing in relation to the real story of the lead up to the publication of Origin too, but the whole premise of the movie focuses almost entirely on the difficulty Darwin faced domestically with the book, and a small portion on the death of his beloved daughter Annie. This gives the film its most moving scene, where Annie passes away as she asks one final time to hear Darwin tell her the story of a captive orangutan which died of pneumonia. Though, you'll probably feel a bigger connection with the primate in that scene than with Darwin's daughter.With the early controversy apparently surrounding the movie in the USA it will work well to promote it and ensure many more people will get to see it. But to be honest, there is actually very little in it that insults any mythical Godhead. Its hardly headline news about a theory that has been around 150 years after all. But, as fundamental Christians (and many other religions which we're all well aware of) like to wave a placard or two whenever possible, I guess this movie is as good excuse as any. Personally, I cant see what all the fuss is about. But maybe they're just monkeying around...","Don't plan on watching Creation as a light comedy suitable for a Saturday night date movie.Creation must be watched with full attention and an open mind. It has little to do with the debate that fundamentalists have made it.It is a movie of two loving parents, four children (one of whom became mortally ill) and the struggle to create a book from a mind, according to the movie, that is tortured and delusional. It is the story of a child whose curiosity parallelled rather tragically an act of an orangutan that brought about her death.The movie depicts Emma Darwin (Jennifer Connolly) as a strong willed Christian (which Emma was). If you are expecting Ms. Connolly to be as stunning and lively as she was in a Beautiful Mind, you will be disappointed. Here she dares act with little if any makeup, her hair drawn straight back to a bun and parted in the middle. She is more than adequate as a study of a plain strong woman who can stand up to her husband to the point where he is driven almost mad by her unbending religious will. Yet she is not a fanatic. Others may think so, but she really is not. If a viewer is not convinced, consider how she handles reading his manuscript. The movie shows it just the way it happened. It took a marvellous woman to retain her religious beliefs and encourage Darwin to publish.Darwin himself (wonderfully played by Paul Bettany) is shown as almost mentally ill by what he observes. He has two driving motives: to love his family (especially his oldest daughter Annie) and to find a way of writing the Origin of the Species knowing that it will offend all traditional religious thought on the subject of creation. Particularly odious to him is the fact that his wife believes that he will be permanently separated from God (and from her) should he persist in publishing his book. He half believes that she may be right. A fact that the movie left unstated is that Darwin was trained to be a minister – I think a huge omission. It would have made the complexity of his problem that much deeper.Though we do not see much of the children (except Annie), what we do get is really well handled. We will hope there is more of Freya Parks to come. She was a very sensitive Etty Darwin with naturalness much beyond her years. She is especially touching as she watches a fox kill a rabbit. Though Annie understands, Etty is more childlike in her response of repulsion, sadness and horror. She is even better displaying affection, if that is possible, when she asks her father to tell the children a story they have not heard.Annie Darwin (Martha West) caries most of the load for the part the children must play and she is delightful, serious, charming, witty, understanding and above all a lovable girl of about 10 going on 30. Her scene with the photographer and her father cannot be missed. This girl too will make many more movies one hopes.The great critic Roger Ebert said that Hollywood (he was referring to Creation) believes that all problems can be solved in the bedroom. Maybe that does reflect 2010 more than 1851, but if it is a flaw, it is a minor one.Creation should be seen not for enlightenment about Darwin or the Origin of Species, or a resoltion to the Fundamentalist debate about religion vs. science, but because it is a good film that has good family values. We see parents who are parents as well as being adults, and children who are children. We need more films like Creation.","what a waste of a film once again the film industry does not trust to make a film that could have been just about the man's ideas. there is virtually nothing on his theories or evolution, instead the most boring story of home life and relationship with one daughter, a ponderous script, great liberties taken with Darwin's life, dialogue given to his character that i find hard to believe he would have voiced. Darwin never gave up his believe in a higher power, he may not quite rightly have believed in the established Christian idea of God , but was not an atheist. which this film implies. what would have been a riveting and much better film, is if they had started with the publication of On the Origin of Species and constructed a story of the great revolution that entailed, and of an amazing cast of characters involved on all sides. instead we got a plodding, boring drama, mostly made up, a great injustice"],"review-user":["johnslighte","joshi_3592","graham_dahlke333","siderite","thinker1691","omahonyjason","dlang4","lfdmotta","cliffhanley_","ArthurKaletzky","sundeepv80","poc-1","kimi_layercake","macguffinfilmreviews","gradyharp","zoopyonscreen","DrFontane","ackstasis","cl777","scarr-6","jbe-6","ClaytonDavis","horizon2008","jeromec-2","grumpy-3"],"review-date":["10 September 2009","19 January 2010","20 July 2011","28 January 2010","23 March 2011","3 December 2009","13 March 2010","31 January 2010","24 September 2009","22 September 2009","20 March 2013","26 September 2009","27 February 2011","20 January 2010","30 June 2010","14 June 2010","6 October 2009","12 March 2011","3 February 2010","23 May 2010","24 February 2010","21 November 2009","26 September 2009","2 October 2010","25 January 2010"],"review-rating":["9","9","6","8","9","5","10","1","6","8","5","6","7","6","8","8","5","7","7","8","10","5","7","9","1"],"review-title":[" Great film, poignant, humanistic, and still surprisingly timely.\n"," A truly a great and moving tribute to Charles Darwin and his struggles.\n"," MIsunderstood & Ignorantly Viewed\n"," Beautifully acted, but both leading and misleading\n"," \" Father, . . why must the world be so cruel ? \"\n"," Darwin Biopic that focuses on the Great Man's Family not his Work\n"," A must see!\n"," Historically inaccurate, anachronistic and not suitable for educational purpose\n"," Slightly Gothic insight to Charles Darwin, the man.\n"," Nice Darwin family drama\n"," Darwin-a tale told without Darwin.\n"," Tragic failure\n"," \"Slow Yet Beautiful and Faithful\"\n"," Science vs. Religion, Family vs. Melodrama\n"," The Private Life of Charles Darwin\n"," A riveting exploration into the life of a man whose imagination expanded the boundaries of common belief.\n"," 1/4th interesting 3/4th sentimental (but without being engaging)\n"," \"Suppose the whole world stopped believing that God had any sort of plan for us?\"\n"," Well done and flawlessy acted film\n"," A moral fable of Scientific Creation\n"," Intelligent, beautiful, poignant and superbly made\n"," Paul Bettany creates Charles Darwin\n"," Darwin looking a bit mad?\n"," Creation: the story of one man's soul and one woman's religion\n"," why call it creation when it hardly touches on his ideas\n"]}