{"review-url":["http://www.imdb.com/title/tt0994359/reviews"],"review-text":["\"Confirmed Dead\" is a bravura piece of pure genre storytelling, and there's nothing else to it. \"The Beginning of the End\" put everything in place for the rest of the season, and \"Confirmed Dead\" had the goal of pushing the story even further, really introducing us to the world of season four, and introducing us to the 'freighter four', if you will, and accomplished its goal very well.The episode flashes back to the freighter four, Daniel Faraday, Miles, Charlotte, and Frank Lapidus all around the time the wreck of Flight 815 was 'discovered'. Daniel's is still the most interesting and enigmatic flashback (Miles' is just confusing and bewildering), simply because I just don't know who that woman is, don't understand why he was crying, and am also connected to him emotionally more than any of the other freighters. Charlotte's dig in the Tunisian desert was definitely a 'what the hell?' moment and is still a lot of fun. I like my polar bears to be skeletons in a desert a billion miles from where they're supposed to be, they're more interesting that way. Frank Lapidus was supposed to fly 815 eh? Interesting. I don't think there's more to him as a character, but we will probably see a Daniel flashback and a Charlotte flashback in season 5.Naturally there is not much depth to the proceedings, but the action/adventure stuff on the island is pure adrenaline, Miles' awful couple of lines of exposition excluded, and it's just a bravura piece of storytelling in just about every way, and genuinely suspenseful at times. I'm kind of surprised that this episode holds up on repeat viewings, but it really does. It may not be up there with the show at its absolute peak, but it's definitely a great episode in its own way.","The second episode of the new \"Lost\" gives you just what its fans were lacking - a fair amount of riveting action. From the very first scene, you keep seeing brand new features you weren't expecting to encounter. It's the best proof that the series, ingoing its 4th season, is still alive and kicking hard.Although the producers don't amaze us with some more flash-forwards this time, the return to flashbacks is more than satisfying, as it brings some shocking facts. The flashbacks introduce a few fresh characters, and the familiar ones turn out to be connected in a surprising way.The fresh characters dominate the whole episode and I can't say it does any harm. Their scenario parts and their actors both do extremely well, providing us with a bracing feel - right after the episode, you'll realize that the show really needed people just like that. And here they are.\"Confirmed Dead\" is full of gripping action and greatly written dialogues. I'm sure I'll quote the best scenes of the episode for the long time - they're just that good that they remain on the spectator's mind. The episode is entertaining, smart, and perky. You like \"Lost\", you have to watch it. My vote is ten.","Jack and Kate meet the physician Daniel Farady first and then the psychics Miles Straume and they demonstrate that have not come to the island with the intention of rescuing the survivors. Locke and his group find the anthropologist Charlotte Staples Lewis, and Ben Linus shoots her. Meanwhile, the group of Jack finds the pilot Frank Lapidus, who landed the helicopter with minor damages that can be repaired. Jack forces Miles to tell the real intention why they have come to the island.The second episode of the Fourth Season returns to the island, with four new characters, stops the confusing \"flash-forwards\" and it seems that will finally be the beginning of the explanations that I (and most of the fans and viewers) expect to be provided in \"Lost\". Why the interest of the government in Ben Linus, and how he is informed from the boat are some of the questions that I expect to see in the next episodes. My vote is eight.Title (Brazil): Not AvailableNote: On 13 April 2013, I saw this episode again on DVD.","\"Confirmed Dead\" is an important episode in the series, as it introduces four new characters: the rescue team that Naomi contacted before getting a knife in her back by Locke. However, as the quote in my one-line summary says, their true purpose for being on the island may be something else entirely. All the new characters appear intriguing (especially Miles, some sort of psychic / exorcist), but at this point it's still too early to make solid judgments. I felt that this episode was a slight step down from \"The Beginning Of The End\" (no flash-forwards this time; short-term flashbacks instead), but it still has its stunning moments and picks up steam near the end. *** out of 4.","When 'Lost' was in its prime, it was must-watch television. Remember first watching it, found it remarkably easy to get into, was hooked from the start and was on Season 3 by the end of one week. The general consensus is that the final season is a disappointment and cannot disagree.Season 3 was for me a solid if uneven season, with many brilliant episodes but a few slightly underwhelming ones, an inconsistent first part of the season and containing one of 'Lost's' low points \"Stranger in a Strange Land\". Season 4 had a good amount to live up, and its first episode \"The Beginning of the End\", was a brilliant start. This following episode \"Confirmed Dead\" is very nearly as great and already there are signs of a season that settled much quicker than the previous one.The episode has pretty much everything that 'Lost' is all about. It's taut and thought-provoking, with utterly gripping on-island events. It may be primarily setting up and putting into place what is to come, but does that extremely well.On top of all that, it introduces with enormous potential new characters, keeps the existing characters interesting, shows plot progression rather than repeating itself or being filler. The four \"rescue team\" members introduced add a lot of intrigue with their stories on the most part being compelling and interesting, Daniel's being the one that one learns from and remembers most and Lapidus being the most interesting. Miles has great potential as a character and has a lot of presence, would have liked though for his story to have more clarity and care (my only real complaint of the episode).Also found \"Confirmed Dead\" to be a non-stop thrill ride of insane entertainment value, edge of your seat tension and very emotional moments. Not to mention some shocking revelations and twists.Can't fault the performances, Jeff Fahey being exceptional.Nor the stylishness and atmosphere of the visuals, nor the effectively understated and chilling use of music, taut writing and the tightly controlled direction (one of the best of the season and perhaps of the show).In conclusion, great episode. 9/10 Bethany Cox","I felt last night's episode was slow and kinda of boring at times. I honestly don't think it has to do anything with the writing. Because I know the story was well staged and tried to keep things in place. I thought it wasn't that bad but overall, I didn't enjoy it. The most blame has to do with the director of that episode- Stephen Williams. I always hated Stephen Williams's directing. If Jack Bender continues with this episode from the season premiere, he would have kept it in a good pace and keep things float to keep things interesting. I'm glad Jack Bender is directing next week's episode and it'll be much better and I'm glad he got first Syaid episode to direct and I'm curious what he will pull off this time since Stephen Williams had directed too many Syaid episodes before.I always keep thinking that Stephen Williams needs to be thrown off from the show. He doesn't even do anything interesting with the show.Why does the opening have to be done with a target thing while being in the helicopter? IT was so BORING! Bad perspective of camera work too!","This series continues to frustrate and annoy. How are they going to drag this out for another year? Each episode offers up more and more questions, whilst providing the answers to very few. To quote another very popular website, I believe that this show has now jumped the shark!Will, I keep watching it?Probably,Will they manage to keep the show on-air till it ends?Probably not...How did two qualified doctors fail to notice that Naomi was still alive? How did 30 plus people not notice a corpse wake up and walk off with a knife still in her back? How did someone have enough strength to create two trails and climb up a tree to ambush Kate?We've now introduced a ghostbuster...Same time next week? yep!","I cannot understand the need to jump backwards and forwards to scene set, and pad out the plot. Showing that someone has a skill right before they use it, I believe, is offending our intelligence. It's starting to feel a little contrived, and as though they are making up for being so vague for the first three series. A little disappointing this episode.Furthermore, using past quirks, like Locke's ability to know when a storm is ending, is frankly insulting... are we supposed to ooh and arr, or laugh at the softer side of Locke?This episode was all over the place."],"review-user":["ametaphysicalshark","ogqozo","claudio_carvalho","gridoon2018","TheLittleSongbird","SydneyAlias1306","nick-lines","chrismerricks"],"review-date":["7 February 2008","8 February 2008","17 February 2008","25 January 2009","27 May 2018","8 February 2008","9 February 2008","12 February 2008"],"review-rating":["10","8","8","9","1","1","7"],"review-title":[" A bravura piece of genre storytelling\n"," Gripping!\n"," The \"Rescue Team\"\n"," \"Rescuing you and your people....can't really say it's our primary objective\"\n"," Introducing \"The Rescue Team\"\n"," Uninteresting...\n"," annoying\n"," Backwards and forwards\n"]}