{"review-url":["http://www.imdb.com/title/tt0902290/reviews"],"review-text":["I saw this movie as part of the Midnite Madness at Sitges. Set in 18th century England, the plot covers the life of Arthur Blake from his first outing as an apprentice grave robber to his final confession on the eve of his execution.The plot moves along via a series of misadventures involving Arthur and his partner encountering various unsavory characters and bizarre situations.The first thing that strikes you about this movie is how accurately they managed to capture the look of the Hammer period horrors, the atmosphere is set with lots of fog laden graveyards, rowdy tavern scenes and excellent set/costume design.For a movie titled I Sell the Dead, I was expecting the emphasis to be mostly on horror  don't get me wrong there are some jumpy moments and gore, but the tone is very much comedic, driven by the situations the characters get themselves into and their dialog. The closest comparison to the scenes between the two leads (Larry Fessenden and Dominic Monaghan) is the character interaction seen in the classic English comedies Only Fools and Horses, the Two Ronnies and Morecambe and Wise.The acting is strong and the casting of very familiar faces in Ron Perlman and Angus Scrimm lift the movie above many of the others on view in Sitges.Overall the movie offers something very different to the current crop of mainstream horror and will leave a smile on your face.","This one is an easy-going story. It's a tale, told first hand, of two friends in England who make their, ahem, living, by Grave-Robbing.As it is with British-type humor, the funny is in the dialogue and the setting without the usual blunt-nosed set-up that Hollywood sets you up for. Laid back, because the humor is the type that makes you smile afterward as opposed to guffawing out loud -- but funny just the same.And here and there, throughout, the touches of the Macabre are incidental set pieces that are just 'A funny thing happened on the way to the Graveyard the other night. . .' rather than the central horror of the movie. All in all, very well done, and ALL the characters are engaging and likable.Give this one a try if you and your friends are in the mood for some light horror with a side of funny. Pick this one for a slow Saturday Night with some good beer & chips.","I went to see Glenn McQuaid's \"I Sell The Dead\" in it's North American premiere at the Toronto After Dark Film Festival. Seeing as this is the second showing worldwide I didn't quite know what to expect of this film, especially having not seen the short film that inspired this big screen adaptation.I'll start off with a slightly more elaborate plot synopsis, without giving away any spoilers.This movie is about Arthur Blake, how he became a grave robber and the interesting and supernatural discoveries that both he and his mentor discovered.The costume and set design in this film were excellent. I was amazed to hear that the entire film was shot in and around New York. The costumes were very accurate to the time, really bringing you as a viewer into the mindset of the time. This movie works just as well as a period-piece as it does a horror-comedy.The interaction between the two leads was very fluid. They played off each others acting with ease. The dialogue between the two was very well written, with Glenn adding his comedic touch even in tense situations.The story is very encompassing and the ball gets rolling from the very start. I'd compare it to a visual page turner, always wondering just what will happen next. The characters themselves are all very vivid and unique adding different emotional layers to the film itself.All in all, I recommend this film for anyone in the mood for some dark humour, with a bit of horror mixed in.9/10","Great cast, great idea and stylish.... but it was missing something. It was neat to look at, but I never really connected to it.There were a whole lot of good ideas, but not enough was done with them. The movie would have been better if it were longer to expand on the ideas or more focused. Most of Arthur's apprenticeship could have been cut for instance.The horror wasn't particularly scary and the humor snicker worthy at best. Combined with the slow pacing, it's just too many strikes against the movie. It's a shame, because this movie has the cast and ingredients to be a genuine cult classic.","I sell the dead revolves around convicted grave robber Arthur Blake. Blake's friend and fellow grave robber Willie Grimes has just been executed and Blake is going to follow suit the next morning. While he sits in his cell awaiting his execution a priest named Father Duffy comes in and asks him if he will tell all he has seen as a grave robber. He then proceeds to give Father Duffy a quasi biography of his more interesting exploits.The plot pretty much consists of several incidents only tied together by chronology. This prevents the viewer from ever getting bored but it also makes the events less significant as you could easily add or remove a lot of scenes without noticing it much. Though flawed, I thought overall this method added to the fun loving nature of the film and kept it very entertaining. Most of the various stories are good, specifically the alien, the Murphy's and the vampire, but others weren't so great.The acting isn't amazing but I didn't find it bad at any point. Dominic Monaghan had a good performance as he managed to be serious when it mattered and also play very well into the comedic parts of the film.The characters were not extremely in-depth, but they were all interesting. I also enjoyed how a number of the villains were done in a over-the-top almost comic book manner. The part with the back story of the Murphy's and their gang is priceless.So overall, I Sell the Dead very successfully combines horror, comedy and sci-fi into a mish mash of fun and excitement. It is one of the more interesting and original movies I have seen in a while, and it's unfortunate that independent films like this don't get more recognition.","This film was really a breath of fresh air from the load of Hollywood crap I've seen recently. The acting is superb and the characters are engaging and oddly endearing. There really isn't much to the story, it's simple and it works well. An easy film to just sit down and enjoy. The mood was fantastic and the sets really helped push the movie along and offered some nice visuals. The film obviously has aspects of horror, yet is geared a little more towards the humorous side of things. You won't be laughing out loud hysterically with this one, but you'll be smiling the whole way through. The humor works very well with the characters and the superb acting doesn't hurt. I really watched this movie based on the fact that Ron Perlman was in it. His role is a bit smaller than I expected, but it doesn't matter; the rest of the cast does more than enough to keep you engaged. If you like horror, watch this. If you like comedies, watch this. Just go ahead and watch this anyway, it's really quite excellent.","The story has been told in other movies too. But the way it is handled here (with the humor) seems far superior to other movies (even a recent one, made by Landis). The story is more or less told in a reverse way, which makes you wonder a few things (or maybe you will guess where it is heading quite early on).The acting is really great and even the small role by Mr. Pearlman is just great. You couldn't imagine anyone else playing that role. He really is on par with Dominic M., who just is great in this one. There is life after \"LotR\" and \"Lost\" after all. And he is one of the guys who can say he made the most of it (not to mention his engagement with the wonderful Evangeline Lilly)!","If you want to see a great little horror comedy with an eerie feel to it this is the one. If you are expecting a blood and guts gore flick thats going to scare your pants off- then this isn't the one for you.For the budget that this movie was filmed on, the music was particularly amazing! Even though the film was filmed on a bargain budget the music and audio was definitely better than most movies with a huge budget!The story was truly well done and the director is to be commended. There is an almost perfect blend of comedy to horror in this movie! The acting is top notch and leaves room to make a sequel which I am definitely holding out for! I have no doubt that this movie will become an instant cult classic.In a nutshell this movie chronicles the life story of a boy who enters into the career of becoming a grave-robber. It tells the story in flashback of each of the more fantastic experiences that the robber duo encounters. Vampires to Zombies and even aliens! Our stars start out as simple grave-robbers stealing for jewellery but quickly become body snatchers for a mad doctor (Angus Scrim) who requires bodies for his medical practise. When the duo find a way to have a vampire dispatch their cruel employer the grave-robbers discover that trafficking in undead corpses is much more profitable than just stealing regular dead bodies. The only problem is that there is another gang called the house of Murphy that is competing for the same undead corpses- and thats where both grave-robbing gangs clash head to head with dire consequences.This movie is one of the most refreshing and exciting horror comedies that I have seen in years and reminds me of the Evil Dead. Don't miss this one, you will regret it!","I just saw this at SIFF, and I absolutely loved it. There were parts where I laughed so hard I couldn't catch my breath. The script and direction by Glenn McQuaid are fantastic. I can't wait to see more from this talented young man. The performances make the movie. Larry Fessenden and Dominic Monaghan are just delightful as the graverobber Willy and his apprentice Arthur. Ron Perlman turns in a fantastic performance (as usual) as a less-than-sympathetic jailhouse priest. Bonus: Angus Scrimm as an unscrupulous doctor! As always, he balances menace and humor perfectly.This is a style of horror comedy that really hasn't been seen since Vincent Price did \"Comedy of Terrors,\" \"The Raven,\" and \"Theater of Blood.\" The movie is genuinely scary in places, then it'll suddenly flip back into hilarious mode, keeping you totally off balance. Some parts are scary and funny at the same time.I can only afford to see three movies at SIFF this year, but even if the other two are awful, \"I Sell The Dead\" was worth the price of all three. I'm going to be looking for more movies from Larry Fessenden's Glass Eye Pix. He's giving the horror genre a much-needed kick in the butt.","Spoiler Alert.. What a wonderfully fun very odd film! I'm not sure where to start..Set in the 1800′s (I think, it really didn't say) our story begins with a unfortunate man getting beheaded while his partner in crime is waiting for his turn. During the wait, he tells his story.He was a grave robber. At first it was an innocent endeavor to earn some money but as time went on he starts to encounter unusual corpses.This movie has it all, vampires, aliens and zombies..oh my!This is a fun movie for teens and adults (no younger kids), it really does have it's scary moments.","\"I Sell the Dead\" is a horror comedy about a duo of sympathetic grave-robbers.Grimes(Larry Fessenden)and Blake(Dominic Monaghan)rob graves and sell the corpses in Victorian England.Things change when they unearth a body that refuses to stay dead.\"I Sell the Dead\" is narrated by Blake who is waiting in prison for the date with Mrs.Guillotine.The monk played by Ron Perlman listens to his last confession.Pretty funny low-budget horror comedy with Gothic atmosphere and few lovely twists.The characters are entertaining and the film oozes of the E.C. Comics vibe.I am not a fan of horror comedies,but this one kept me quite entertained.6 grave-robbers out of 10.","I confess, I only watched this because I enjoy Ron Perlman, but I stayed with it because it is a hoot! It is neither excessively gory nor bloody, but it keeps its horror creds kinda side-wise, and kept me chuckling throughout. I find it hard to categorize this odd flick, but if you have the 90 or so minutes, give it a try - it is fun! The story line allows you to expect a bigger payoff than you get, but the actual story more than makes up for it. First you meet the apparent villain and his church appointed accuser. It rapidly becomes apparent that the real issues are not mundane but seriously supernatural!Vampires, zombies, grave robbers. The world is not as simple as you might wish. Oh MY - laugh and enjoy - it is worth the visit!","I'm sure if I could have understood a lot of the dialogue this movie might have been rated higher, but alas, what with the \"Cockney\" accents and mumbling, and sometimes the background noise/music was too loud, well, I missed probably a lot of the jokes and why a scene could have been good. I did read of others needing to turn on the subtitles, if available, and also how some \"Brits\" said bad things about us \"Yanks\" because we cannot understanding them; but rest assured that a lot of us cannot understand more and more American-made movies, starring American actors, much either. There is too much mumbling, talking too fast, or the dialogue is drowned out. That being said, from what I could get out of this movie, I found it a little different, but also wondered just what this movie was supposed to be. Another movie, in a growing list I'm afraid, of misled genres, so to speak. This movie is a comedy-horror, but other than a few scenes, and the one on the beach with the ghouls, I did not find a lot of this movie funny. Clever yes, funny no. But you can be clever only so long. MAJOR SPOILER ALERT!! And I figured that our \"hero\" was going to be saved one way or another at the end. That was very obvious, made more so after the island scene with the undead. I think younger audiences will like this movie much more than us Old Folks, so if you're an AARP member, stick with Streep.","What's this? Another recent title? It'd be ridiculous for your fellow ghoul not to keep current with today's releases. I'll try to keep this one brief because I'm still unsure of my opinion in terms of the outcome.I Sell the Dead is about a man by the name of Arthur Blake (played by Dominic Monaghan, commonly recognizable as Charlie from Lost and also a hobbit in The Lord of the Rings trilogy) who confesses his grave robbing crimes to a priest named Father Duffy (your neighborhood friendly Ron Pearlman). Set in the Victorian era, Blake goes into detail concerning the exploits of his misadventures with his partner Willie. They soon come into contact with a rival grave-plundering gang led by the vicious corpsegrinder Cornelius Murphy. Several twists and turns are contained within peppered by obvious comedic elements. Unfortunately, I've seen better attempts at black comedy on BET. As I mentioned earlier, rating this film is not an easy task. Part of me thoroughly enjoyed the artistic approach and silly premise. On the other hand, I had a difficult time interpreting the pace. Several scenes felt disjointed and out-of-place, leaving me to ponder whether or not it was intentional. The acting is solid, of course. If you enjoy the mixture of comedy and horror (which, to be honest, I'm touchy about) then I would recommend checking this one out. Shut your brain off and enjoy the show...just don't expect anything groundbreaking.","Surprisingly uninteresting movie considering the subject matter; bland and uninvolving, with lackluster performances. Only during the initial \"resurrection\" (when it turns out that the resurrection men have resurrected a vampire) does anything even remotely interesting happen: the corpse is shown twitching spastically as it returns to life- just before it attacks. The attack itself, however, doesn't amount to much (it's brief, and not very well staged). The only other chance the filmmakers have to \"grab\" their audience occurs when the two blackguards unearth what turns out to be the corpse of- wait for it- an extraterrestrial. What might've been a classic scene, however, is handled ineptly: when the Mothership (one assumes; it's never actually shown) \"spirits\" the corpse away, the graverobbers just shrug it off and retire to the local pub for the night. The opportunities missed time and again make I SELL THE DEAD less than compelling viewing.","Good natured grave robber horror comedy, with fantastic leads, concerns Dominic Monaghan as Arthur Blake, awaiting the guillotine for the supposed murder of a member of the infamous House of Murphy. A priest, Father Duffy(Ron Perlman), wants to hear Blake's confession, demanding to know how he got to where he now is, a cell awaiting his execution. So, with some whiskey at hand, supplied by Duffy, Blake begins to elaborate his life of notoriety as a grave-robber, a life long partner and apprentice of Willie Grimes(Larry Fessenden, in perhaps his greatest role to date, stealing every scene he's in). Forced by blackmail into giving a doctor corpses(Angus Grimm who looks like Ebenezer Scrooge), Blake and Grimes soon discover the undead(!)while digging up a grave located outside of their village's cemetery and this actually leads to some minor moments of prosperity as they are able to rid themselves of Quint(Grimm)and benefit from a clientèle willing to pay big bucks for vampires(they actually favor the ghouls from \"The Evil Dead\" rather than your usual more romanticized vampires)as to discover the secret to immortality. We learn about a new apprentice, and love interest to Blake, for Grimes, Fanny Bryers(Brenda Cooney)who uses her feminine wiles in order to manipulate them into boating to an island where crates carrying the undead are located even though they are reluctant due to the fact that the House of Murphy were commissioned for the job. We see that Willie was indeed beheaded for his crimes and that while they were on the island, Grimes was bitten by a vampire. There's an amusing twist involving Duffy's real motives behind \"interrogating\" Blake, and \"I Sell the Dead\" is rife with all sorts of gallows humor. I think this movie's success is in the perfect casting, Monaghan, to me, has never been better and his storytelling is handled with jolly good flair. Perlman, as his ears to the endless series of strange vignettes, and Fessenden as Blake's grimy, but loyal, partner-in-crime add substantial support. The score is quite reminiscent to Danny Elfman and fits the movie's tone suitably well. A Burke and Hare comedy featuring the undead, how could I not like this? My only gripe is some rather blah computer graphics, although I love the hell out of a good \"talking decapitated head\" gag. Some minor cannibalism with a spattering of gore from time to time. I just adore the way Blake describes the House of Murphy and how the director presents them. I also liked how the director evokes the period, with plenty of Gothic touches here and there. I do wish the movie had more of Scrimm. The movie's most bonker highlight regards a certain frozen corpse Blake and Grimes are hired to collect, which introduces us to Cornelius Murphy. There's some magnificent lighting on display in this film, such as how Cornelius is shadowed. Cleverly edited as well. A real treat for fans of black humor.","I am a usually a very generous voter on IMDb and don't bother commenting on movies I did not like, but this was just lame. I actually turned it off 15 minutes before finishing it, to watch \"This Is It\" (because my gf wanted to... I just chose the lesser of two evils).If you want to watch this movie: picture this film as a collection of worse-than-average \"horror\"-stories, like \"scary short-stories\" that you find in an issue of \"Reader's Digest\" in the waiting room of your dentist's.I did not expect anything particular terrifying or funny, I am not the \"I want to see blood!\"-type of person, but this \"movie\" is neither \"horror\" nor \"comedy\" nor entertaining in any other way.It's probably more scary/funny and entertaining to look at the movie-poster of \"You've Got Mail\" for 90 minutes while drinking chamomile tea.Conclusion: a \"horror-comedy\" for people between 4 and 7.","I Sell the Dead is a big, sloppy horror comedy that refuses to take itself too seriously. This has advantages and drawbacks. The 85 minutes of the film breeze by and the film is full of bits sometimes funny, sometimes scary, sometimes gory, occasionally all three at once, but the individual bits are much better than the sum of the film's parts.The story, such as it is, follows professional grave robber Arthur Blake (played by Dominic Monaghan). Arthur's partner-in-crime Willie Grimes (Larry Fessenden) has just had his head chopped off for murder and Arthur has one night left before his own head is forfeit for the same crime. Arthur insists that he is innocent of murder, but there are plenty of other crimes that he is willing to confess to when bribed with Irish Whisky by a Catholic priest (played by Ron Perlman).Since the movie is a series of grave-robbing anecdotes confessed by Arthur, it becomes a sort of horror anthology - a series of disjointed tales, all linked by a similar cast (Arthur and Willie) and a similar theme (grave robbing). Like most horror anthologies, there is no consistent mythology, because all mythologies are true and happening simultaneously even when they contradict one another.It probably didn't help that I saw this film the same night as Trick 'r Treat, a horror anthology that avoids all of the traps that I Sell The Dead falls into. In fact, Trick 'r Treat, designed as an anthology, tells a more unified, consistent story than I Sell The Dead which is intended to be a united narrative.The other problem with the film (and I recognize that this is insane nit-picking) is the way the film plays fast and loose with history. Grimes is killed with a Guillotine. We might be able to stretch a point and say that he is killed by a Scottish Maiden, a precursor to the French Guillotine, but the Scottish Maiden was abandoned in 1709 and this film is set a good hundred years later since Burke and Hare are mentioned and they were executed for murder in 1829. Grave robbing as an industry became obsolete with the passage of the Anatomy Act (1832) so the film must take place before then.I know that bringing this up is the ultimate in historical nerdiness and we are clearly dealing with a universe where all sorts of dead, undead and legendary dead are possible, but the easiest way to anchor a fantasy, to convince the audience to suspend their disbelief is to use something real and authentic to bounce the fantasy off of. And it's not like the history of grave robbers or body snatchers or resurrectionists (call it what you like) is a boring story.The most frustrating thing is that writer.director Glenn McQuaid clearly does know the history, especially the good bits. As an example, when Grimes first takes on Arthur as his apprentice he correctly explains to Arthur that as resurrectionists, they don't steal the clothes from the dead, because stealing corpses is a misdemeanor, punishable by a small fine, while stealing clothes is a felony, punishable by deportation or possibly even death. So you would expect Wille and Arthur to strip the corpse at this point (and for the rest of the film) but of course they don't. You could accuse the director of ignoring his writer's script, but not when the writer and the director are the same person.My point isn't that there should have been a lot of buck-naked corpses in the film, my point is that if you are going to bring up this quirk in the law and make it clear that Willie and Arthur will follow the law no matter how silly it is, than you do have to pursue that thought to its logical conclusion, even if that means that Willie and Arthur wind up chasing a zombie through a graveyard trying to rip his or her clothes off and stuffing them back in the empty coffin, so that they don't get deported for stealing the walking corpse's clothes, otherwise don't bring up the matter at all.Historical nerdiness aside, I Sell The Dead is worth a rental as a slight but funny horror film that could have been much more.","19th century England. Eager young Andrew Blake (a fine and engaging performance by Dominic Monaghan) and his seasoned mentor Willy Grimes (splendidly played with lip-smacking rascally relish by Larry Fessenden) make a living stealing corpses from coffins and cemeteries: The dastardly duo encounter vampires, zombies, and even an alien throughout their fiendish exploits. Writer/director Glenn McQuaid offers a flavorsome evocation of the period setting, does an ace job of crafting a deliciously macabre tongue-in-cheek mood, and ably mines a wickedly funny line in spot-on twisted gallows humor. However, McQuaid's key triumph for sure is the quirky, colorful, and cinematic live action EC Comics-type style and sensibility he brings to the playfully ghoulish material. The natural and likable chemistry Monaghan and Fessenden in the leads really keeps the picture buzzing; they receive sterling support from Ron Perlman as hearty Irish priest Father Duffy, Angus Scrimm as the corrupt and demanding Dr. Quint, Brenda Cooney as gutsy'n'sassy apprentice Fanny Briers, and John Speredakos as the fearsome Cornelius Murphy. Richard Lopez's sumptuous widescreen cinematography provides an impressively handsome and baroque look. Jeff Grace's robust score hits the spirited spot. A real treat.","Entertaining black comedy. Doesn't have the poignancy, depth, or biting wit to be truly great or emotionally involving, but is still better than 95% of what's out there. The stuff that's gruesome is pretty tame by modern standards. For some reason, the way the film hit me is how I remember the original \"Beatlejuice\", which isn't a bad thing. Not a horror flick at all or even a very dark comedy--more along the lines of a very good late night horror spoof. I just popped some corn, kicked back and had an uncomplicated good time.","This film is a poor attempt at comedy and horror. It has mild frights and even milder humor.The movie drags on for far too long and really is not very well cast.The most annoying thing about this tripe is the accents that some of the actors attempt to put on. Especially Monaghans character as a kid. The majority of Irish accents are laughable apart from the odd actual Irish person who got a role in the movie(you can spot the real accents very easily).Some scenes look like they where thrown together after the movie was finished to fill in the time.Please save yourself a few quid and rent/buy something else.","The horror comedy is much more difficult to work with as it seems.Many screenwriters and directors think \"comedy\" equals to \"incompetence\", and they think the quality from the movie will not care as long as it is funny.What they almost always forget is that it is equally difficult to make a good comedy and a good horror film, so they do not notice they are doubling the audience's expectations, and that they are risking themselves to fail them by double-entry.Needless to say that the result is not good in most of the times, but it is occasionally possible to find a movie such as I Sell the Dead, which is authentically ingenious on its genre combination.This may not be an excellent film, but I took a nice surprise with it and it kept me very entertained.The best element from I Sell the Dead is the cast.Dominic Monaghan knew how to canalize the fame he won in The Lord of the Rings trilogy in order to make a career in TV, appearing on series such as Lost, Chuck and Flash Forward; and even though I occasionally find him to be antipathetic, he brings a very competent performance in I Sell the Dead.Ron Perlman does not need an introduction to the fans of fantastic cinema, and despite the brevity of his character in here, he brings an entertaining development.Angus Scrimm (the Tall Man in the Phantasm saga) is perfect as a villain.And finally, even though the name of Larry Fessenden is not very famous on his actor facet, he was responsible as a director and screenwriter of two occult gems of the fantastic cinema: Wendigo and The Last Winter.In I Sell the Dead, Fessenden shows he is also talented as an actor.The screenplay is also worthy of mention because it tells us a solid story at the same time it satirizes some popular horror sub-genera, from vampires and zombies to other ones I do not wanna mention because I would ruin the surprise.But \"satire\" may not be the appropriate word in this case; the screenplay simply incorporates those elements on a natural way, and it leaves the characters to explore the situations with their dry humor.The fails I found on this movie is that some supporting characters are not very well drawn, and there are some things which feel a bit forced in the screenplay.However, I had a very entertaining time watching I Sell the Dead.As I mentioned, it may not be a great film, but it has enough positive elements to deserve a honest recommendation.","I couldn't really see the point of this low-budget misfire. The writers choose a subject ripe for some rich atmosphere and detail, but for some reason fail to fit a story around it. The plot is framed by a confession of sorts, told by the condemned hero in the shadow of the guillotine (which I thought was used by the French, not the Brits, but maybe I'm wrong). Anyway, our hero, such as he is, relates his tale to a monk (Ron Perlman, the only real name in the film). He recalls how he was recruited into the body-stealing trade by Willie Grimes and how they toiled under the insatiable demands of a wicked doctor – until, that is, they discovered a sort of sub-market in the bodies of the undead (which means the film should really be called I Sell the Undead, but no matter).Now, as you can imagine, it's around about this point in the movie that all discerning viewers will probably raise their eyes skyward and either reach for the remote or, like me, settle down behind folded arms in the hope that things will somehow improve. The story, however, meanders along, wandering up a few dead ends, scratching its head, ambling back the way it came. Our heroes discover a baby alien in one of the graves they desecrate. They look at it with slight puzzlement for a moment before it is snatched from them by Cornelius Murphy, one of a rival gang of body-snatchers, and never spoken of again. Nobody seems inclined to explain why the ghoulish undead are being transported hither and yon or by whom, the audience are just expected to accept this traffic without question.I'm not quite sure what market the film is trying to attract. It seems to be aiming for irreverent black humour, but it misses most of the time. The ghouls are imaginatively designed, but there's little sense of period or setting due, presumably, to the meagre budget. When a film is deprived of such a vital component it's writing needs to be of a high enough standard to absorb the viewer and make them at least capable of overlooking its other shortcomings. I Sell the Dead fails to do this and suffers badly as a consequence","I Sell the Dead plays up its humour much too much. The sole, recurring, dragged out joke is how we, the audience, are meant to be impressed or put off by the grim work of grave robbing. But it's tedious. It's like listening to someone talk about how hard their job is: constantly. A lot of the actors are good but their characters are one-dimensional grave robbing toughies.The music exacerbates the humour. Goofy is too strong a word for it, but there is a hokey kind of (clarinet?) music that plays throughout the entire show that tries to communicate its humour. Yeah, okay; \"Sell\" is a black comedy; I get it, you make dark jokes and stuff. Your fascination with death is not profound.The movie is also overpacked, giving it a listless feel. \"I Sell the Dead\" doesn't have a traditional three-act structure, but works more as an anthology. But there is too much content. All of the little anecdotes throughout the film take away from the focus of the overall plot. Anecdotes like these work much better in print. And to reiterate, the humour is not appreciated. There's one \"humorous\" anecdote of a boy who keeps having his pets killed by his father, until the boy beats his father to the punch and kills his pets before the father can. That reads pretty twisted, but the movie spoils it with cheese: when the boy finally kills the pet, he has red paint on his face (he kills it by biting it, teehee) and breaks immersion by looking at us and smiling. It's over the top but not in a fun way. I don't know. If I was much, much younger (ten years old?) maybe I would've thought it was cool.Speaking of immersion-breaking, the movie's obviously low budget makes everything look cheap. There's a brown wash to every scene and a lot of sets feel empty or underdeveloped. I don't want to knock the film for not having the lavish budget of a mega-Hollywood movie, but the cheapness plus the poor humour and lack of focus makes \"I Sell\" a tedious bore.That said, I know this is the debut work of the director, and I have to admit this is an ambitious project. I'd like to see more of his work in the future.","I adore this film! It is extremely imaginative and terrifying and at times can be whimsical. Spot on, great horror/comedy/fantasy film 🖤"],"review-user":["ric_dagless","Rabh17","the_hurricane15","jseger9000","talkymeat","hinesgtrservice","kosmasp","scottmannen1","DarkAnnie","andishorrorblog","HumanoidOfFlesh","slywlf54","ltlacey","dagonseve","poe426","Scarecrow-88","agitpop","Llakor","Woodyanders","carbuff","donalscallan","Argemaluco","JoeytheBrit","thisseatofmars","picaqasag"],"review-date":["29 October 2008","29 August 2010","26 October 2008","18 April 2010","1 September 2009","1 September 2009","30 December 2010","17 October 2009","23 May 2009","1 February 2014","4 February 2011","18 December 2011","6 April 2010","4 June 2010","6 August 2010","31 March 2010","23 March 2010","5 August 2009","24 February 2014","10 May 2015","1 June 2011","20 April 2010","8 February 2010","6 November 2018","17 October 2018"],"review-rating":["9","8","9","3","10","9","8","9","9","7","6","6","3","5","4","8","3","7","8","8","1","8","5","10"],"review-title":[" I've Seen The Dead\n"," Humorous tale with a nice dash of Macabre\n"," I Sell The Dead Stole The Show\n"," This movie is right up my alley, but...\n"," Watch This Movie! It's Fun, Exciting, and Unbelievably Original.\n"," Excellent\n"," Blake and Grimes\n"," Fantastic Horror Comedy! DO NOT MISS THIS ONE!\n"," Best horror comedy in years\n"," Fun and Odd\n"," Graveyard blues.\n"," A goofy hoot!\n"," Before being executed a man agrees to tell a priest his \"story.\"\n"," No Hobbits Here, Just Grave Robbers\n"," Bored to death...\n"," I Sell the Dead\n"," Lame, lamer, lamest\n"," Big, Sloppy Horror Comedy is Funny but Lacks Ambition\n"," Delightful horror black comedy\n"," Well-made, light-black, comedy.\n"," Don't bother.\n"," I Sell the Dead ended up being a nice surprise\n"," Pointless misfire\n"," I Sell the Dead: great name for a thin movie.\n"," Unknown gem\n"]}