{"review-url":["http://www.imdb.com/title/tt0956038/reviews"],"review-text":["Dr. Paul Flanner (Richard Gere), a successful surgeon, has his wife leave him, his son (an uncredited James Franco) not respect him and looses a patient he's operating on. Adrienne Willis (Diane Lane) has two children and discovers her husband has cheated on her. They both need to get away. She watches over a beautiful oceanside inn in Rodanthe at the same time he books a room. They're all alone together. You can pretty much figure out the rest.This is what's known as a weepie or a woman's film. It's beautifully shot with a romantic setting and lots of quiet scenes. There's tragedy, romance, more tragedy and an uplifting ending (sort of). The great acting by Gere and Lane helps disguise the fact that this film isn't really about much. Every single bit of the plot is predictable. I rolled my eyes a lot at some of the events. Also it's far too short--I didn't believe the romance between Gere and Lane for a second. If comes out of nowhere and moves VERY quickly. Still the movie does work. The inn itself is absolutely gorgeous and I was in tears by the end along with most of the audience. So it's a predictable but gorgeous movie with some wonderful acting. It doesn't deserve all the criticism it's getting. I give it a 7.","Oh, my friend was just dying to see Nights in Rodanthe, I'm convinced she is absolutely in love with Richard Gere, not to mention she just loves romantic movies, so Richard Gere and romance? It's a no brainer, she just had to see this movie, guess who she begged to go with her? Yeah, me, I didn't really want to see it though, it looked too sappy for my tastes, but we got to see it for free, so I figured to just go ahead and give it a fair chance. Well, we saw it today, it was a little better than I expected, which is saying plenty. After seeing the movie Unfaithful, I really wasn't into the whole Diane and Richard being back together on screen, but for some reason they made this story more enjoyable. Even though it was predictable, it was a sweet movie, I hate the sappy movies, despite it's sappiness that I normally resent, it's still a nice movie and was just a breath of fresh air due to the recent movies that we're getting that are either thrillers, comedies, or action.Adrienne Willis is a divorced mother of two who's ex-husband is begging to come back home after a nasty affair he had with one of her friends. She's debating on it since her children want them back together and she feels it should be that way. But when her friend leaves her to run her house on the beach that she rents out to people, Adrienne meets Paul Flanner, a doctor who has had a rough year after loosing a patient on a routine surgery, he's staying in the house with Adrienne. Loosing themselves has been so hard, but when they're together they find themselves once again and bring life back into their world realizing it's OK to be in love once more.Nights in Rodanthe is a nice movie to watch... more so I'd say for either a rental or a matinée, I was more impressed with it than I thought I would be, but it does get predictable, which I hate to say I've just been seeing nothing but predictable films lately. Maybe I should start writing scripts if this is all it takes, I could write a number one movie maybe, wish me luck. But back onto the movie, it has decent acting and does give you watery eyes. It's a nice movie to watch, gives you a little smile and reminds you of the sweeter things in life. Richard and Diane made this movie enjoyable and were lovely on-screen together, it's worth the watch.6/10","Ever since they first came to the Outer Banks and filmed the movie (I have lived here my whole life), I have waited for this movie to come out. And I mean waited and waited and waited over a year and a half for this movie and to me, it was worth it.The movie is different from the book but in my eyes, it's still a beautiful piece of work as is the book. In both I cried, there were moments that tore me up. I laughed and I smiled just as much. It's a great movie with a great story line.It's about never giving up on finding that one, the one that will change you forever. The one that will shape your soul and awaken you to a whole new view of life.I have to say that it is possible to meet someone and have them change your life forever, which is what Gere's character did to Lane's. I met the love of my life and at once was completely captivated that I never forgot him or how smitten I was with him until I 'met' him again a year later. For me I could relate to this movie with my whole heart. I think that if you listen and watch the movie with your heart and your hopes you'll see what I'm talking about. It's never too late to find your true love, great work Ms. Lane and Mr. Gere!","Terrible title for a movie that is not nearly as terrible as some critics have suggested. At a time when there are so many romantic comedies aimed at young viewers, it's no bad thing to have the occasional romantic story that eschews humour and involves characters in middle age - think something along the lines of \"Bridges Of Madison County\" (both are based on novels).The (goodlooking) stars are Richard Gere, as a doctor seeking to establish a new relationship with his estranged son in Latin America, and Diane Lane, a mother in a deeply unhappy marriage considering whether to abandon it. The (unusual) setting is the Outer Banks of North Carolina at a time of year when hurricanes are threatened. At times, it's a little silly and sentimental but still worth an evening in front of the television if not a visit to the cinema.","Oh yes! Hollywood does remember how to use the good old formula, and when lightning hits, it's a rather wonderful feeling. Rarely Hollywood creates a masterpiece because lately, there seems to be more concern with hurrying up and getting the most rewards in a hurried manner, or there is the matter of too many cooks in the mix. Usually good screenplays are the result of a talented writer who is in full control of his/her property, understand his material and is a good writer. Then, there is a little important part, often neglected by the marketing geniuses that so often lack creativity and vision: a good actor.A good actor can make the difference between a mediocre, half-cooked try, and a fully realized film that might not be an important and relevant movie, but one that contributes to its genre and might eventually become a classic of its type. We get very few romantic comedies, and we are people who are starved for them. Buried in the sexy humor of \"Sex in the City\" is the romantic, yet stormy relationship of Big and Carrie, and people flocked to \"Mamma Mia\" because it had some romance, skillfully played by Streep and Brossnam. It could have a silly musical, but it did touch us because it was played with intensity and conviction. \"Nights\" offers us more of it, with the amazing talents of a woman who does magnificent work in romantic films, Ms. Diane Lane. Ever since her days as a child actor, we could appreciate how her talent, combined with her appreciative soul allowed us to see into the hearts of the story's protagonists. A few years back, she teamed up with Mr. Gere, giving us a tormented, romantic, and sexy performance as the wife who is not too sure of her actions' consequences in \"Unfaithful\", work that should have garnered her at least an Academy Award. She is back, doing more formidable work in this romantic gem as a woman who has given up on her romantic prospects, and suddenly she realizes there might be another chance around the corner.Ms. Lane makes this film pulsate with intelligence and passion. Her facial expressions communicate volumes about the different emotions her character undergoes. We can read frustrations, yearnings, desperation, anger, hope, loss, and a range that is way out reach for a lot of the marketable types that Hollywood constantly push down our throats. Here is a mature performer who has the gift to project real emotions and allows us to connect with the material in such a way that we are moved as we become part of the experience.Ms. Lane is such a triumphant joy to watch as she goes through transformations from the first scenes of the film until the very end. Her discoveries become ours as we celebrate with her the power of hope and love. She is able to bring back the unsurpassed joy of a person in love, much like a teenager does, and yet she never lets you think of her character as silly or irresponsible. Her eyes are expressive gems that can move even the cynical in the audience. She is one of the stars that can do wonders with just one look. In her the classic feel of those grand movies of yesterday are back. Her work recalls the passionate and intelligent work of Hepburn, Davis, Garson, women who played everyday types and made them memorable because they created complete characters.We admire those superb actresses who recreate real life legends and are rewarded for it. Half their work is done by the mystique of the figures they impersonate; however as much as anyone might make you think, it is the roles such as Lane's in this movie that are a more impressive achievement because they are created from scratch, given a personal imprint and are able achieve heights without any previous theatrical material support, such as plays, and the background of a famous legend whose life is paid tribute on the silver screen. Lane's character is one woman whose experiences could be any of us. She represents our dreams and emotions with much quality, class, and just the right amount of sentiment. It is quite a remarkable achievement, and we should be grateful that we are still able to find such a remarkable performance nowadays.There are a few adjectives I could use to pay tribute to her work, but I can only say that in my humble opinion every single frame of her work in this film is testament to one of the greatest performances ever put on celluloid by a living performer. Thank you, Ms. Lane.","Let me get this straight:\"Hotshot plastic surgeon loses a patient on the operating table while removing a cyst from her face and ends up falling in love with recently separated bed and breakfast hostess within about 24 hours of meeting her due to her solid advice on bedside manner.\"Wow. Move over \"The Notebook\", there's a new kid in town.Where to begin. Well, how about the depth of this \"relationship\"? I think we can safely sum up the foundation of this undying love in the following steps:1. Exchange polite pleasantries over a bite of salad. 2. Drink copious amounts of Jack Daniels; play basketball with old food 3. Provide glib, unsolicited advice to each other on your crappy lives. 4. Make love during a hurricane. 5. Devote your lives to each other via airmail.I noticed George C Wolfe has \"The Hairball\" and \"United Kanye West Project\" in his dossier. Would \"stick to your genre\" be too harsh? Enough said. I think most would agree that the best love stories make us cry, or laugh or even hope. But the reason they are able to do that is that, somewhere during the storyline, we really start to care about the characters we're watching on screen. To make us care, there must be time spent developing these characters...their lives, their history, why we're watching them now. Wolfe didn't seem to want to \"waste our time\" with such trivialities, and instead provided us with all of about 8 minutes of background information on each character before hurling us into an intense one-on-one interaction between two ACTORS we've all come to adore, but two CHARACTERS we could care less about.For one brief tender moment when Richard Gere exclaims that he doesn't expect her to listen to his problems, and she invites him for dinner, the viewer sees a glimmer - a beginning - of something special between these two characters. But instead of being allowed to enjoy the anticipation and playfulness of \"what happens next\" in the wonderful, unpredictable joy that is courtship, we are instead pushed headlong into a love affair between two people we hardly know.Let's face it. We have all heard cheesy one liners in Romantic films. But the reason we cut some slack to Bogart in \"Casablanca\" or Nicholson in \"Something's Gotta Give\" is because our hearts and minds have been lifted to the heavens and dragged through the mud and back again with these characters, and by the time they deliver the line, we're so deeply involved with their plight, we don't even notice the cheese factor. Since Wolfe doesn't allow us to love or even like our protagonists, all we're left with a fromage sandwich and a few snickers in the audience.Wolfe takes the old Hollywood director's phrase \"cut to the chase\" much too literally here. As each stilted one liner is delivered by our cast, the viewer is left wondering if director Wolfe is subliminally saying to the audience: \"c'mon. it's a Richard Gere romance. just buy in.\"It is as a result of this stunning lack of character - or relationship - development that the film's climax fails miserably to tug at our hearts. When Gere's character dies, I felt like I was watching the news about someone I didn't know passing away. Or watching a ladies' eights rowing race during the beijing olympics. Just. Didn't. Care.Epic. Fail.","I like all different types of movies, so this is not a bash on romantic movies from a guy who only likes The Matrix etc etc.I just felt it was a lousy movie. I don't feel that there was enough buildup of the characters to fall in love. They were there for a few days and while dealing with a severe hurricane and major issues in each of their lives, Richard Gere and Diane Lane fall hopelessly and helplessly in love?? It isn't realistic. This movie didn't make me buy into it and feel it emotionally and that is something that you look for in a good plot. Some emotional connection. If someone can relate to them falling in love that quickly, without any true substance , than so be it. You are neither right or wrong. Different strokes for different folks.Another very unbelievable component to the movie was Diane Lane's very rude teenage daughter becoming nice and sympathetic at the end of the movie. Does a teenage girl who is that miserable and aggravated at her mother for not getting back with her cheating husband going to just have a switch turn on and be nice? This movie, in a nutshell, had some big names, but to me, was a major disappointment.","NIGHTS IN RODANTHE brings back to the screen two talented actors in Diane Lane and Richard Gere in a simply beautiful story of a man and a woman hungry for something more in their lives than they have at present. The chemistry between Lane and Gere is magical from the first scene in the film to their last embrace. The locations, beauty of their attraction for one another when it unfolds when they first meet, and the story that follows, and as they begin to know each other with the attraction they feel towards each other is real, is romance that is projected to an audience with tender care. James Franco in another micro role is just the right casting, and the elegance of Lane in combination with the beach house, is a true Fall 2008 film to remember forever, as was THE NOTEBOOK.","If you read the book before seeing the movie you may be disappointed like I was. The book was great and I was sure after seeing the movie preview that the movie would be great as well, however I felt like I was watching a movie where the director and cast did not even read what these characters where like. The movie is short and they do not really ever make us feel that these people were truly in love and felt like sole mates. Even if the movie did not go in the same direction as the book at least they could of made the romance between these two characters feel more intense. I think both Diane Lane and Richard Gere were perfect for these two characters and they have good chemistry however they just did not develop a long enough storyline for us to see how they longed for each other. The book was true love story and I think this movie could of been a lot better.","I saw this movie for the first time on TV, thought it was not worth the ticket when it was first released in movie theatres. I can now say I was wrong. \"Nights in Rodanthe\", based on a novel by Nicholas Sparks, may sound predictable, too melodramatic, too tear-jerking, too romantic, too much, in every sense. Indeed, you cannot find anything except what you expect to find: romanticism and drama together, through dialogues and situations which you may have heard in thousands of romance/dramas.However, I think some merits are to be found: first, the idea of portraying a love story between two mature people, which is not so common or easy nowadays. Richard Gere and Diane Lane have a very good, long-term chemistry, going back to \"The Cotton club\" and later to \"Unfaithful\", and they are still able to convey a deep communion of soul, showing with honesty how love can always give a chance, and how past experiences can shape passion and attraction in such a tender and delicate way. The two actors are very good in the way they manage not to turn romantic scenes and sometimes a melodramatic script, into a pathetic hodgepodge, but always keeping a strong dignity of interpretation, and a very professional attitude.I generally praise American non-pretentious pictures: however simple, and unoriginal they prove good-quality products, thanks to a high professional attitude and a talented cast, which can often make a difference. In this case, also the enchanting settings, the music at the right moments, the good photography help make the final product credible and emotionally involving","That's right, we've got a 2008 film using themes of \"Brief Encounter,\" and \"The Bridges of Madison County.\" It's basically the story of lost loves, redemption and a triumph of the human spirit.The performances by Richard Gere and especially Diane Lane are very good. Gere gives the kind of restrained performance here as a doctor who is searching for meaning, after a patient dies on the operating table. Lane is the mother of a rebellious daughter and a nice young son, who has split from her wandering husband and has also sustained the loss of her father in the same year.Scott Glenn steals the show in a one scene meeting with Gere. He is the heartbroken husband and he recounts his love to his departed wife, it will bring tears to your eyes.Fresh from her triumph as an acquiescing mother in \"Doubt,\" Viola Davis appears as an understanding friend in the film and literally hangs her hair down in a rather benign performance.","While I am not a woman, I can enjoy a chick flick if its good. This one however is beyond bad. You have the by the book story, girl is getting divorced, boy with issues shows up. BOOM magic happens and his demons are banished as she realizes her life has a new purpose.Now while I can believe that kind of thing might happen, I am not an idiot. It wouldn't happen over a weekend of geriatric rumpy-pumpy, it would take time. Yet here the producers know they only have 1 hour and 30 minutes so they force the changes of the two to happen, I suppose a night of getting hammered and a night of gramps and granny going at it like dogs in heat might be enough if you believed romance novels were the gospel... but most people don't.Now, if that isn't enough... the producers remembered that a chick flick needs to make the viewer cry... well they tried to make you cry with the two senior citizens getting jiggy with it by failed... so how could they hit you again? Why I know, lets kill off one of the characters for no good reason at all except that a random death will surely bring a tear to the eye.... and now lets have the teen daughter magically bond with heart broken mom for no reason besides the fact that it would be nice (completely unreal, but who cares).So there you have it... girl find boy, boy find love, death finds boy and mom cries.... what a movie - NOT.","Discovering something, the journey is so much more fun, so much more surreal and so much more emotionally galvanizing than when you finally arrive at the destination. Falling in love is perhaps one of the most opulent feelings in the world. You feel energized, invigorated and alive. You simply want to be around that person every second of the day and the very sound of their voice gets you excited and sometimes aroused. Love, and all the physical and emotional side effects that comes with it, is pure bliss. Where it goes from here is anyone's guess, but when you first begin your journey together, nothing can compare to it.Diane Lane and Richard Gere play Adrienne Willis and Dr. Paul Flanner, two emotionally scarred middle aged individuals. In this film, they are about to embark on that mystical journey together, where love, and the discovery of the emotions along the way, will help save them.Lane is dealing with the typical jerk of an ex-husband who still loves her, but in her eyes, only because the woman he cheated with no longer wants him. As hurt as she was by him, as much as she really dislikes him, there is a part of her that is actually considering taking him back. Why you might ask? Because in life, and love, sometimes comfort supersedes intelligence. Yes, this man cheated on her but she has kids with him, she built a life with him and there is obviously still a connection with him.Richard Gere plays a recently divorced husband and estranged father. He also just lost a patient as she reacted negatively to the anesthetic. He is now being sued by her family and he is guilt ridden but hardened about the issue. This is what brings him to Rodanthe in the first place. Although his lawyer told him not to, he felt compelled to visit the woman's husband in Rodanthe. He stays at the Inn that Adrienne is taking care of. Soon, they find comfort in each other's arms and discover that they too can have a second chance in life.By now this sounds like a simple idea for a film, and although it might be something you've seen or read about before, Gere and Lane simply own the film. Diane Lane lights the screen up with her smile. Her eyes twinkle in the dark and the life she brings to the character is one worth watching. Gere's character is a little different. He is more hardened and bitter. It takes Adrienne's pain and her passion to bring him out of his shell. He blames quietly himself for his strained relationship with his son and her secretly blames himself for the death of the patient. On the outside he tells anyone who will listen that it is not his fault, and that she was a 1 in 50,000 casualty. But deep down, it eats away at him. They find each other at a time when both need someone to listen.Gere and Lane have been in film together before but this is the first time they play lovers. They were married in Unfaithful but here they play lovers finding each other when the people in their lives have abandoned them. They have a spark and a real chemistry. I would love to see more films with them together. In fact, I'd love to see more films with Diane Lane but that's a story for another time.Nights in Rodanthe is a very passionate and romantic film about two lost souls who save each other. They both become better people, they both become stronger people. I enjoyed it immensely and would recommend it to anyone, not just couples. This is a film about redemption, absolution, and second chances.It will also ask you to bring some hankies.8/10","\"Nights in Rodanthe\" is an insult to audiences. The filmmakers assume that audiences for romance films are so stupid that they will accept amateur schlock made with as much care as a local-access, late-night television commercial for a mattress warehouse. \"Nights in Rodanthe\" got abysmal reviews, but I decided to check it out anyway: Richard Gere, Diane Lane, a gorgeous setting, and a romance, all attracted me.The movie is so awful its awfulness overwhelms even Gere's manly sexiness, and Lane's sweet perkiness. This movie is to romance what motion sickness is to gourmet food.The setting is a house whose pillars are set in the Atlantic Ocean. It goes without saying that this is, um, slightly risky. It's painfully obvious that the interior shots are NOT the interior of the ocean-bathed exterior. Since the house is a main character, this disconnect and complete lack of verisimilitude is painfully obvious. The owner of the house, an artist and descendant of slaves, would not store her family's heirlooms and her artwork in a house that's about to fall into the Atlantic Ocean.The interior is the hell for tchotchke collectors. In place of a coherent plot or sincere dialogue or romantic heat, the filmmakers offer us a set crammed to the gills with beaded curtains and retro kitchenware and embroidered pillowcases and carved little boxes and colorful vases: I thought I was walking around inside Martha Stewart's brain. The combination of shoddy film-making, shallow script, and overstuffed house communicates loud and clear: the makers of this film decided that romance film fans are such chuckleheads that they will accept vapid, cinematic drek as long as there is a garage sale collectible in every shot.The film is so rushed it feels more like a filmed rehearsal than an actual film. Gere and Lane appear to have been given no direction, no coherent scheme within which they could connect. The special effects, of a hurricane and a mudslide, are so ostentatiously subpar they could have been replaced with lights turned on and off by a stagehand and a shaken piece of tin roof material for sound. I don't know how a filmmaker could have directed a scene starring one of the sexiest men alive, Richard Gere, cute and adorable Diane Lane, a house half in the Atlantic Ocean, and a hurricane and created not one candle-power of fear, romance, sexual tension, or meteorological oomph.Shame on the makers of this film for having so much contempt for their audience, and for their material.There's one great scene, and performance in this movie, though. Scott Glenn, who was himself a poor Appalachian lad, plays a poor Southern man whose wife died. Glenn's performance is genuine and powerful. That he managed to work that performance into this movie is testimony to his power as an actor. I have a new respect for him. The rest of the film should have been better if only to honor Scott Glenn's incredibly fine turn.","This movie was terrible. The worst I've seen in a while. The acting was OK; I'm pretty sure if you read the book, it's a good story. However, but the dialogs were so lackluster, so uninteresting. They made me wonder how could the characters connect with so little communication. They were short, superficial, trivial and dry. The storyline was very predictable. Ms. Lane's acting was very good, as usual; and Gere's as unimpressive as expected. I guess he'll be around as long as his good looks sell tickets. :(For the first time in years I actually considered getting up and leaving the theater. I'd say the only memorable thing about the movie was the location. The landscape was incredible. It's a place that definitively deserves some exploring/enjoying.I felt I wasted my time/money. If you want to watch it, wait till it's on TV. Not even worth the rental money!","I personally think this is the most difficult genre to pull off - romance has to create some magical reality, and some plausibility: we have to believe it could , would happen to them and to us.Nights partially succeeds in creating some atmosphere and some nice scenes but fails to ignite into magical.Instead what we get is just too rushed and uses too many clichés - every scene feels like it came from somewhere else - and the sparks are somehow not fireworks but squibs.It cannot decide whether to be gentle and meditative and mature, or to be unabashedly full-on.All in all it will be a box office winner given the stars and the lack of other material of its kind - but really this is no classic.","I had been counting down the months to see this movie because this is my FAVORITE Nicholas Sparks book. I was so disappointed in this movie and I get very upset everyday I think about it. Please read the book it is WONDERFUL and in no way does the movie come anywhere close to touching you the way the book does. What upsets me the most is that this could have been the best romantic film since The Notebook but it just wasn't there. Diane Lane and Richard Gere are wonderful and I LOVE them in everything but the movie just wasn't there. So don't waste your time at the movies PLEASE read the book, you will not be disappointed in the book at all!","Just so you know, this is one of those tear jerker movies at the end. I guess it's predictable, but still sad. But I just didn't buy the romance between Lane(Adrienne) and Gere's(Paul) characters. After about 4 days in which they spend the night through a bad special effects hurricane and a town social, the 2 have supposedly fallen so in love that it's changed their lives. Paul is able to go to his patient's husband and say he's sorry she died and is ready to make up with his son in South America. And Adrienne gets the courage to set out on her own and not take her cheating husband back. After Paul leaves, Adrienne is shown reading many letters from him and the two seem to be destined to be together when he returns. Of course, things don't always work out.Lane and Gere aren't given much to work with. Also, the cinematography should have been much better since this is set along the Outer Banks. We could have had some pretty sunsets and beach walks. But even that was not done well.FINAL VERDICT: If you want a chick flick that has a sad ending, then this is for you.","The chemistry between Richard Gere and Diane Lane periodically appears credible in the new film Nights in Rodanthe, adapted from Nicholas Sparks' novel, but the practicality and reasoning behind nearly all of their actions are unnatural. Borrowing heavily from the epic romance of 1980's Best Picture winner Out of Africa, Nights in Rodanthe fails to develop sense behind a spontaneous love affair between two unlikely candidates.Dr. Paul Flanner (Richard Gere) feels responsible for the death of a surgery patient who died from a reaction to anesthesia. In his guilt, he agrees to drive to an isolated beach house in Rodanthe, North Carolina to meet with the husband (Scott Glenn), who has filed a lawsuit against the dispirited doctor. The trip is on the way to his ultimate destination, however, which is to retrieve his son (James Franco) from Equador, where he has moved to in order to distance himself from his disappointment with his father and his poor handling of the fated operation.Meanwhile, Adrienne Willis (Diane Lane) is struggling with her two young children, who are in turn coping with their parent's recent divorce. Adrienne wants nothing to do with her unfaithful husband Jack (Christopher Meloni) who foments discontent with their children to coerce their mother into allowing him back. When Jack takes the kids for a spell, Adrienne travels to Rodanthe to look after a luxurious inn for her best friend  the same vacation house that Dr. Flanner has booked  leaving the two of them alone to slowly craft a life-changing romance.The love story that builds from so many tragedies simply isn't convincing. The unmindful, unlucky doctor meets with the distraught mother in a terrifying hurricane  what a perfect setting for romance. Even looking past the uninspired genesis, Nights in Rodanthe doesn't utilize its surprisingly short running time to develop the characters. The audience doesn't have time to become involved in their sudden affair, and the rest of their wooing takes place through voiceovers as they narrate love letters back and forth.It's like a sillier version of Out of Africa, but with more crying, less sweeping romance, and more modernized problems for the lovers to contend with. Not as lengthy and noticeably missing a moving soundtrack and score, the story has been done repeatedly (especially from Nicholas Sparks); as a motion picture it is simply not ambitious enough to create a worthwhile movie-going experience.Mike Massie","Nights in Rodanthe is based on a novel by Nicholas Sparks and I have read a few of his works which mainly involves 2nd-chance romance w a hint of tragedy behind it. I remembered 'A Walk To Remember', 'The Notebook', 'Message In A Bottle'. Starring Richard Gere & Diane Lane, it's a story about a housewife who just divorced her husband and was helping out her best friend's beach inn when Dr Paul arrived at the inn to stay for 5 days. Both had problems they had to face and through these few days they found each other and fell in love. Unfortunately they had to part but continued to keep in touch the old-fashioned way until... Initially, I was a bit reluctant to even make an effort to go to this movie but since it's Nicholas Sparks, I thought I should give it a chance cos Im no fan of Richard Gere nor Diane Lane. The story is pretty pacey w enough sexual tension between the 2 stars, I love the beach inn though, just what I would picture my dream beach house to be, except not that huge and prob not that close to the sea. Surprisingly I found myself mesmerized by Richard Gere, especially his eyes so I would say for his age, he's still very charming. This story is a tearjerker and even tho Im resistant to tearing, it did squeeze out a few drops and certain parts of the movie so it's still good. Overall, a so-so movie that makes you feel like you want to be in love again the old-fashioned way.","Here in Australia Nights in Rodanthe is being promoted in the same class as the Notebook. Quite frankly what a lot of rot.This film is a like a recipe. On paper we have all the right ingredients... Richard Gere normally perfect in this genre, Diane Lane an old favourite from \"Under Tuscan Sun\" and \"Unfaithful\", ocean side location, solitude and yet the movie sucks. At the session we went to yesterday afternoon a women next to my wife fell asleep and half way through the movie got up and left! The main problem is there is no build up or credibility to the relationship in the first place. And perhaps there are too many long faces and downbeat if you like histories that Gere and Lane's characters bring to the movie. There's hours of those balanced out with perhaps 5 minutes of what we can to see... romance! There's no warmth from Gere's character, Lane looks dreadful at the start of the movie and all washed out. So as the viewer we cannot really connect to the characters.Others here say the book is great. Well be it the screenplay, direction or production someone here has made a real mess of this movie. It's like the scenes and the buildup are a deck of cards except instead of being in the correct order they've just been thrown together all over the place.Very disappointing... save your money for when it hits the video shops and even then wait for a good deal when it goes to the weekly rate.","Starting off with a promising first act with lightly interesting and developed characters, rich in personality and with hints of chemistry between the two love interests, Nights in Rodanthe is a train wreck if ever there was on; giving meaning to the fact that even if a movie starts out well, it can end up in the gutter pretty quickly. Following on from the opening, the movie then resorts to cheap melodramatic contrivances, and demeans both its characters and performers by negating their roles to mere romantic plot devices used to set up act three's ridiculously sappy ending. The middle act, which finds both characters slowly falling for each other, isn't all that bad, and while it does get irksome towards the end, even such a closing would have saved the movie from being a complete disaster. Nevertheless, with a few moments of interest, usually inherent in the performance of Gere, Nights in Rodanthe isn't without its positives, but you certainly have to do a lot of looking to find them.As a romantic drama, Nights tries to do one thing and one thing only and that is to make with the mushy. Director George C. Wolfe in his big screen debut here opts to take this to an extreme however, and even goes to the point of rejecting any focus at all on characters past the half-way mark. After this point, Nights in Rodanthe turns into a holiday from hell. Mawkish, banal and overly pretentious, both Wolfe and the writers here adopt a tone of whimsy light-headedness that often clashes with the story's much more serious (at least, that's what it tries to be) subplot involving a death caused by one of these characters. What's more annoying is that the movie's earlier sequences, which although clearly unfocused and seemingly directionless, at least had some humanity present in its central figures, these earlier moments of promise are forgotten. After forty minutes or so, all that's left for Wolfe to do is to drag on the romance as far as he can to the point where we're no longer watching real people fall in love, we're simply watching an outline for a romance movie. Character A and Character B going through the motions Yawn. Haven't we done this before? To be fair both performers try and make the best of their undoubtedly tricky situation. Throughout there are moments of genuine chemistry between both Gere and Lane, and while the romance isn't exactly palpable enough to sustain much interest past the halfway mark, they at least keep the thing going as best as they can. Essentially however you get the feeling that both would rather be somewhere else; in between these instances of chemistry are scenes which fail to deliver any emotion whatsoever, even though the director seems sure that what he's doing is going to get your eyes watery. The truth is, Nights in Rodanthe is a sappy, overly emotional romantic drama; so much so that it's absurd. I can't feel for these people and I can't feel for their petty outbreaks of self-loathing angst. When I begin arguing with characters in my head whilst I'm obviously supposed to be feeling pity for them, I disconnect; it's over. Stop trying to engage me. This happened an hour into Nights in Rodanthe, and although I could have been won back, sadly it only gets worse from there.It's hard to see why anyone would enjoy such a film. Sure enough if you're a major fan of \"weepies\", for some reason enjoy watching people cry a lot and don't mind romance that feels generic and predictable then you might just get something from Nights, but even then you'll probably feel under-whelmed. There's no denying I had hope for this film; with Gere and Lane helming what looked to be a mature love story, I figured the worst that could happen would be if I was subjected to a teaspoon of fairy tale whimsy. Unfortunately however, I did get that, and I also got a shallow, unremarkable feature that was essentially a few scenes drawn out far too long with a third act that wasn't necessary or even enjoyable in the slightest. Some decent individual performances throughout, but with limited chemistry and an overwritten, overly romanticised script, Nights in Rodanthe isn't a night to remember by any means.A review by Jamie Robert Ward (http://www.invocus.net)","I think this show was right on the money for me. I watched it over the plane but there were parts in the movie that made me control myself from tearing all over the place. The chemistry between Richard gere and Diane lane was very believable (fantastic acting on both parts)! I loved how Diane lane's daughter acted in the show too. She displayed maturity and how she transformed throughout the show was easy to believe as what a teenager could possibly be like in real life. I loved this show from start to end. Definitely recommended for the romantic people out there!","Despite the fact that there were aspects of this film that I felt were not developed enough, I enjoyed it and would recommend it to others. Richard Gere and Diane Lane are great in their lead roles. The basic premise of the film is that both were in the wake of broken marriages when they meet. Both, also, are searching for healing. Unexpectedly, they find that they can help heal each other. There were aspects of the film that I wished I'd seen play out more-- where simple flashes merely suggested themes that my mind had to fill in the blanks on, such as the apology to the bereaved widower, and how Adrienne goes from feeling guilty about having slept with Paul to feeling okay with it soon after. An opportunity for a tremendous love scene was lost when it was merely suggested they were going to make love with the hurricane coming. But in the end, the film left me feeling deeply appreciative of the relationship that my wife and I share. And there were moments that moved me to the verge of tears. So, I have to say it is well worth viewing.","This movie is like a baseball player trying to hit a home run and gets really close to hitting one out of the park but never quite makes it. The producer of this movie is trying to convey some kind of important message to the audience and does a good job trying but succeeds only in sending bits and pieces. This movie also raises other questions: Is Hollywood still able to produce a love story that succeeds in keeping the audience's interest? Is Hollywood still able to produce a love story that is not corny? Is Hollywood still able to produce a love story that is well-acted and well-written? Amazingly, shockingly, unbelievably, after watching this movie, the answer to these questions is a qualified yes. Parts of this movie are tedious and can bring a viewer to the brink of slumber, but the movie sufficiently recovers to keep the audience at least awake if not thrilled. The story avoids corniness and the usual Hollywood contrivances that render such Hollywood movies unintentionally laughable and has an upbeat ending in what is, for Hollywood, an attempt to tell a dramatic story involving deeply emotional themes. Diane Lane's performance is outstanding. She is definitely the star of this movie. If you decide to take the time and spend the money to watch this movie, please remember that it's made in Hollywood, so don't expect profound philosophical insights, but do expect a movie that you may actually like."],"review-user":["preppy-3","Smells_Like_Cheese","hollyyybuggg07","rogerdarlington","aharmas","mathieu_mcdonald-1","driether","screenwriter-14","jme_boyce","yris2002","edwagreen","thomas998","baumer","Danusha_Goska","idream2","intelearts","sarahbogard","MLDinTN","GoneWithTheTwins","evetan00000","john-575","Otoboke","liyinalways","osmith-9","PWNYCNY"],"review-date":["29 September 2008","27 September 2008","5 October 2008","18 October 2008","1 October 2008","7 October 2008","29 September 2008","5 October 2008","28 September 2008","23 April 2010","22 December 2009","28 September 2009","6 October 2008","20 July 2009","29 September 2008","3 February 2009","4 October 2008","30 August 2009","25 September 2008","10 October 2008","16 November 2008","23 October 2008","17 January 2009","4 October 2008","26 September 2008"],"review-rating":["7","6","9","10","1","3","8","4","7","8","1","8","1","2","5","1","5","3","6","3","9","7","7"],"review-title":[" Not entirely successful but not a bomb\n"," It's a nice romantic film, Diane and Richard make it watchable\n"," Worth my wait....\n"," Not so bad as some have suggested\n"," Thank you, Ms Lane\n"," Who Cares\n"," Stunk\n"," And who said romance is over???\n"," Disappointed\n"," Romantic, tear-jerking, but a good-quality picture\n"," Nights in Rodanthe-It's Brief Encounter and Bridges of Madison County All in One ***\n"," Beyond belief.\n"," Love is always surreal at the beginning\n"," Filmmakers Reveal Utter Contempt for Romance Audience\n"," This movie was terrible. The worst I've seen in a while.\n"," All the parts but not sum of the whole\n"," Very Devastating!!!\n"," why do so many of Nicholas Sparks' films end sadly\n"," Nights in Rodanthe Movie Review from The Massie Twins\n"," Old-fashioned love story\n"," Unromantic, poorly made....this is not a \"Notebook\"\n"," Nights in Rodanthe isn't a night to remember by any means.\n"," Romantic, sweet old love story\n"," Healing Relationship\n"," Good movie.\n"]}