{"review-url":["http://www.imdb.com/title/tt2488496/reviews"],"review-text":["I consider myself an average Star Wars fan. I have watched all the films several times and sometimes at the cinema too.\nAt the end of episode Vi the rebels win and the good side is restored to power. Here we find out that they are a desperate ragtag bunch reminiscent of episode IV. Did I miss a movie? It cannot be because there are no whole integers between 6 and 7. What is going on? Could it be that the new director or writer have never watched Star Wars films before?\nFinally, who would make a death star with the same design flaw as before? The time and money spent on remaking something with the same problem makes it improbable. What is going on?","We have a scrap dealer who can fly a spaceship (while she didn't even have a guardian to teach her how to brush her teeth, let alone....), we have an old rusty spaceship that can still fly perfectly sitting there for her to pilot better than the last master into the stars (btw she is a scrap dealer, but they let the said spaceship to sit there waiting), we have a sewage scrubber who is deployed on the vanguard of a raiding party (environment laws were quite liberal regarding empire sorties a long long time ago) and then we have a temper tantrum cosplay boy who drops his mask everything the girls don't respond to him.Jar Jar Abrams' ex-wife needed the money I guess. Thanks Disney for contributing.","It is repetitive, reheated and made on a conveyor belt. Additionally, all the fat ugly people are standing in line or are at the drive-thru. All the beautiful and smart people are elsewhere (non-sequeled movies).\nI hope Disney enjoys the billions it made from stupid people watching the death star with the same flaw as the old models blow up again.","Apparently there is a market out there for reheated crap that is made from non-fresh ingredients. This market is worth $1 billion and capitalists and hos like Kathleen Kennedy and sell-outs like Hamill are in for the moneeey.Mullah rules the land and Jar Jar Abrams is there to deliver (i.e. destroy as he did Star Trek). Now how do you spell art, creativity, imagination or grandeur?? Who cares, where is the money I have an ex-wife to feed.","And millions of people are parked with their fat SUVs and trucks at the drive-thru poisoning themselves and their children!! Similarly, this film made a billion dollars. Enough said. people are stupid and Disney and Mr Jar Jar Rip Off will gladly take their money and stuff them.","Could somebody tell me how someone who has no ideas in life (outside making dough) be a film director? I mean this guy is just a copycat. How can they give him Star Wars? Is money everything?","Disney has money. Disney has lots of money. Why didn't they hire a good director and good actors? Why do they bring inferior amateurs to film and play in Star Wars?\nCould someone explain this to me?\nAlso, whya re they remaking and yet calling it a new episode. It is so confusing that the rebels won and now they are rebels again.\nCould someone tell me?","I do not have a hard time placing this film. On one side it's so typically hollywoodish - it's a super-production with Star Wars-related content that would make it probably to many Fan film festivals. It's very conventional in its Sunday morning TV message and the morality tale that it tells is quite conventional, and of course, we know the end of the story, either because we have watched Star Wars or because we have seen enough films from Hollywood or for both reasons. On the other side it's a film by JJ Abrams, so there is a dose of mainstream story-telling and inexplicable plot developments in its characters. The special effects are 100% created for the movie and uninspired.So it's the story of Episode IV without any twists.What makes it worse are elements of fan fiction in the story telling, distracted (but not awful) acting from Leia, Rey and others and the computer-generated special effects which succeed to create a level of thrill to a story. Did we need this story and episode? At this level of amateurishness the answer is no.","We know from Yoda and The Jedi Academy that there is an age limit and much training is required for one to attain the Jedi arts and become a practitioner. What does JJ Abrams do? He brings in a magical Disney princess who shows her middle finger to Yoda and the Jedi council.\nThen this said actress (I use the word very very very loosely) is throwing a temper tantrum in real life that the fans are not head over heels in love with her.May I ask Disney Princess Mary Sue and her bf JJ buzz.right.off?","This film was released as a result of a $1 bet between Disney CEO 'douche hungry for money' Iger and his groupie and corporate sycophant Kathleen 'bitter honey who does anything for money' Kennedy.\nThe bet went like this: I bet you $1 we can make a copy/paste script of a film, put the name Star Wars on it, hire a huckster of a director and have the world's worse actors (he he are we calling those even actors) and still make a billion dollars.\nHey you are on.","Very disappointing. Star wars was a childhood fave and a fantasy that has spun years of joy and folklore. Then this. Sure, it is Disney so it is commercial and created for sales and merchandising, but even soulless could be fun sometimes. This crap is just a self rip off designed to pump revenue out of the suckers like us. Not only there is nothing exciting or fantastic here, but also this director once again decides to ignore everything the films and stories have described and explained. For this director to still be able to work is a disgrace. Would he have a job, any job to begin with, if he were Zoroastrian or Inca or an atheist? I think not. And shame on the media and reviewers who must be acting on payola... At least now I know to save money on the next one","He s a genius and even if he is not as the member and son of the tribe he deserves to be given his fair share of projects to produce and direct. Is it his fault that the bad guys (anti-semites) rebuild a death star with the same fault and design defect as the original ones? No. Is it his fault that the new empire is flying by yet another desert planet? No. Is it his fault that the new military leader of the empire is an emo wanna-be with severe emotional turbulence and a groupie of the old jihadi darth? No. Is it his fault that good help is hard to find and the stormtroopers can't hit a Bergruutfa from a meter away? No.Are any of these reason enough to deny our eydlkayt his fill of work orders? No. And even if they were so what? We have to take care of him. You think he ruined Star Trek with non canon, time-line destroying tripe and Super 8 was a meaningless, inexplicable piece of nonsense and yet he got handed the reins for Star Wars by Talmudic Disney? Doesn't matter... keep enjoying the series, the books, merch, offshoots, sequels, prequels, TV series, rides and theme parks and don't forget to order popcorn.","This film sucks. If your boss JJ had spent 1/10th of the effort he spends being a Hollywood ho spamming the ratings here and wheeling and dealing Hollywood style to sell tickets and con people than learning how to make films or reading books to gain some imagination this film would be much better.\nAs it is, it is a typical JJ Abrams product so 1/10.\nWhat happens when Kathleen Kennedy gets fired from Di$$$ney (because you can only fool so may people for so long) and JJ loses his sugar mamma?\nEveryone knows the douche is a ho.\nMy advice to you: find a new job instead of upvoting this rubbish as a form of spam before Bad robot goes the way of Type writer.\nEveryone else, avoid this very stupid reboot.","Look in the real world what do you do when someone is dead? You bury the person or cremate them. You don't play cards with them or serve them dinner or take them to the friends' house.Star Wars is dead (but we respect and cherish the old films, memories and legacy) and Jar Jar and his corporate raider buddies are still dragging around its corpse. Admit it, without ideas, vision or respect for Star Wars and its universe it is just a corpse. It's done for and people who enable these corporate money traders by attending the showings are killing it for the universe.I do want to say that the actors are not to blame. They are poor and untalented, but hey they need to put food on the table so I get it.","Yoda was right. The darkside has cast a darkness on people. People went to watch this boring film and it made millions. It is rated eight out of ten on IMDB. The shroud of darkness has fallen and people are watching a false Star Wars. It is time for an awakening. Jar Jar Abrams goes home at night and trains his sith apprentice Rian Johnson.","I have nothing else to add except shame on you if you go see anymore of these Di$ney films (or anything by JJ Abrams).","I am so glad I borrowed this DVD from the library for free and didn't pay to watch it at the cinema or pay for a disc. i would have been so angry at myself for wasting money. Yet, I wasted my time.Firstly, the number of people who paid and paid and paid just to see a movie with 'Star' in the title is shocking. This film is so boring and unhip. The acting is atrocious. The actors and actresses have a sheepish look on their faces that says 'I will try to look serious, but deep inside I know I am not good and neither is this film.' Moreover, this film has too many one liners. What is with all the jokes that fall so flat?Secondly, Star Wars ended Episode VI with a victory for the good guys. How is it that some hitherto unknown new empire has all the power and equipment again? Er, is this the galaxy's biggest continuity gap? thirdly, there is a saying that you cannot con all the people all the time. It seems the saying is wrong. Next year (or is this year?) they will send another Star Wars to the cinema, which will be as uncool as this and reanimate the old actors with digitization and everyone will rush to see it.No wonder people are getting fatter and fatter yet the drive-through line at McDonalds is as long as ever.","I fell in love with my girlfriend's brother as a result of this film. We are so happy together now. Thanks for remaking A New Hope but substituting a Mary Sue for the hero!! Thank-you!!!!","Reading the critical response to this galaxy-sized turkey, and all the great to stellar reviews it received, we understand why the media is now as untrusted by the population as the press release of a large corporation boasting about their great products. It is all lies and paid for and everyone knows it. Movie attendees may feel as if they were the victims of a Jihad. On the one hand, the 1977 film Star Wars was a masterpiece on the other Episode VII is a naked cash grab that could have been making fun of the Star Wars phenomenon.JJ, Disney and the media prostitutes should jump off a cliff. This is not Star Wars because I will forever love Star Wars.","He is a copycat with no original or interesting bone in his body or anywhere near him.\nSeriously. He messed up Star Wars, but is it him or is he just a studio instrument who acts like it's him and it's Disney?\nThis film was boring, has no majesty, nothing new and the directing was obvious.","readers, where do I start? This boring, unimaginative spoof rip off clone of the original Star Wars proves that humanity is ready for Donald Trump. I mean this is the definitive proof that humanity is retarded and stupid and so easily conned. A billion dollar in sales and master hack and money hag JJ Abrams and Disney are laughing it up in disbelief that the computer-generated copy script sold so many tickets. You and I would be embarrassed by this disgrace and commit suicide or disband our company and hope with some plastic surgery people would never remember or recognize us, but instead there is more of this rubbish coming and why not? I mean, humanity is in decline.Not only was the script and so-called directing pathetic and nonsense supreme, but also the acting my goodness (or as the accountants at Disney and JJ would say oy vey) was so bad that I can find high school students who could walk onto the set and show more depth.If I had directed and conceived The Force Awakens I would never get laid again. Unfortunately, some women have no self respect and work only for the money so now that JJ and Disney have made a billion they can go on getting some, but still there is the matter of self respect I mentioned earlier.","This was some of the best stuff I have seen on my home moving screen. Thank you Jar Jar Abrams for your cover version! Thank you Disney for keeping share holders happy! Thank you cinema chain for keeping your styrofoam,er I mean popcorn, suppliers happy! Thank you George for selling this stuff to the conglomerate so Wall Street/Bay Street can deliver deep humanistic stuff like 'quarterly dividends' and 'profitability' and 'outlook for EPS' and other cool stuff is right on the money. The fans love ya (and who cares for the force stuff).This triumphant success proves once again that with the talents of someone like Jar jar the world does not need stupid stuff like training for the force or to become a Jedi or for Han Solo to not magically come across his old ship in the vastness of the universe. It is with genius like this that Jar Jar does not need to have tight friends to get a job. he gets assignments based on the talent (which I described above)","This film was boring. There was nothing new in it.\nSome consider the fact that it was a major movie and yet the actress was so sucky as something new. I don't think so. Most of these new actresses have no talent or formal training and are just here for some mystery. It is not casting couch either. They look terrible and the directors are not strong to begin with.\nYes, Star Wars is over and done.","I have seen this. It was 1977/1980/1983. And the chick was called Leia and flaunted her thin beautiful body. What is the reason they remade it with a Battlefield Earth craft that decades later still has power and runs???","JJ Abrams ak.a. Mr Rip off is famed for his lack of talent and here he takes it to new lows.\nFor a better film watch The Force Awakens is The Worst Move Ever.\nJJ must have no shame"],"review-user":["h-97829","uni-02719","zhh-36945","Mullah-Rabbi-Trump","anitacharran","fwq-31068","vxk-09862","zde-03245","o-25538","ofh-12539","coq-07641","ubp-12668","ycy-27512","ixg-00006","paulihnat","dfy-06699","nby-83430","xml-54426","sfa-96771","vcn-09627","ugy-75101","fio-33713","bbxmnhgl","qsc-47330","l-95084"],"review-date":["13 May 2018","3 March 2018","7 August 2018","16 June 2018","2 August 2018","6 June 2018","29 June 2018","11 December 2016","11 July 2018","31 May 2018","6 July 2016","1 July 2016","7 July 2018","25 February 2018","31 July 2018","9 June 2018","29 July 2018","28 May 2018","10 December 2016","30 June 2018","9 October 2016","31 May 2016","13 July 2018","31 July 2018","28 June 2018"],"review-rating":["1","1","2","2","1","2","2","2","2","2","3","2"],"review-title":[" I was shocked by this film\n"," This film makes a lot of sense (Jar Jar Abrams sense)\n"," The Burger King Of Cinema\n"," For Those Who Like Reheated Crap\n"," This film is as bad as eating at a McDonalds\n"," Another mess by the plagiarist JJ Abrams\n"," I do not understand\n"," Just A Tool To Make Money For Disney\n"," Supremely lazy\n"," This is Disney trolling the fans\n"," Please Buddha help us\n"," Everyone Owes The Son Of Tribe JJ Abrama An Apology\n"," Message to Bad Robot Spammers\n"," Like dragging a corpse around\n"," This Piece Of Vomit Is The Darkside Shrouding Everything\n"," The keywords for this film say it all\n"," I Cannot Understand People\n"," Thank-you Jar Jar Abrams!\n"," JJ Abrams brings you the Battlefield Earth of the new century\n"," WHO in their right mind gives a project to JJ Abrams?\n"," Anymore unoriginal and unimaginative and they would ship this film on a conveyor belt\n"," I loooooved it\n"," I am thinking of piercing my ears too\n"," Zzzzzzzzzzzzzz\n"," Another Mr Rip Off Carpola\n"]}