{"review-url":["http://www.imdb.com/title/tt2488496/reviews"],"review-text":["Abrams had the habit of cloning what others have done, and he's gone in the habitual direction. He's also set a copycat course for moving forward with this amateur cast re-playing old characters making their way through a once beloved universe.\nDown with payola critics who took the cash and gave thumbs up.","As any film with a fantasy reality, the way such a reality is presented to you means a lot. This movie presents almost nothing that we had not seen before and by better actors, which makes it all quite dull in a way. I won't spoil anything you can't read in the plot description, but if you are going to watch this know that: In every minute of this film you will feel deja vuA woman is orphaned on a desert planet That's literally all you get of an introduction to the reality of which this films take place since now all of a sudden the winners are the underdogs again.. hmm! The Disney girl plays an expressionless half-genius who has all the ability in the world already. Her face doesn't seem like she cares much and since she doesn't, I don't.Perhaps I'm being a bit harsh. The film is visually very pretty and there are a few familiar characters along the way, but I unfortunately found myself not caring one bit for anyone or their \"coincidences\". Everything I saw, everything the characters said, and everything the characters were fighting for, meant nothing to me watching it because it was all to easy and predictable if you had watched Episode IV. The bad guy is also like the neighbourood bully that scares little kids and can't maintain his discipline because everyone has seen his mother spank him or drag him in to eat his dinner greens.\n This movie is clearly made for the investors and not for fans of the original stuff - as it is an insult to those that haven't. If not an insult, then just pure failure from the director who ignores/doesn't know so many storytelling aspects that today counts as \"basic\" in order to lay the ground work for a decent movie.","There are a dozen reviews and YouTube videos that go over it. They should be obvious to anyone who has watched this remake. If you have not watched it please stay away. Jar Jar Abrams is now known as Mr. Rip off and for good reason.","Rip Off/Unoriginal: check\nSequel/Prequel/Remake/Universe/Reboot: check\nForced/Mandatory Jokes/One-liners: check\nDisney Princess: check\nSaid Disney Princess Of 21St Century Must Be Ugly: Check\nSaid Disney Princess of 21st Century Must Hide Her Body To Hide Unattractiveness And Be Western-Taliban: CheckMerchandise/Chinese Imports/Rides/Tie-Ins To Follow Because Why Make A Movie To Make A Movie/Art/Entertainment?? : CheckForced Chinese Person Inserted To Satisfy China Marketing & Accounting Teams: CheckScript Delivered/Proof-Read By Accounting Crack Team: CheckScript Test Marketed Through Consumer Panels: CheckPaying So-Called Critics To Give Standard-Issue 5/5 and 4/4 and 10/10 to All Of The Above: Check","We should have known this film will be a trick and swindle as soon as Disney handed it to the remake/reboot hack specialist JJ Abrams.\nHe has since garnered the nickname Jar Jar Abrams, but it should have been clear that in lieu of making a new (sequel) Star Wars film with imagination and creativity our Jar Jar here will work on a calculated script to make money money money Star Wars its universe and lore be damned.\nThe remake is The Force Awakens. It takes the Star Wars plot and lore and infantalizes it with the very chic and hip (sarcasm) girl power and Disney brass like the much hated Kathleen 'ho for the money' Kennedy watch the cash wad fly.\nBad (quite awful) 'actors', a story ripped off from the original, but without depth and the aforementioned commercial director make this film a signal to the movie going public to just move on.","Many are asking themselves how could Mr. Rip Off JJ Abrams who has spent his whole life cloning and aping others be given Star Wars after mocking Star Trek?\nLet me tell you.\nOnce upon a time Spielberg had an assistant who through certain talents rose from being a secretary to producer. This lady producer became in charge of LucasFilm after George Lucas sold out his employees, his company, his dignity and made out like a bandit betraying Star Wars.\nAt the same time Spielberg was grooming his boy/his admirer/his copycat JJ Abrams. \nThe connection was made.\nStar Wars and cinema are the losers.","Could somebody tell me how someone who has no ideas in life (outside making dough) be a film director? I mean this guy is just a copycat. How can they give him Star Wars? Is money everything?","This film sucks. If your boss JJ had spent 1/10th of the effort he spends being a Hollywood ho spamming the ratings here and wheeling and dealing Hollywood style to sell tickets and con people than learning how to make films or reading books to gain some imagination this film would be much better.\nAs it is, it is a typical JJ Abrams product so 1/10.\nWhat happens when Kathleen Kennedy gets fired from Di$$$ney (because you can only fool so may people for so long) and JJ loses his sugar mamma?\nEveryone knows the douche is a ho.\nMy advice to you: find a new job instead of upvoting this rubbish as a form of spam before Bad robot goes the way of Type writer.\nEveryone else, avoid this very stupid reboot.","Whoever came up with this is such a genius.\n I wonder which genius came up with this. I mean just the name Star Wars is so cult. She must be a beacon of humanity and hope. I heard a rumor that she was an assistance (more like guide and masseuse) to Steven Spielberg who did a favor to him and gave the project to Spielberg's groupie and acolyte JJ Abrams. What a genius connection.This woman (lady!) also came up with concepts like the force, yoda, jedi, light sabers and orphan destitute girls who can fly spaceships with such a skill.Wow who is this brilliant artiste??","I am so glad I borrowed this DVD from the library for free and didn't pay to watch it at the cinema or pay for a disc. i would have been so angry at myself for wasting money. Yet, I wasted my time.Firstly, the number of people who paid and paid and paid just to see a movie with 'Star' in the title is shocking. This film is so boring and unhip. The acting is atrocious. The actors and actresses have a sheepish look on their faces that says 'I will try to look serious, but deep inside I know I am not good and neither is this film.' Moreover, this film has too many one liners. What is with all the jokes that fall so flat?Secondly, Star Wars ended Episode VI with a victory for the good guys. How is it that some hitherto unknown new empire has all the power and equipment again? Er, is this the galaxy's biggest continuity gap? thirdly, there is a saying that you cannot con all the people all the time. It seems the saying is wrong. Next year (or is this year?) they will send another Star Wars to the cinema, which will be as uncool as this and reanimate the old actors with digitization and everyone will rush to see it.No wonder people are getting fatter and fatter yet the drive-through line at McDonalds is as long as ever.","Apparently there is a market out there for reheated crap that is made from non-fresh ingredients. This market is worth $1 billion and capitalists and hos like Kathleen Kennedy and sell-outs like Hamill are in for the moneeey.Mullah rules the land and Jar Jar Abrams is there to deliver (i.e. destroy as he did Star Trek). Now how do you spell art, creativity, imagination or grandeur?? Who cares, where is the money I have an ex-wife to feed.","This film was released as a result of a $1 bet between Disney CEO 'douche hungry for money' Iger and his groupie and corporate sycophant Kathleen 'bitter honey who does anything for money' Kennedy.\nThe bet went like this: I bet you $1 we can make a copy/paste script of a film, put the name Star Wars on it, hire a huckster of a director and have the world's worse actors (he he are we calling those even actors) and still make a billion dollars.\nHey you are on.","I fell in love with my girlfriend's brother as a result of this film. We are so happy together now. Thanks for remaking A New Hope but substituting a Mary Sue for the hero!! Thank-you!!!!","He is a copycat with no original or interesting bone in his body or anywhere near him.\nSeriously. He messed up Star Wars, but is it him or is he just a studio instrument who acts like it's him and it's Disney?\nThis film was boring, has no majesty, nothing new and the directing was obvious.","It is repetitive, reheated and made on a conveyor belt. Additionally, all the fat ugly people are standing in line or are at the drive-thru. All the beautiful and smart people are elsewhere (non-sequeled movies).\nI hope Disney enjoys the billions it made from stupid people watching the death star with the same flaw as the old models blow up again.","This was some of the best stuff I have seen on my home moving screen. Thank you Jar Jar Abrams for your cover version! Thank you Disney for keeping share holders happy! Thank you cinema chain for keeping your styrofoam,er I mean popcorn, suppliers happy! Thank you George for selling this stuff to the conglomerate so Wall Street/Bay Street can deliver deep humanistic stuff like 'quarterly dividends' and 'profitability' and 'outlook for EPS' and other cool stuff is right on the money. The fans love ya (and who cares for the force stuff).This triumphant success proves once again that with the talents of someone like Jar jar the world does not need stupid stuff like training for the force or to become a Jedi or for Han Solo to not magically come across his old ship in the vastness of the universe. It is with genius like this that Jar Jar does not need to have tight friends to get a job. he gets assignments based on the talent (which I described above)","We know from Yoda and The Jedi Academy that there is an age limit and much training is required for one to attain the Jedi arts and become a practitioner. What does JJ Abrams do? He brings in a magical Disney princess who shows her middle finger to Yoda and the Jedi council.\nThen this said actress (I use the word very very very loosely) is throwing a temper tantrum in real life that the fans are not head over heels in love with her.May I ask Disney Princess Mary Sue and her bf JJ buzz.right.off?","The reboot of Star Wars by remake expert JJ Abrams rightly earnt him the nickname Jar Jar Abrams (because even George Lucas is not innocent in all of this having cashed in to the Disney nasty corporate remake empire). Yet, the biggest problem lies with capitalism and the need to constantly trick people out of their money with products that are low on quality and huge in marketing, quality be darned.People, wake up and smell the roses outside in the real world. It is far more enjoyable than paying for these corporate products by goofs like Jar Jar and his treasury bosses.PS: Next time get a pretty girl to run around in your movies. At least, that is something.","And millions of people are parked with their fat SUVs and trucks at the drive-thru poisoning themselves and their children!! Similarly, this film made a billion dollars. Enough said. people are stupid and Disney and Mr Jar Jar Rip Off will gladly take their money and stuff them.","We have a scrap dealer who can fly a spaceship (while she didn't even have a guardian to teach her how to brush her teeth, let alone....), we have an old rusty spaceship that can still fly perfectly sitting there for her to pilot better than the last master into the stars (btw she is a scrap dealer, but they let the said spaceship to sit there waiting), we have a sewage scrubber who is deployed on the vanguard of a raiding party (environment laws were quite liberal regarding empire sorties a long long time ago) and then we have a temper tantrum cosplay boy who drops his mask everything the girls don't respond to him.Jar Jar Abrams' ex-wife needed the money I guess. Thanks Disney for contributing.","Disney has money. Disney has lots of money. Why didn't they hire a good director and good actors? Why do they bring inferior amateurs to film and play in Star Wars?\nCould someone explain this to me?\nAlso, whya re they remaking and yet calling it a new episode. It is so confusing that the rebels won and now they are rebels again.\nCould someone tell me?","I do not have a hard time placing this film. On one side it's so typically hollywoodish - it's a super-production with Star Wars-related content that would make it probably to many Fan film festivals. It's very conventional in its Sunday morning TV message and the morality tale that it tells is quite conventional, and of course, we know the end of the story, either because we have watched Star Wars or because we have seen enough films from Hollywood or for both reasons. On the other side it's a film by JJ Abrams, so there is a dose of mainstream story-telling and inexplicable plot developments in its characters. The special effects are 100% created for the movie and uninspired.So it's the story of Episode IV without any twists.What makes it worse are elements of fan fiction in the story telling, distracted (but not awful) acting from Leia, Rey and others and the computer-generated special effects which succeed to create a level of thrill to a story. Did we need this story and episode? At this level of amateurishness the answer is no.","He s a genius and even if he is not as the member and son of the tribe he deserves to be given his fair share of projects to produce and direct. Is it his fault that the bad guys (anti-semites) rebuild a death star with the same fault and design defect as the original ones? No. Is it his fault that the new empire is flying by yet another desert planet? No. Is it his fault that the new military leader of the empire is an emo wanna-be with severe emotional turbulence and a groupie of the old jihadi darth? No. Is it his fault that good help is hard to find and the stormtroopers can't hit a Bergruutfa from a meter away? No.Are any of these reason enough to deny our eydlkayt his fill of work orders? No. And even if they were so what? We have to take care of him. You think he ruined Star Trek with non canon, time-line destroying tripe and Super 8 was a meaningless, inexplicable piece of nonsense and yet he got handed the reins for Star Wars by Talmudic Disney? Doesn't matter... keep enjoying the series, the books, merch, offshoots, sequels, prequels, TV series, rides and theme parks and don't forget to order popcorn.","I have nothing else to add except shame on you if you go see anymore of these Di$ney films (or anything by JJ Abrams).","Very disappointing. Star wars was a childhood fave and a fantasy that has spun years of joy and folklore. Then this. Sure, it is Disney so it is commercial and created for sales and merchandising, but even soulless could be fun sometimes. This crap is just a self rip off designed to pump revenue out of the suckers like us. Not only there is nothing exciting or fantastic here, but also this director once again decides to ignore everything the films and stories have described and explained. For this director to still be able to work is a disgrace. Would he have a job, any job to begin with, if he were Zoroastrian or Inca or an atheist? I think not. And shame on the media and reviewers who must be acting on payola... At least now I know to save money on the next one"],"review-user":["lat-08077","GraceleeRH","c-68927-09022","cyx-39419","Bring_Back_The_Forums","Larry-Donalds","fwq-31068","ycy-27512","amh-84851","nby-83430","Mullah-Rabbi-Trump","ofh-12539","xml-54426","vcn-09627","zhh-36945","fio-33713","o-25538","twf-37243","anitacharran","uni-02719","vxk-09862","zde-03245","ubp-12668","dfy-06699","coq-07641"],"review-date":["8 September 2018","2 March 2018","29 August 2018","10 July 2018","27 January 2018","3 September 2018","6 June 2018","7 July 2018","24 July 2018","29 July 2018","16 June 2018","31 May 2018","28 May 2018","30 June 2018","7 August 2018","31 May 2016","11 July 2018","29 January 2018","2 August 2018","3 March 2018","29 June 2018","11 December 2016","1 July 2016","9 June 2018","6 July 2016"],"review-rating":["1","2","1","1","2","2","2"],"review-title":[" Remake Wars: Episode Who Knows? - The Farce Awakens Review\n"," They say it is a remake for children\n"," I Won't Bother To Rehash All The Plotholes\n"," A Disney/Bad Robot Tradition\n"," Capitalism Double-Crosses The Film's Fans\n"," It's Who You Know And Not What you Know\n"," Another mess by the plagiarist JJ Abrams\n"," Message to Bad Robot Spammers\n"," Hollywood is in great hands\n"," I Cannot Understand People\n"," For Those Who Like Reheated Crap\n"," This is Disney trolling the fans\n"," Thank-you Jar Jar Abrams!\n"," WHO in their right mind gives a project to JJ Abrams?\n"," The Burger King Of Cinema\n"," I loooooved it\n"," Supremely lazy\n"," The dangers of capitalism\n"," This film is as bad as eating at a McDonalds\n"," This film makes a lot of sense (Jar Jar Abrams sense)\n"," I do not understand\n"," Just A Tool To Make Money For Disney\n"," Everyone Owes The Son Of Tribe JJ Abrama An Apology\n"," The keywords for this film say it all\n"," Please Buddha help us\n"]}