{"review-url":["http://www.imdb.com/title/tt2527336/reviews"],"review-text":["SPOILER: This movie was just magical.The Force has become like Harry Potter magic, with a new spell every day or so.Rey is just magical. With practically training whatsoever she can take on Luke and Kylo and win.Snoke is magical. He appeared out of nowhere in The Force Awakens and in The Last Jedi has such fantastic Force powers (never before seen in the entire Star Wars Universe) and yet can't tell when his protege is scheming to slice him in two (but could fell his every throught earlier, and even manipulate him and Rey's thoughts and get them to intergalactically Skype each other and even send water through space).Luke is magical. He can magically project himself light years away and even bring solid things (the lucky dice) with him. Then dies magically for no apparent reason.Yoda is magical. His Force-ghost actually has more Force powers than when he was alive! Calling down lightning from the sky??? Heck, why don't the Jedi just do that when fighting on Tattooine or whatever? And if Force-ghosts still have Force powers why not the whole gang of Anakin, Ben and Yoda take on Snoke?Rose is magical. She appears out of nowhere and just happens to go along with Finn on a completely unnecessary mission to find a code breaker, and find not one but TWO code breakers, one of which is in the SAME CELL as they are. I mean, is that magical or what?Leia is magical. Previously in 7 movies only having the barest abilities in the Force, she now can survive in space for quite a long time and even open her eyes without getting them immediately frozen, and Force-Mary Poppins herself back to the space ship. Magical!I could go on and on. The biggest problem with The Last Jedi is that it's one shameless Deus Ex Machina after another. And don't even get me started on the stupid feminist nonsense, the inane attempt at comedy, the stupid characters who go nowhere in their characterisation, the stupid casino subplot, the stupid \"saving\" of Finn who wanted to sacrifice himself by Rose who magically now has feeling for him and both of them magically survive without getting shot at by the entire First Order army. Oops, I did go on and on.If you make a movie, you need to make sure your movie stays in the universe it came from. Not invent new rules, new powers, new super villains, new behaviours from old characters, etc. out of bloody nowhere.","This didn't feel like Star Wars. Now, I know people said that after viewing The Phantom Menace, but the prequels, despite their flaws, delivered a picture of a larger and more complex galaxy than the one we were introduced to in the original trilogy. The prequel characters were poorly written, scene direction felt off at times, Jar Jar existed, but at the end of the day I'll take the prequels over the new Disney films because they painted a universe. They made me want to see more Star Wars, and I appreciated the original trilogy's story arc even more after watching them. The Last Jedi did the complete opposite. It killed my interest in the Star Wars universe because there seems to be nothing left to care about. The Resistance is just the Rebels. The First Order is just the Empire. No end is in sight. Rey is perfect already. Snoke is dead and no one cared enough to even explain his existence in the first place. The original trilogy might as well just have never happened. We've had three death stars. No stable political structure seems to be possible in the galaxy, and if it were we wouldn't visit it in the films. For all we know the conflict could be taking place in one tiny sector of the galaxy with the rest of the galaxy completely out of the loop. Sure, some people in a space casino make money off selling weapons and a slave kid has a Rebellion ring now, but that's not enough to establish why I should care about the story anymore. \"They blow you up today, you blow them up tomorrow.\"The humor was cringe-worthy. Even the characters don't care. Poe's prank-call at the beginning dissolved any anxiety we might feel about his character right out the gate. Star Wars doesn't have to take itself seriously 100% of the time, but its characters should feel like they're fighting real battles. I don't even want to talk about the casino scenes. Disney has no right to lecture us on capitalism. Much of the movie was just scenes lifted from The Empire Strikes Back and Return of the Jedi, cut-and-pasted around in a different order as if we couldn't figure that out. I sense a tone of disrespect for viewers' intelligence. Additionally, it is deeply disturbing to me to see critics give this movie such a high rating and then see news outlets publish articles questioning how seriously we should take the backlash. It is not a flaw in the ratings system. Sure, casual and young viewers will enjoy. But the backlash is real, and it's not all crusty old fanboys nostalgic about the good ol' days and complaining about political agendas (not that the fanboys always have illegitimate arguments). I'm a twenty-two year old woman and I was very disappointed. Star Wars is for everyone. That should include fans, and people who love good stories.","I didn't hate TLJ, but even if I completely ignore all the (among many fans) controversial choices Rian Johnson made with regards to his treatement of Star Wars' lore and characters, I still have a great number of qualms with the film in terms of its storytelling (sorry, this is going to be rather long):PACING: Now that was probably my biggest issue with the film. Apart from the opening battle, the film has very little forward momentum for nearly two thirds of its running time. After the action-heavy beginning, the plot gets tangled in 3 separate storylines which unfold simultaneously. My (perhaps personal) problem was that I found 2 of those neither emotionally involving nor thrilling: the Finn/Rose subplot about finding the code-breaker on the \"Casino Planet\" Canto Bight as well as the Poe/Holdo storyline about the resistance' messy escape from the First Order and the universe's most sluggish space chase. But the one story I was ready to get fully invested in - you know: the one about Rey and Luke on the island (and Kylo via Force-Skype) - not only offers very little in terms of action and visual excitement, it also never really gets the time to breathe: because the overall narrative requires the film to cut back and forth between it and the other two evolving story threads.\n \nThe result of that narrative structure is 90 minutes of scenes with Rey and Luke (and a little Kylo) on a dreary, grey island that beg to resonate emotionally but get blunted each time by the film's need to cut to the (for me) somewhat uninvolving action in Finn's and Poe's part of the universe. And their two storylines lose all sense of urgency because they keep getting interrupted by the scenes on the island with Rey and Luke - which, to make matters worse, develop over several days in the film while Finn's and Poe's stories unfold over a couple of hours.Due to that uneven structure we end up with a two-and-a-half-hour movie where the most crucial scenes of the story never get enough room to breathe and even feel rushed. It's only once all three storylines start coming together during the last third of the film that the film's pacing really works for me. But getting there often feels like a chore (and I'm really not sure a Star Wars film should feel like work).ODD CHARACTER CHOICES: What is the purpose of having Leia in a coma for the better part of the film? Don't tell me this is all set up so Kylo thinks she's dead: she's connected to the Force, and he's about as plugged into the Force as one can be; if established Star Wars lore tells us anything, it's that Kylo would instantly feel it if his mother died (now that's something even a casual fan such as myself knows). So why not use Leia more? Why introduce a completely new character in Laura Dern's Admiral Holdo, if she essentially just functions as a stand-in for Leia?Poe Dameron's whole arc in the film is about him learning the terrible human cost for stupid, vain heroism, and it's with Leia that he clashes, after he's sacrificed half the resistance' fleet in order to take out a single Dreadnought during the film's opening battle. And as soon as Leia's in a coma, almost the exact same conflict continues with Holdo. Nothing against Admiral Holdo, but it's hard to get invested in her character, because we only just met her; from a storytelling point of view, to make Poe's arc really resonate and raise the stakes for him (and the audience), it would make much more sense if he rebelled against Leia. Wasting her in a coma instead seems utterly pointless.BIG MOMENTS: Unlike its immediate predecessor, TLJ shuns familiar formula. It's not all forward momentum, it's not all action - but unfortunately, it fails to provide the audience with an emotionally involving story instead. It may take characters in unexpected directions, but most of those new directions turn out to be somewhat... rather \"mature\" choices in terms of storytelling instead of exciting ones? Yes, there are several grand moments in the film that work great on an intellectual level, but they fail to reach us on a gut level. Whenever the film tries to build up to a big emotional moment, that moment ends up feeling, well, not very big at all - which naturally could again be a very deliberate choice by the director to subvert the formula, but to what end? Surely, the subversion itself can't be his main goal?For example, take the scene where Rey learns from Kylo that her parents were nobodies and that they're long dead. The problem of that scene is not the reveal itself: it's the scene's execution. It's a huge reveal for Rey, and it should have more weight. It could - and probably should - be the most emotional moment in the film; a heart-felt gut-punch to our heroine, but instead it's just: *fighting* - \"Your parents were nobodies, and they're dead.\" - \"Yes, I feel it too.\" - *fighting continues*. I just don't get why such an important moment is treated so fleetingly.In contrast, look how Lawrence Kasdan and J.J. Abrams staged The Force Awaken's most emotional scene: Han Solo's death at the hands of his own, terribly conflicted son. Now you can say about the film itself what you want, but that scene had a huge emotional impact on the viewer. It had weight. Imagine that scene had just happened during a fight, in a heated moment, only for the narrative to proceed without giving it any room? These are storytelling choices by Rian Johnson that don't do the movie any favors. I would have been ready to applaud the director's (and/or Disney's) decision to try something different after TFA, but I lament this failure to develop emotional gravitas - and the film's unwillingness to ever raise the stakes for its lead characters. Until the very end, I never feel like any of the protagonists are in real danger. Nor are they ever confronted with the shocking consequences of their reckless actions on a personal level; Finn and Poe's great ideas and plans directly lead to the senseless deaths of dozens, if not hundreds of people - but those casualties are just numbers; they're just exploding spaceships we witness from afar; our heroes (and we as an audience) are never forced to feel the full weight of their loss.As a consequence, there's just nothing there to make this war's terrible cost really resonate with us. This film needs a heartfelt punch to the gut; I'm all for challenging the protagonists morally and give them intellectually satisfying arcs, but the resulting storylines should still be exciting enough to make your heart pound. And I know I can only speak for myself, but my heartbeat hardly ever accelerated throughout its entire two-and-a-half-hour running time - if at all.TLJ'S ISSUES AS A DIRECT SEQUEL: TFA teased a boatload of things to come, and while I'm theoretically on board with many of the unexpected directions Rian Johnson took these characters to in TLJ, I am very confused by his decision to ignore so many of the plot threads that were set up by Lawrence Kasdan and J.J. Abrams in TFA. Because due to that unorthodox approach, watching those two films back to back is a jarringly weird experience. Regardless how one feels about TFA, not even bothering to acknowledge what came before isn't just strange - it's almost offending to the many people who were fully invested in its mysteries and could hardly wait for those promised reveals.And don't tell me they have only themselves and J.J. Abrams to blame; no - they had every right to have those expectations: because TLJ IS the direct sequel to TFA. In the same sense that BACK TO THE FUTURE II was the direct sequel to BACK TO THE FUTURE: the kind of sequel that continues only seconds after the first film ends, resulting in one unbroken storyline developing over two films. And of course the director can go into unexpected directions in the sequel - hell: as an audience we want him to. In fact, that IS part of our expectation and one of the reasons we go to the movies (and BTTF II did it brilliantly) - but pretending like important plot points and huge moments in the previous film simply didn't matter or didn't even happen comes dangerously close to playing the audience for fools.Not that an artist (or a huge conglomerate) shouldn't have the creative licence to do that - but if you go down that road don't act surprised about the inevitable backlash. And I honestly don't get why going into new directions had to result in such an uneven transition from the first film to the second; the way I see it, even a couple of lines of dialog from characters like Luke, Snoke or Kylo-Ren would have been enough to tie some of the most prominent lose ends up or at least not just leave them dangling in the air like this. I mean, I get that Johnson doesn't want us to be interested in Snoke's story (and a whole bunch of other things that were made to feel important in TFA) because HE isn't interested in it. But as a writer he could get that point across and still address the issue (because the previous film told the audience to BE interested in it) - just to then quickly resolve it in an offhanded manner and take the story where he wants it to go.SUMMARY: The Last Jedi is a structurally uneven and often frustrating film that almost always refuses to give its heroes - and the audience - satisfaction. It is a film that over large stretches of its running time is so concerned with subverting the formula and teaching lessons about the importance of failure, that it fails to realize how watching your heroes fail over two and a half hours may be unexpected, but frankly - it's also a bit tiring.It may have been a gutsy and very unexpected move by Johnson to throw out most of the mysteries teased in TFA, but the question only audiences - and time - can answer is whether what he offers instead is a worthy replacement.Favorite films: IMDb.com/list/mkjOKvqlSBs/Lesser-Known Masterpieces: imdb.com/list/ls070242495/Favorite TV-Shows reviewed: imdb.com/list/ls075552387/","They are making too many movies, I think. The story is uninteresting, the acting is somehow weak. It seems a little unsure or perhaps the actors are reacting to a poor script. \nI have watched all the new Star Wars so far and I don't feel like watching anymore because to be honest with myself they are uninteresting. There are better movies out there or I can just do other stuff.","At the beginning of episode IX Luke wakes up from a good afternoon snooze. He is in bed and looks around for a cup of jasmine tea. He searches his memories and everything in episodes VII and VIII were a nightmare a darkside vision, which he banishes from his mind. Now back to talent, good acting (Fin and Rey and the emo kid do not exist - neither do standard issue Disney jokes and quips) and STAR WARS!","I had relatively high expectations of the Episode VIII. Unfortunately, \"The Last Jedi\" has so many plot holes, inconsistencies, ripoffs from previous movies, annoyingly flat and underdeveloped characters and dialogs, that it deserves many bad reviews that it receives from the public. It could have been so much better...PLOT HOLES and THINGS THAT DOESN'T MAKE SENSE - examples:\n------------------------------------------------------------------------------------------------\nVice Admiral Holdo, for no reason at all, doesn't inform Poe and other members of the Resistance about the planet Crait and the escape plan. This creates Poe's unnecessary mutiny, just to fill the movie with some unneeded drama and to make cheap \"twist\" when we realize what the Leia's and Holdo's plan is.BB-8 overpowers and ties 3 prison guards armed with blasters, and muffles their mouths... ALONE.Not enough convincing reasons are shown to explain Skywalker's decision to abandon his sister, friends, whole Republic and Resistance, even if they all get killed during his exile. That decision, and the decision to kill Ben, is not in line with Luke's character from the previous movies.Why did Luke make a map which shows his location, and then put a map piece in R2 and gave a map piece to Lor San Tekka, if he didn't want to be found? Whole story about \"The map to Skywalker\" from Episode VII is now illogical...Not even ONE information about Snoke's background, long-term plans, source of his power, etc.? Unbelievable how they wasted that character....Water ends up on Kylo's glove after \"Force connection\" talk. That looked completely out of touch with how the Force works in the previous movies. The same problem is present in the scene with Yoda's Force ghost, when he summons real lightning from the sky and therefore directly influences events in the real world (and then he laughs about that like a lunatic).Why all armies in the galaxy don't use \"hyperspace torpedoes\" to ram spaceship fleets of the enemy, like Holdo did with the Resistance's spaceship, if that is so effective tactic?Also, why Resistance's ship commanders have to stay and die on their ships when all fuel is spent? We are shown that a ship without fuel is useless in any case, and so their death is also useless...Leia survives WITHOUT A SCAR massive explosions that killed everybody else on the ship's bridge, and she also survives vacuum of space (Jedi are not immortal, and without a space suit a Jedi / human would not survive for more than 60 seconds in space). Then she somehow moves herself through space back to the ship, while her dress is waving like the wind is blowing in space.Luke gives Han's golden cubes (dice) to Leia, knowing they have great emotional value to her, although he is aware that cubes will vanish in about 20 minutes because they are also \"Force projection\". That was a very cruel thing to do (and something that Luke wouldn't done)... A few minutes later Leia is leaving cubes behind when she escapes from the base, although our logic tells us that she would keep them. By the way, Leia and Kilo were able to hold dice in their hands. How? Han's golden cubes were \"Force projection\", and Luke showed us while he was \"fighting\" Kilo that Force projection is like a Force ghost - it could not be touched or held. BB-8 manages to disable guards by shooting a pile of golden coins at them. The BB-8 has special compartment for storing coins, and special device for shooting them? And so much coins were inserted in him in the casino? And coins are enough to disable the guards? Silly...BB-8 is piloting AT-ST walker alone, AND he is firing its cannons with great precision in the same time. 4 hands were needed for that in the \"Return of the Jedi\"...Finn and Rose parked their spaceship on the beach of the casino planet, where it was easily seen and reported to the police, although they came there on a secret mission and should have landed on some hidden spot. That doesn't make sense...Finn and Rose enter the casino dressed in their usual clothes, although they don't want to draw attention to themselves. That was so naive and stupid... Would not be a better idea if they picked something to wear similar to those rich people around them? Rose is wearing dirty mechanic clothes when they enter the casino...Finn and Rose are releasing \"space horses\" from the stable, but not the children-slaves.Finn and Rose are trying to escape from the casino planet as soon as possible by riding \"space horses\", although they still didn't completed their mission (they didn't enlist help from a codebreaker). Why? As far as they know, the fate of the Resistance depends on finding the codebraker, but they just flee...On the planet Crait, Rose and Finn have relaxed, slow romantic scene and they share a kiss, while army of gigantic AT-ATs in front of them are firing on anything that moves, and First Order is just about to kill all their friends. Also, their \"love story\" was totally unnecessary and unconvincing.How is Finn (who is dragging Rose's body) able to cross the great distance back to the Rebel base after that, without being attacked? Kilo Ren is not suspicious when Luke holds the same lightsabre on the planet Crait as the one which was split in half shortly before that, when Kylo was confronting Rey.Rey falls into a body of water on Ahch-To and swims easily to the shore. She has spent her entire life on a desert planet. When did she learn to swim? Chewie, R2-D2 and C-3PO do almost nothing during the movie, they are there only because the movie should \"feel\" like a Star Wars movie to the older fans.Too much unnecessary jokes and humor, and too much Porgs - just to please kids who will buy Star Wars toys later...Poe's phone-prank at the beginning of the movie was cringe-worthy. That was the first sign for me that this movie may not be so great as I hoped it would be.Phasma was again completely wasted character, without any purpose in the plot (other than to boost sales of the action figure).\nRIPOFFS FROM THE ORIGINAL SAGA - 3 examples:\n-----------------------------------------------------------------------------\nTaken from \"The Empire strikes back\": Surface battle on the remote white planet, complete with AT-AT walkers, low flying rebel fighters, secret rebel base hidden under the surface, trenches, rebel cannons, etc. (Battle oh Hoth)Taken from \"Return of the Jedi\": Kylo (Vader) brings Rey (Luke) to the Snoke (Emperor), while Rey (Luke) is hoping that Kylo (Vader) can be turned from the Dark Side. Snoke (Emperor) shows Rey (Luke) how the Rebel fleet is destroyed while they speak. Snoke (Emperor) has Rey's (Luke's) lightsabre beside him, which Rey (Luke) wants to get by using Force. Many parts of the dialogue are almost the same.Taken from \"Return of the Jedi\": Millennium Falcon is chased by TIE-Fighters through the mines of mineral planet Crait - that scene is almost exact copy of the chase through the Death Star in the Return of the Jedi, where we also had TIE-Fighters chasing Falcon through similar tight spaces and obstacles (they just painted them red in this movie).There are many more reasons why this movie is a failure... If you go to see \"The Last Jedi\", turn off your brain, banish all hopes, and just enjoy beautiful cinematography. At least they have done that right.","The Last Jedi is obsessed with the fallacious idea that in order to move forward you have to destroy everything that came before. It is as if someone walked into the Louvre and said \"you guys need to stop holding onto the past,\" and then threw a torch down, cackling as hundreds of years of irreplaceable works of art burned to the ground, and then, standing triumphantly on the ashes, drew a smiley face.In order to make room for the new characters to shine, Rian Johnson obliterates the character of Luke Skywalker to the point that Hamill himself couldn't recognize him; in the Original Trilogy Luke Skywalker transforms from a whiny farm boy into a hero who proclaims \"I am a Jedi, like my father before me\" and manages to do what both Yoda and Obi-Wan thought impossible: bring Darth Vader back to the light. In this film, Luke is tempted to murder his own nephew before he even did anything wrong simply because there is a chance he may turn to the dark side, but the worst thing is that after that rather than attempt to fix his mistake he falls into a pit of despair and hides on an island as his friends are slowly wiped out by the First Order. When Rey arrives he refuses to train her or help the resistance in any way (despite having made a map to his location in the previous film), until a strange out of character pyromaniac Yoda force ghost appears and tells him Rey is perfect already and also the extremely cliched line that \"the greatest teacher, failure is.\" Luke is not the only wasted character from the Original Trilogy either: Chewbacca serves as nothing more than comic relief and Leia is incapacitated for most of the film after a strange Mary Poppins-esque stroll through outer space. Admiral Ackbar is killed so unceremoniously you barely even notice he dies.The usage of the force in this film is wildly inconsistent with the previous films as well. First of all, force ghosts never were able to alter physical reality, yet in this film Yoda is able to bring lightning down from the sky, leading us to the question of why the force ghosts haven't just destroyed Snoke from their impenetrable positions in the netherworld. Leia is able to fly through outer space, and Snoke can force push people from across vast distances. Rey is able to lift multiple tons of boulders with apparent ease despite how difficult it was for Luke to make a single X-Wing in the Empire Strikes Back even budge. The force projection that Luke does at the end is actually interesting, but for some inexplicable reason they decide to make it kill him.From a critical standpoint, the film is an incoherent mess. There is little to no character development and the plot is little more than a long, drawn out series of \"gotcha\" moments; we are treated like dogs, as Rian Johnson dangles delicious treats above us before rapidly yanking them away. In the climax of The Force Awakens Rey finds Luke and extends his lightsaber, but in The Last Jedi Luke merely throws the lightsaber over his shoulder. Leia is sucked into outer space, only to magically force fly back to safety. Luke agrees to train Rey, but then quits after only one pathetic training session. Finn is about to heroically save what's left of the resistance, but - surprise! - he is saved at the last minute by his awkward love interest. Snoke is the most powerful sith in any Star Wars movie ever, but is anticlimactically killed by a cheap trick. The entire first half of the movie leads us to believe Kylo Ren and Rey will join forces, but after Kylo Ren saves Rey - surprise! - they're not going to work together: Kylo Ren will remain the stereotypical bad guy and Rey the infallible heroine. Rian Johnson had a chance to actually do something original and daring in this respect, but instead chose to take the safe route.The writing in this film is atrocious. Several lines are lifted verbatim from the Original Trilogy. The humor is out of place, overused, and sounds like they took the words of a heckler writing in the margins and thought they should actually put it in the movie (Star Wars meets Rocky Horror Picture Show). We are distracted by pointless subplots that are of no consequence. The new characters have no personality and sound like modern day buffoons who were simply transplanted into the Star Wars universe. There is so much wrong with it that you really just have to see it for yourself, although I would recommend not paying money for it. In conclusion, The Last Jedi is the worst Star Wars movie ever made. It is heretical. It is the anti-Star Wars. It stinks.","I feel America is finished. Really. The person who greenlighted this, the system that produced this, the studio that farted this, the so-called director that 'directed' this and most of all all the suck-up paid for and bought critics. \nWhat was this??\nIt violates everything we know about Star Wars as far as creativity, Jedi rules, behavior of the characters and give me a break on the complete joke of the acting. What was that?\nMan, they talk about America's Trump Slump at the Olympics, I feel there is an American slump in the movies. There is a Marvel movie a week, there is all these terrible Star Wars (the one by JJ Abrams was as bad) and they all blow.\nI am declaring that I am done with American films, reviewers, Disney and Star Wars (no I love the real Star Wars, this crap is not Star Wars).\nAll involved should go hide in a hole somewhere.","That is my prediction. IMDB will shut down user reviews.I borrowed this film (and the other one by Disney The Force Awakens) for free from the library and watched them over the weekend.\nThese two films are so boring and unhip. They are so bad and boring one would think they made them annoying on purpose.Reading reviews one notices that the fans and users have noticed it (then who are the people who keep giving these people a billion dollars??). So the same way that IMDB shut down its forums so people cannot point out the flaws and mock these films I predict IMDB will now shut down truth telling by shutting down user reviews.Disney is very disappointing.","I never thought I'd wish for George Lucas to come back after his latter trilogy, but at least he had a clear vision on what he wanted to accomplish. Yes, mistakes were made, particularly in the Phantom Menace, but this is actually worse in a lot of ways.This film was a mess. I think some of the characters are great - particularly Ren and Rey, but the script and plot are just very poor..\nThe middle finger to the fans, particularly in the treatment of the characters they chose to bring back, was entirely unnecessary and jarring for many, I think.I haven't felt compelled to write a review on this site before, but I loved star wars. This film was not star wars for me.For the record, I don't care about the segments of the film that people are calling unnecessarily feminist etc. Whatever. Strong female characters = good. Nonsensical plots involving secret plans = bad. I think all the characters in the film were actually really good and there was some great acting.\nShame about the terrible script and plot - wasn't much they could do to save that!","No sense of danger, no tension, no interest and the jokes oh my god the wisecracks and the one-liners. What was that??\nThe actors are terrible, the new emperor was obviously a moron and his guards were beyond useless obviously too. When the fight breaks out around his throne not for one moment anyone believes the outcome is in doubt. It looked like a weak dance choreography.\nI guess I am tired of Disney's movie and that they release one a week. I never liked jokes and humour anyway.","You have conned all the assorted losers and preteens to go watch this and made your billions. How about you chuck Rian Johnson and JJ Abrams out and just for one movie get an actual script, an actual director and add a good actor or two?\nJust.for.once.\nOne question though: How far and wide did you have to search to find and insert the world's sole chubby Asian chick?\nPS: Whose network does the Mary Sue and the Tantrum Emo use? The video connection was pretty good for such long distances (but I didn't like the lack of privacy settings).","I am so sorry that for the first time in my life, I walked out of a Star Wars movie. This was so disappointing. As a young father, every moment I spend outside of the house without my kid has to be justified, and after about an hour of this garbage, I could not suppress my conscience anymore, and walked out to go home and spend more time with my kid. This piece of garbage had no character development, horrible edits, basically ruined Luke Skywalker's character and turned him into a hobo. I am so frustrated right now. They've ruined Star Wars.","And your movie has no reason whatsoever for existence.. at least hire a pretty babe who flaunts a gorgeous body, cleavage, legs, long hair etc in your film. At least i feel good watching a thin girl in a micro mini skirt and not hate the studio for stealing from me.\nOtherwise, what is the point?","This Film, was so off in so many ways, as a Star Wars movie Fan (not books) you will wonder what they were smoking. You will also feel insulted that the Characters you once knew are bent out of shape in odd ways. If you cant sit thourgh it twice you will literally start mothing \"why\" at loads of scenes.1 Its not star wars, or at least the same star wars we know. Luke Skywalker was written by someone who has never watched the films. 2 Humor is awfully forced, Marvel does it good. Dont try and copy, it does not suit the tone of the film. So many times you will be taken out of the escapisim of the film and go what the hell was that?!3 Plot holes everywhere. The ending screams WHY THE HELL DIDNT YOU DO THAT IN THE FIRST PALCE!4 Rey... UTTER MARY SUE. Literally the best jedi the universe with literally no training. Its story breaking and annoying to watch. In the end you will dislike the character, because its like rubbing sandpaper on your brain.If you want a real world view and not critics that have spammed the love button on this film, you need to head to rotten tomatoes to see that its in the 40-49% bracket with real viewers. Its not any where near its current IMDB rating. If i were nice i'd give it a 5 out of 10, simply due to its polish.It certinly is less than average as a film the only thing keeping it near average is its excellent sound and visuals. Also adam Driver is excellent, shame the film around it makles no sense. It has the Lucas arts polish thats for sure. The rest of it is a stinking mess, insultingly so. As a result I will literally never pay to watch another Star wars universe film until Rhian Johnson and Kathleen Kennedy are sacked.Ill vote with my money, where it hurts.","If Rian Johnson can direct a film then anyone can be a directorIf Kathleen Kennedy can be a producer in Hollywood then any swindler can wheel and deal and become a producerIf Daisy can be an actress and appear in a movie any girl can become an actress and get roles grrrl powerHey why not?\nPersonally, I know this is not Star Wars anymore so I am done with this series and studio","The question is whether Jar Jar Abrams is the sith lord or Rian Johnson. Which the master and which is the apprentice.","It sucked.\nIt was boring, it was contrived, it was cheaply done and the characters made zero sense. All the coincidences and stupid behavior almost put me to sleep.\nIf there is any learning that can happen in this world it will be the end of sequels forever and ever.","I mean Poll Of The Decade:\nWho is the biggest loser? Rian Johnson or Jar Jar Abrams*?\nLet the voting begin.*bonus entry: Paul Feig","This constitutes the MIDDLE FILM of a trilogy?!? More like the middle finger given to a multi-generational fandom! I was so shocked after enduring The Last Jedi in the theater that it took me days to wrap my mind around what I had just experienced. I felt like I owed an apology to my child for subjecting them to it. All that build-up to Luke's triumphant return...all for naught. 4 months later and we're still not given an explanation for why that film was given a \"pass\" as the logical, legitimate extension of The Force Awakens.In fact, this review could be summed up thusly: The Last Jedi is illogical and illegitimate. It will NEVER be--in my opinion--a Star Wars film. And in spite of his noble effort (Mark Hamill's) that will never be the true Luke Skywalker. Every single character, including the remarkable Rey, was retooled and distorted nearly beyond recognition. Clearly the actors for the new characters (Rose, Holdo and DJ) we're saying \"woohoo I get to be in a Star Wars movie!\" Too bad they were handed the flimsiest and most soulless script imaginable. In my imagination it is Rian Johnson's flimsy script that Luke chucks over his shoulder, NOT his father's lightsaber. Star Wars is dead to me. \nLong live Marvel--something to actually look forward to at least.","Terrible movie. So many fake reviews.Why couldn't we see just how much knowledge and power Luke and Snoke had. They had so much mystery and potential and it was wasted!!!Rey was a better pilot than Han. She's a better force user than Luke. She understands droids and Wookiees and can use force mind tricks... and she had no training. She made it into her 20's without doing things related to the force and now she can lift a mountain side?!If you think about it, Luke didnt do ANYTHING the entire time. I kept waiting for something that the other movies had. Something amazing that would bring you back to the theater again and again. This movie had a few scenes that were decent: Kylo and Rey vs the guards maybe... The slow speed chase and the Finn and Rose plot line was pointless! A waste of screen time. I could write so much more, but others have covered it. I want to give it half a star out of 100 but this will suffice. Oh, and a last thought: Walking out of the theater, I felt an emptiness. I had never felt that after any Star Wars movie. Is that what you were going for Mr. Johnson?","The question is whether Jar Jar Abrams is the sith lord or Rian Johnson. Which the master and which is the apprentice.","If they had congressional hearing into baseball doping...they need to investigate why reviews for this are so high. I just scoured comments here and looked at several *hundred* negative reviews...and found 2 positive ones. But it still has a 7.7? I've heard reviewers defending their reviews saying that bots account for a swath of the negative reviews...but I think it's the other way around.There are several likable scenes...and the movie *looks* amazing....but it's not a good movie. Mediocre at best. That's the last time I will rush out to watch a Star Wars movie.","I just felt like the story was thrown together as they went, because it is some of the laziest and Deus Ex Machina reliant work I have ever watched. I personally didn't watch any fan Theories and just went opening night to be entertained by another Star Wars movie. Instead Rian Johnson serves up a good lesson that quantity is not always quality.There were multiple new characters that had to share the screen that in essence the character development suffered greatly. Phasma was wasted again, Ackbar was killed off screen as an oh by the way moment, and Holdo was little more than a plot device to do the light speed suicide. It was never explained why she stayed on the cruiser, since the shuttle escape was a secret. (They didn't know yet they had been betrayed). In the second act when we keep shifting between the 4 concurrent plots I found myself thinking \"don't swipe back to Rose and FInn please\" because it was the least interesting plot line and it felt like Canto Blight only served to put some aliens into the movie to remind us we are watching a Star Wars movie.I enjoyed three moments in the film in total, and if I am being honest and the person next to me fell asleep in the middle and started snoring during the slow space chase scenes. The story failed to draw me in and entertain me the way The Force Awakens and Rogue One did. I just shook my head at the end, and felt meh about the entry. The plot and character development were just to hackneyed. think the theme of failure that was repeated to death, sums up what I felt about this entry in the franchise.","This was supposed to be the film that propelled the saga forward into a new direction??? What was wrong with honoring the direction and legends it started?! All this movie does is crucify a heroic character we all loved from childhood, and then leaves us completely unsatisfied with Rey's storyline. Are we honestly expected to believe \"anyone\" can be a Jedi?? Disney needs to stop controlling this ship! It's not supposed to be part of the \"Disney Princess\" history. What a shambles!!"],"review-user":["yupman","shoresk-37122","gogoschka-1","xufqzxgm-45078","jho-37951","rebelzone","kingjon-08903","ldn-55257","nby-83430","dave-49763","lor-44772","cyx-39419","alibazargan","bpg-11955","carswellkenneth","htm-44779","paulihnat","n-13985","l-95084","Grey_is_OK","michael_blassingame","fobos666","buck_starwell","zparadigm","msattitude2"],"review-date":["2 January 2018","14 February 2018","21 January 2018","15 July 2018","18 May 2018","18 December 2017","22 December 2017","22 February 2018","29 July 2018","11 October 2018","10 May 2018","10 July 2018","4 April 2018","15 August 2018","21 April 2018","28 April 2018","31 July 2018","7 July 2018","28 June 2018","20 April 2018","23 December 2017","21 August 2018","22 December 2017","18 December 2017","24 December 2017"],"review-rating":["1","3","2","1","1","2","1","3","2","1","1","1","5","2","1"],"review-title":[" The Last Jedi was just magical\n"," I made an account just to say how disappointed I am\n"," My Issues With The Storytelling in The Last Jedi (Without Hyperbole)\n"," I Think It Was Boring\n"," I know how Disney can save face\n"," 25 reasons why The Last Jedi is a FAILURE\n"," The Last Jedi is a Disgrace to Every Star Wars Film That Came Before It\n"," Man, This Sucks\n"," IMDB will shut down user reveiws\n"," Exceptionally disappointing\n"," Boring\n"," How much cash is enough Disney\n"," Garbage\n"," If you have no script, logic or interesting developments\n"," Will never pay to see Star wars again\n"," This movie gives the people hope\n"," Always Two There Are\n"," Watched this movie\n"," Poll Of The Year\n"," \"Godspeed\" ?!?\n"," What's the deal with all the fake reviews?\n"," JJ Abrams or Rian Johnson?\n"," Congressional hearing needed.\n"," I remember when critics used to give bad reviews for mediocre scripts\n"," Total Plonk\n"]}