{"review-url":["http://www.imdb.com/title/tt4881806/reviews"],"review-text":["This movie gets the most crap and the hate for it, it is a solid decent action sci-fi film so what's the problem? It is a decent film I love the film. I would put it in my second favorite Jurassic Park film in the franchise. I know I am going to get a lot of hate because it is not a rant. In my opinion it is a good film I love it, if you hate the film is your opinion I have no problems with the film, but it is an improvement over Jurassic World I hated that film. Chris Pratt and Bryce Dallas Howard returns and they are decent I love them in the film so much.When the island's dormant volcano begins roaring to life, Owen and Claire mount a campaign to rescue the remaining dinosaurs from this extinction-level event.I enjoy the practical effects, the explosions, the acting, the story and the action. I love the CGI effect for the raging volcano This is a faster paced film it goes fast around. I enjoyed the film it was entertaining and I wasn't bored with it. I understand the story, the twist and what they try to do with the film. I got this movie on Blu-ray disc and I enjoy it, I enjoy the film it is a guilty pleasure of mine. Call it whatever you want it I love it.Chris Pratt as Owen Grady was decent and really a good hero, he does good performance, he has more stuff to do than in the first one. Bryce Dallas Howard as Claire Dearing was one hot mama who showed emotions and she cared about dinosaurs and a rescue mission. She wasn't annoying she was fine and entertaining. I like Bryce Dallas Howard because she was in Spider-Man 3 as Gwen Stacy and I have enjoyed her performance more than Emma Stone in The Amazing Spider-Man 1 and 2. I enjoy Ted Levine in this movie he was in Joy Ride and The Hills Have Eyes remake and I enjoy his performance to be a bad guy. I enjoyed Isabella Sermon as Maise little girl she wasn't annoying I liked her. Rafe Spall was awesome as Eli Mills the villain he was practically like Carter J. Burke (Paul Reiser) from Aliens who wanted a profit of capturing aliens while Mills try's to get rich by selling a live dinosaurs.CGi are better than in the previous movie and gets criticism for trying something different. At least this movie did not copy the first one or other movies like Jurassic World did. I love the first Jurassic Park to death it is the best one in the franchise by a novel who directed Steven Spielberg. I love Jurassic Park III and this one. Directed was by J. A. Bayona who made a good direction. I enjoy the film I would put the film between Aliens and Deep Rising the opening sequence is a really horror aspect, you see a man been eat by a sea monster. Derek Connolly and Colin Trevorrow wrote a script for the film and they did a good job Colin Trevorrow previously directed Jurassic World so I respect him.I love the idea the rescuing dinosaurs from raging volcano I thought was better idea then the Jurassic World did. The rescue mission was a ploy and Claire and Owen must try to save the dinosaurs from been sold on a black marked. The problems and dumb idea was the cloning little girl that was stupid and bad idea. Of course the T Rex- Veloceraptor blood transfusion was a bad idea too.My favorite scenes are in which Indoraptor hunts Owen and Maise throughout the mansion they are both on the roof but Claire shows up and distracts Indoraptor and of course Blue Velociraptor comes and saves them, kills prototype Indoraptor I loved that in the film. Jeff Goldblum has a cameo scene in the beginning of the film as Ian Malcolm and on the end of the film I don't mind him. BD Wong as Dr. Wu is also back as the bad guy he does a solid job. I love Claire and Franklin in an abandoned gyro-sphere to flee from the pyroclastic flow, but falls into the ocean that scene scared me because I thought they could have died for real. Excellent scene in the movie one of my favorites.I watch this movie twice in the row now, I know it is not perfect film it is not the greatest movie or the best one ever, I know it is stupid but I love it. I enjoy the film it is my second favorite film in the franchise. That is my opinion I forgot they mention a guy who is an arms dealer and they mention Slovenian my country yes I am from Slovenia so I am honored by this movie.","1) It's bad. I didn't like Jurassic World, but this is worse. It's got broad characters, lackluster set-pieces, a noisy score and the kind of script which should be punishable by throwing its writers to sharks. At least Jurassic World, mediocre as it was, had the good sense to copy the first Jurassic Park. Fallen Kingdom foolishly imitates The Lost World instead, with a semi-watchable first half on the island and an abysmal last act with dinosaurs wreaking havoc back to civilization.Kudos to the late John Hammond for building his park on a volcanic island. Also, I hate to ask but, since it's a plot point that dinosaurs will face extinction (again!) if they are not rescued from Isla Nublar... what happened to Isla Sorna (Jurassic Park 2 and 3)? There were dinosaurs on it as well. I'm sure some novelization or website makes up a lame excuse, but the movie doesn't. 2) Stop overcomplicating blockbusters. Jurassic Park featured an intelligent, complex sci-fi premise, but the actual plot had an elegant simplicity to it. Fallen Kingdom tosses in betrayals, cloned little girls and evil corporations selling dinosaurs to warlords.3) Speaking of that, enough with the \"dinosaurs as military weapons\" nonsense! This is a concept which appealed to all of us when we were kids (\"I want to ride a T-Rex! And it should have a rocket launcher on it!\")... but you cannot have War Dinosaurs in anything that wants to be taken seriously by adults. You know why Navy SEALs don't have units of trained lions? Why no army has rhinos bred to be ridden into battle? Because nobody in modern warfare would spend money (let alone MILLIONS as in this movie) for a huge beast which would be an economical and logistical nightmare to raise, train, feed and manage, especially when a random enemy soldier could blow it to smithereens with a 100 $ grenade. Someone should tell writer Colin Trevorrow that war elephants aren't a thing anymore, while firearms and explosives are.Note that the dinosaur boogey of this movie, the Indoraptor, is so ineffectual that it repeatedly fails to kill its unarmed preys in the endless climax. Some infallible weapon: there is a scene where three characters are pinned under a tree and the Indoraptor manages to... scratch one of them in the knee before they escape. You know what could have killed them more efficiently than your War Dinosaur? One guy with a pistol!By the way, the Indoraptor is trained to attack its targets after you point a laser at them and emit an audio cue. Wait a second - if you are already pointing a gun with a laser beam at someone you want dead, can't you just PULL THE TRIGGER? It's a 30 cents bullet versus a 30 millions dinosaur. Bad guys, do your math.4) Fallen Kingdom assumes you are really, really interested in Blue, the Chris Pratt-trained Raptor from Jurassic World. The script retcons Blue into a sympathetic, heroic creature which displayed diligence and empathy since it was young; funny, I recall it killing several innocents in the previous movie (and attacking Pratt himself with no provocation in their first scene), but whatever. 5) Since we mentioned Chris Pratt: much like Jurassic World, this movie doesn't know how to use him. Pratt is ideally cast not as a badass, but as someone who *thinks* is a badass - a character who is capable but somewhat out of his league. He works so much better as a slightly comedic, self-deprecating protagonist (Guardians of the Galaxy) than as a tediously infallible, dead-eyed action figure. His Owen never changes. There is more character development implied with a small prop in Jurassic Park (the Raptor claw Grant uses to scare a kid at the beginning and then throws away after bonding with Lex and Tim) than in all Owen's scenes in Fallen Kingdom.6) Howard is inoffensive but unremarkable as Claire: she is just kind of there, blandly good-looking, doing no damage but adding little value, like some sort of redhead lettuce. Her two sidekicks (Scared Nerd and Tough Latina) are insufferable though.(By the way, how is Claire not rotting in jail as the aftermath of Jurassic World? She is directly responsible for the dozens of casualties there, poorly handling the Indominus' escape and refusing to evacuate the island. She must have one hell of a lawyer.)7) Poor Rafe Spall, a competent actor (see The Ritual, a much better monster movie), plays Greedy Corporate Guy, an antagonist so flat and obvious that I was disappointed he didn't get an Evil Laugh Scene... you know, he throws his head back and bellows \"Bwahaha!\" while the camera cranes up.I love how Rafe Spall builds a containment facility for dinosaurs under James Cromwell's mansion. Cromwell plays Old Sick Naive Rich Guy. Sorry, I don't care how old, sick and naive you are: you have no excuses if you don't realize someone is HIDING DINOSAURS IN YOUR BASEMENT. Really, Trevorrow? Is this some kind of spoof? 8) CGI is fine but overused. It's a visually busy movie. I'll give them credit for making the Indoraptor more visually distinctive than the boring-looking Indominus. At least they sort of splashed some yellow on it.9) I didn't care for most of the set-pieces. Remember how Spielberg took his sweet time with the T-Rex breakout or the Raptors in the kichen? Here most action beats are over right after they begin (the Baryonyx, the Carnotaurus...). There is no build-up, no crescendo. It's the cinematic equivalent of premature ejaculation. I did mildly enjoy the prologue with the T-Rex and the Mosasaurus, although... why would the Jurassic World engineers build a giant door which allows the Mosasaurus to reach the ocean? What kind of scenario were they envisioning where the escape of the humongous sea monster would be a positive outcome? I mean, come on. I'm not usually a nitpicker, but this movie seems to be actively trolling anyone giving it a minimum amount of thought.10) The stupid ending sets up another sequel. I guess we'll finally get the inevitable War Dinosaurs. *sigh*4,5/10 To people asking \"What were you expecting in a film about dinosaurs?\", I answer: \"Something maybe not on par, but at least in the same league as Jurassic Park, one of my favorite movies of all time\".Still, if all you want is an action/adventure with many different dinos, regardless of lousy storytelling and flat characters, have fun with this one.","There is no way so many people would be AMAZED at this POS movie and even compare it to Spielberg's original JP masterpiece or call it one on its own right.\nThis movie isnt even worth to be an episode in an average cable tv show. Its the blandest, most predictable and lazy part of the series so far. There is not even the slightest hint of originality or anything fresh in the whole film. Nor is there any tempo to the story. And barring quite good Goldblums speech, the whole 100% of dialogues are forgettable as are all of the action scenes that you feel like youve seen already 100 times in (or any generic) previous films. \nIt is a horrible, horrible product with no personal touch or vision from the director or any refreshing qualities that might bring the light back to this now utterly pathetic sad pathetic Jurrasic Park franchise. \nNot worth seeing. And IMDB please start screening the fake accounts,you can tell them from a mile away.","This is the first time I got bored during a Jurassic movie and kept looking on my watch to see when it would be over. A lot of noise and spectacle but almost every scene a weak variation of ideas from previous films topped by the most ridiculous motivation for the heroes. The end of Jurassic World 1 promised a more interesting story. I am definitely not looking forward to another sequel.","This is only my 2nd review ever and I will only take the time to write a review if something seriously pisses me off for being really really bad, because I don't get pissed easily.I just got back from seeing this movie and they took my favorite childhood film Jurassic Park and killed it. I'm not gonna lie, I enjoyed Jurassic World because it got back to the basics of the original but Fallen Kingdom just turned this into a joke. It's as if the writers and directors of Fast & Furious took over Jurassic World Fallen Kingdom and decided \"Hey, lets just create crazy new dinosaurs and throw non stop dinosaur action scenes at the audience, who cares if it makes any sense or not, lets also add a stupid nerd who isn't funny to try and make this an action comedy film.\" The first opening scene was the only enjoyable part of this whole film, after that I was surprised Dwayne \"The Rock\" Johnson and Kevin Hart didn't appear randomly to fight some dinosaurs and crack a couple jokes.So dinosaurs are taken to an old mansion in Nothern california.. Really? And held for an underground auction for a few million bucks? Seriously? Who the hell agreed to make this the actual storyline? So a team of people actually sat around and discussed different ideas and this is what they agreed upon? They actually get paid for this? Universal should let me in on these meetings so I can shut them down if nobody else is jezus.","Like a lot of others are saying the first part of the film, where they are escaping from the island is great and quite exciting and sets the film up pretty well.However once the major action scene is over and they have to focus on the main story things start to go downhill. I think what bothers me the most is that a lot of the writing is just lazy and not well thought through or truely creative. Instead we get more of the same themes from the original JP films plus some more from JW. (Mutant dinosaur + evil corporate guys)All of the main characters stories are pretty unbelievable and there isn't enough investment in developing their individual personalities / backstory so we understand why they behave the way they do. Sometimes I feel like the major action scenes were thought up first and then the story was just sort of inserted between them as a glue so we have a way of getting from one action scene to the next.If you go and see this film you will probably enjoy it and it will most certainly entertain you for a while but after the moment has passed I am not left with the sense that I have seen something truely groundbreaking. Unfortunately I can't help but compare it to the original Jurassic park film and consider how it doesn't even come close to the terrifying moments of suspence and the brilliant portrayal of the different characters we got in JP1.Given that there are so many 9+ reviews on here maybe i am in the minority but I just feel like we are letting Hollywood get away with lazy writing, which contains numerous plot holes just so we can marvel at some cool CGI. We really should'nt be satisfied with this state of affairs. We should all be demanding better, more creative writing that continues to offer us something new and exciting. This will only happen if we stop rating these mediocre generic blockbuster films so highly. Was it was entertaining? yes without a doubt, but this is nowhere near a 9/10 film and you all know it. When rating these films please be honest with yourselves and send Hollywood a message. Don't let them think that lazy writing is ok. We aren't idiots and we do value a well written and interesting story.","This was by far the WORST episode of the Jurassic park franchise.","A pathetic attempt to cash in on nostalgia (again) with familiar scenes and \"throw-backs\" while pushing the franchise forward. Terrible writing makes the dialogue canned and generic, the \"jokes\" are ill timed and fall flat every time, and the plot is as predictable as it is dull.\nEverything is predictable and overdone. Just like the original they're warned about what they're going to do, do it anyways, and suffer consequences. The run of the mill villains are all predictably killed by the new scary dinosaur or the old nostalgic dinosaur.\nIt's just a crappy movie that will will breed more bad films.","So the ball vehicles, that can withstand anything... Gets opened by an army knife under water...Enough said... Terrible.","Its just horrible in every way. It doesnt make sense and is so badly written that you know what will happen next all the time. The plot is thinner than the original Jurassic World. Watching it just hurts me inside, not in TLJ way but in a logical way. I dont know how to discribe it but its just mental pain.","Every time you wonder if Fallen Kingdom can get any more determinedly, aggressively dumb, the movie winks at you and says \"Here, hold my beer.\" If you thought the lowest this franchise could get was an in-dream velociraptor barking \"Alan!\" at Sam Neill, then hold your nose- you're about to take a plunge into the deep end.I'm at a lost as to what can recommend the movie at all, since from the outset there's barely a moment that isn't at odds with common sense. It now turns out Isla Nubar, the site of both Jurassic Park and Jurassic World, is also the home of a dormant-now-turned-active volcano. Since the modern geological classification of a dormant volcano is actually \"potentially active,\" building your billion-dollar theme parks here now makes as much sense as building a new Disney World on the slopes of Mt. Saint Helens. Since this would mean extinction for these back-from-the-dead dino-critters, there's now a call to rescue them, including from Jurassic World corporate shill-turned-dinosaur-advocate Claire (Bryce Dallas Howard). This reversal I don't mind. I can see someone going from seeing these beasts as a source of profit to living creatures in need of protection, if we're taken along that arc. Alas, Fallen Kingdom has no time for arcs, character development, or any sort of nuance. It has its characters do, say, and act as the plot necessitates at any given moment. Full stop.The first third of the movie plays as a weak sauce parody of every other film in the series, as Claire and raptor-whisperer Owen (Chris Pratt doing his Star Lord shtick- minus the charm, charisma, likability, dance skills, etc...) scramble to the island to organize a kind of Cretaceous Noah's Ark at the behest of Discount John Hammond (James Cromwell). Of course, the Powers That Be are up to no good, and this is where Fallen Kingdom really begins its death spiral. Not only does it double-down on the absurd villain motivations from the last movie (yeah, the dinosaurs are wanted as potential military assets because that makes TONS of sense), but takes on the creepy-house shenanigans of a lame Scooby Doo episode. If there is any upside to Fallen Kingdom, it's that it might finally put the nail in the coffin of a franchise that's long-since run out original things to say or to show . \"Remember the first time you saw a dinosaur?\" Claire asks Owen at one point. Yes, Claire, we do. And it was in a much, much better movie than this.","Guys. I feel like the premise of this movie (should we save the dinos or not?) is directly symbolic of saving this franchise itself. Saving dinosaurs and selling them for millions. A little on the nose, yeah?Can't we never hit that big red button? Can all the dinosaurs please die? Terrible script, terrible story, terrible directing. I'm not just disappointed, I'm mad. Let's add new characters, new backstory, And change the island. So many plot holes. So much unmotivated character decisions. So absolutely terrible.","I'm a huge Jurassic Park fan but this movie is just not very good. It made no sense at all. Awful writing and acting with plot holes everywhere. In a world where top athletes are being transferred for over $100m, you'd think a dinosaur was a little more expensive than $10m?! But no, Mills' (Rafe Spall) eyes light up at the sight of selling a dinosaur for $10m. What's more, the total cost of all dinosaurs only totals at around $120m. That's less than the production of the movie! I'd love to see the overheads of the organisation for sending 100+ men in armoured vehicles with state of the art equipment to a dinosaur inhabited island in Costa Rica. They can't be looking at very high profit margins. Why not just sell the giant mansion with the secret underground lab and save all the hassle?? It's such a shame that a franchise with a lot of potential has gone down this route.","Its as much of a non-film as I can remember. Somehow, Spielberg made a cup of water and the sound of footsteps far more suspenseful and engaging than anything in this movie. The dinosaurs are just sort of... there. Same goes for Chris Pratt, who features in scenes but only mildly forwarding the story with a few rescues or whatever. There are some cringe-worthy moments - firing a gun underwater to break glass, everyone being submersed but having perfect hair/makeup after, a horribly acted young girl who has the most shoe-horned and pointless subplot ever (as well as a nonsensical, cringe inducing climactic line). So much of the story makes no sense, a hybrid dino is basically produced and supposedly trained to follow laser sighting overnight. Yet has no buildup, suspense or point whatsoever. The whole thing is stranger than a David Lynch movie. Its like a string of bland cutscenes to a dull videogame.","Brain dead sequel finds Chris Pratt and Bryce Dallas Howard trying to save the dinos of \"Jurassic World\" from a live volcano that threatens to destroy the entire island. Ofcourse things don't go their way and all hell breaks loose. Add in a new dino monster and that's pretty much the entire film. Unfortunately while this simple story worked in a B movie sort of way with \"Jurassic World\", it drops flat on its face with \"Fallen Kingdom\", with a very bad script, a miserable looking Chris Pratt and some very bad set pieces that rips off not only the first two Jurassic films but rips off most of the monster on the loose in a spooky house films. Nothing in this film is worth your time other than Jeff Goldblum's 3 minute cameo which book ends this film and reminds you on why Steven Spielberg's first two Jurassic epics ( The original \"Jurassic Park\" and Its true Sequel \"The Lost World\") were so damn good. The only thing the rest of \" Fallen Kingdom\" reminds you of is the horrible \"Jurassic Park 3\" where poor Sam Neill looks like he was about to jump off a cliff in order to escape the movie he was in. The same way poor Chris Pratt looked in this film.Avoid.","What should be tackle first, the annoying millenials who mouth off to a veteran soldier, because surprise surprise, he's a corporate baddie, or the hammer-to-the-head speech that permeates through Jeff Goldblum's just-give-me my damn Jurassic money blank soulless joyless face.\nThis movie is terrible. Not tolerably terrible. Awful. Poorly made, laughable situations, and the silliest set up from a Frankenstein of other movies done better. Who is this J.A. Bayona tool? He's dumb. That's for making me suffer through terrible dialogue and a dino-blood transfer.Volcano going to destroy the park/world where the two dummies harnessed the power and wonder of dinosaurs. Oh no we have to save them!!\nEnter Claire Dearing. You remember the one who was fleeing for her life? Now runs a cause to protect them. Incidentally, you dummies who wrote this...the Pteradactlys were shown at the end...couldn't they leave the island whenever. Seriously, this is dumb road we're going down. Except, a former business partner/dreamer of John Hammond wants to preserve them. So he funds this excursion. By the way, here's a skeezy looking caretaker of the estate Eli Mills, to deal with the logistics whilst he is bedridden. Yep.I'm not going to waste any more time with this joyless garbage only that it is dumb beyond words. There was a moment, wait...I have to tell this because it's so dumb...where Clair and some annoying Millenial they had tag along because he's a computer geek, are stuck in the travel orb, which falls into the ocean. Our hero, Owen Grady first attempts to shoot out the glass, yes...he does this. Then he surfaces, I think...hard to say, and comes back with...a knife! Yes, a knife, and prys the door loose. My stomach ached from laughing how stupid this was.Anyway, that was actually the less egregious nonsensical tripe.\nKids will enjoy it. Maybe separated kids at the border need a nice diversion.","This sequel to Jurassic World, sadly is not as fun as the movie before it. Or the original trilogy before that.The movie is good but I think it suffers in the way of its story. Though interesting, the story could have been far better.It was interesting to see them return to Isla Nublar to try and rescue the dinosaurs. But it was extremely predictable that they would be betrayed once they got there.The ending part of the movie with the havoc in the mansion was great. Though you do not see much of the Indoraptor like the trailers made us believe. I do question the rather stupid decision of the young girls character though. I knew and understood why she did it. But come on. It was not the brightest thing to do.Chris Pratt and Bryce Dallas Howard were great again in the roles. But it was more of the same. Not much character growth between movies. Though the connection between Chris and Blue was well done. The cloning aspect featured later on in the movie with the child? Yeah ok. I can kinda deal with that. But don't have that as a focus for future films. It is an enjoyable film and I am curious to know what they will do for the third film due out 2021.They have hinted over the years that they may be weaponised dinosaurs and they kind of set that scenario up in this and talked briefly about it in Jurassic World. As cool as it sounds, I don't want to see dinosaurs with laser beams attached to there heads fighting soldiers or whatever they may come up with. Save that for a movie based on the old Dinoriders cartoon from the 80's.","..after seeing the trailers. I lost all hope for this franchise, and I felt disgusted.\nWell, surprise surprise..after seeing the movie(of course I had to), I dare to say I actually rank it second only to the original Jurassic Park.\nSomehow all the plot holes (the biggest one being the fact that it turns out the original Park was \"ingeniously\" built on an island that is basically a massive active volcano peak above the ocean), and ridiculous sequences (the girl manages to escape and locks herself in a room, then jumps into bed of all places, then waits for the monstrous dino to crawl inside slowly through the window and onto the bed itself. This is followed by the Chris Pratt character busting into the room, and after unsuccessful attempt to tase the beast, standing still right next to an open door and staring into it while it slowly recovers..in other words, doing absolutely nothing a person in such situation should do)... somehow it all fades under the sheer cinematic brilliance and a number of superb scenes and sequences, some of the best in the whole series - the dinosaur stampede in front of volcanic eruption, Chris's paralysed character getting licked by the ceratopsian and getting exposed to lava, the collective fall off the cliff, the whole idoraptor chase sequence etc. There are some moments of pure superbly styled gothic horror, marvelously visualized and with qenuine care for detail.\nLast but not least..the CGI effects are, at long last, PERFECT. They were the worst part of the worst movie in the franchise, The Jurassic World. \nBut this time they finally did it right and made me genuinely impressed. \nIt is the first time the CGI creatures left a convincing, realistic impression of musculature, mass, momentum, texture and movement. \nThe final scene where raptor and indoraptor fall together is a triumph of simulated physics engine.\nGranted I'm a geek and maybe this matters to me more than to the average movie goer, but the quality of the visual effects itself is a big deal here, and is a true landmark moment. \nIt must not be overlooked.Overall, a movie with silly premise and some large plot holes, but a brilliantly filmed, entertaining movie that really kept me engaged and brought suprising amount of awe.","This movie was much better then anticipated. Always been a fan of the Jurassic movies but they have always have been a similar predictable story with simailar characters and plot lines. This movie gives the franchise a fresh feel while maintaining aspects of what has made the franchise one of the most popular of all time.","This film is on par with the lost world, and deserves praise. It has issues like most films, but a lot of the 'plot holes' can be explained from previous film cannon. For jurassic fans, this film was a real tribute to the author of the novels. And one to think about after viewing.","Seriously this is good movie like its first part. Really don't know why some people here are not liking this movie... It has the core plot and strong casting and VFX too in addition to the emotional things. Overall this is an enjoyable film with some message too. Go for it!!! Cheers!","I have seen all these movies and it was that damn good. The pacing....the new villain dinosaur....holy moly amazing","I can see why some folks would diss this flick, when breaking it down to plot points, etc. But for me, it was fabulous. The human clone plus the Dinos being let loose around people.... yes! Finally!","Great movie loved it cant wait for the next one i hope he comes as soon as possible","I love the story. And all the shots are very excited to watch. I can feel tense on them. I will love to see it twice or more."],"review-user":["rambofan4life","petra_ste","sumtim3s00n","wolframknoblach","jeffreyobar","peter_w82","JeanDeMichaque","yeafolijr","amillsy-82880","bloodworia","michaelseanmcgowan","meemurthegreat","chris_murphy13","rabbitmoon","gummydy","statuskuo","nathanjamesemerson","maaa-51935","nickmadd4","monkeydiddle-56799","peraveen","master_sullivan","rlwindle-35257","frits_versace","chinakids12"],"review-date":["1 November 2018","14 June 2018","14 June 2018","8 July 2018","29 June 2018","17 June 2018","5 August 2018","8 July 2018","29 June 2018","6 August 2018","26 June 2018","29 June 2018","10 June 2018","6 June 2018","25 June 2018","22 June 2018","24 September 2018","11 September 2018","14 July 2018","9 September 2018","9 September 2018","4 October 2018","3 October 2018","9 August 2018","10 September 2018"],"review-rating":["9","4","2","1","5","1","1","1","1","1","1","1","2","1","1","8","8","9","9","10","10","10","10","9"],"review-title":[" This movie gets the most crap and the hate for it, it is solid decent action sci-fi film my second favorite in the franchise\n"," Ten things about Fallen Kingdom\n"," IMDB seriously needs to start screening for fake accounts and fake reviews/scores\n"," Yawn...\n"," What a disgrace to Steven Spielberg & Jurassic Park\n"," Great CGI, Terrible plot!\n"," Wtf was that?\n"," This franchise should go extinct.\n"," Defies logic.\n"," Another Sequel to a reboot nobody needed\n"," Like a Jenga tower of Stupid\n"," Zero out of ten Goldblumes\n"," $10m for a dinosaur???\n"," So bland. Tonally uneven. No memorable character moments. Awful.\n"," Almost Rivals Jurassic Park 3 as the worse sequel in the Jurassic series\n"," Worst Thing I've Ever Seen\n"," Jurassic World - Fallen Kingdom\n"," I was expecting the worst..\n"," Same franchise, fresh feel\n"," Dont understand the hate.\n"," Good Movie In Jurassic Universe!!\n"," Just perfect!!\n"," Best Jurassic ever\n"," Top movie\n"," Love it\n"]}