{"primary":["Cyber Tracker (1994)","https://m.media-amazon.com/images/M/MV5BYWVlZmE4MWQtOTZjNi00ZDRkLWIxMjMtYWUwMzU2MjYwNDIxXkEyXkFqcGdeQXVyNjExODE1MDc@._V1_UY1200_CR107,0,630,1200_AL_.jpg","http://www.imdb.com/title/tt0109515/reviews","tt0109515"],"secondary":["Oh, dear! This has to be one of the worst films I have ever seen. It's unbelievably repetitive; every scene seems to consist of people being gunned down, running round screaming, or being kicked in the face, which quickly becomes very dull. I wouldn't mind if the combat was even any good, but it isn't; the main character Phillips pushes the various goons over with ridiculous ease, and no matter how often he stands in full view of the Tracker, he never gets hit, even though extras and minor characters are being shot and blown up all around him. I've rarely seen a worse cast of actors (especially Don Wilson, if you can even call him an \"actor\") but that's not really surprising, given the dialogue they have to work with (sample line: \"Computers killed my brother!\"). The plot is a sub-par ripoff of the excellent Terminator; the special effects are laughable. Overall, this film is just utterly dreadful. And why does everything explode?","This movie was obviously made with a very low budget, but did they have to make it so obvious? It looked like they made no effort to make the \"future\" look in the least futuristic. For example, the first scene takes place in an 80's office building and all the cars that get blown up are from the late 70's (I assume they didn't want to blow up cars that cost more than $500). Additionally, its pretty obvious that Don \"the Dragon\" is driving his personal car during the movie (after all, he did partially fund the film). Finally, they point out at the beginning of the film that all kinds of drugs are now legal in this new \"cyberpunk\" society. Not only does this never become important in the film, but later when don needs surgery without anesthesia, why doesn't he just go out and get some legal heroin or morphine? The whole movie is sloppy like this and completely anticlimactic since Don easily blows up an \"unstoppable\" Cybertracker about 25 minutes into the movie. However, if you find this movie cheap or free I'd watch it, the last scene is almost worth putting up with this whole film.","Eric Phillips (Don Wilson) is a secret service agent who prevents the assassination of a senator however along the way he finds a conspiracy and has a tracker on his tail. The tracker by the way is bent on terminating Phillips. The most obvious inspiration for this low budget cheeseball action flick, is of course Robocop and while that film had some imagination and real energy, this just has a real life kickboxing champ running away from a robot. The movie isn't so awful as it is just empty and repetitive. The story is written in clichés and the characters are set up to be cut down by the various gunfire. Don Wilson, as usual, is terrible in the lead role.*1/2 out of 4-(Poor)","This is the first Don \"The Dragon\" Wilson movie I have ever seen, and nothing propels me to try out another one - sure, he is good at martial arts, but as an actor he has an uncharismatic screen presence. There's plenty of action in this film, with a new explosion every two minutes, and the effects are decent (considering the low budget), but the final Wilson vs. Richard Norton (a villain in some Jackie Chan movies also) showdown is the only notable fight scene.   0 out of 4 stars if you look at this as a \"normal\" film, 2 out of 4 if you look at it as a \"B-movie\".","Here's a lively actioner with plenty of firepower but not much brain power behind it. Yep, we're back in the world of '90s straight-to-video cheapo science fiction thrillers and CYBER TRACKER shamelessly rips off THE TERMINATOR for much of its action sequences and plot ideas. Yes, the plot is light and merely an excuse for copious amounts of action, ranging from numerous explosions, car crashes, martial arts mayhem and extended shoot-outs, and you just end up wanting more out of the film in the end. I've lost track of all the flicks like this that were made in the '90s, mindless entertainment which doesn't register at all and which I probably will have completely forgotten about in a few days time. It's not that the film is that bad, it's not, and at least all the cast and crew have a minimum of skill behind them. It's just that the ambitious (but unimaginative) storyline is severely hampered by the low budget which states that all action scenes must take place in the dark in cheap-looking sets.Thanks to the lack of imagination on the part of the scriptwriters, the film's fate hangs on the strength of these action scenes which are pretty but very routine; it's amazing that so much action can be so unexciting. Pepin seems to have an obsession with filming cars flying up ramps and crashing down in flames which is nice the first time but soon becomes plain stupid. One time, a huge black van hits a car facing horizontally across its path and instead of ramming it to one side or flipping it in the air, the van instead flies OVER the bonnet and crashes into flames. There seems to be no logic behind these vehicle stunts.The \"Trackers\" of the title - there are about half a dozen, all played by the same big butch bald guy - are very unimpressive creations; somebody obviously hoped to emulate Arnie's menace but Jim Maniaci is a poor man's substitute for Schwarzenegger. He just looks like a typical street thug you see in a lot of movies with no visible intelligence. The minimal robot special effects involve the Trackers getting limbs blown off, shot and exploded, which leads to some cheap mechanical make-up effects and some weird animation of a \"polymorph\" substance inside these cyborgs (huh? what rot!). You've just gotta laugh at the opening shot, which rips off the beginning of TERMINATOR 2 as a Tracker enters a nightclub and surveys the crowd for possible threats complete with green robo-vision! The extended shoot-outs are monotonous and stupid, because the Trackers only hit their targets when it's convenient (ie. killing a minor character), and excessively violent as injured innocents are repeatedly shot in the chest in a cold-hearted manner. The martial arts scenes are okay but unimpressively shot, despite the best efforts of the cast. And what of the cast mired in this no-budget display of ineptitude? The lead is straight-to-video action man Don \"The Dragon\" Wilson, who has about half the acting ability of your average Van Damme but is pretty good at showing off his high kicks. Stacie Foster is the worthless love interest, and along with her the rest of the supporting good guys are so wooden and uninteresting characters that you don't give two hoots when they get massacred. The bad guys are far more interesting, led by the slimy John Aprea and Joseph Ruskin as a slimy corporate reptilian dude who unmistakably looks like Reggie Nalder. Also hanging around as a heavy is Australian martial artist Richard Norton. Sadly, this can't save what is undeniably cheap and tacky bottom-of-the-barrel slice of home video entertainment.","CyberTracker is set in Los Angeles sometime in the near future where bodyguard Eric Phillips (co-producer Don 'The Dragon' Wilson) saves senator Robert Dilly (John Aprea) from an assassination attempt by a group known as the UHR, the Union of Human Rights, who are angry at Dilly for spearheading the Computerised Judicial System in which robots called CyberTrackers are sent out to determine & dispense justice on the guilty. Anyway, Eric saves Dilly who is very impressed & decides to see if he can trust Eric in his shady activities like the cold blooded murder of a traitor, being the fine upstanding guy that he is Eric isn't impressed when Dilly kills a woman & he is asked to keep it quiet. Eric escapes & sets out to bring Dilly down, however Dilly has lots of powerful friends & he uses his influence to frame Eric & have his CyberTrackers sent out in pursuit of him...Co-produced & directed by Richard Pepin I think films like CyberTracker give films a bad name, I didn't like it that much at all. The script by Jacobsen Hart is pretty predictable, it doesn't excite, it steals most of it's ideas & theme from other better sci-fi films & the heady mix of martial arts action & sci-fi don't gel that well. There a few fights, some car chases & a couple of shoot outs but it's all rather bland & forgettable. The film lacks imagination considering the film is set in the future & it deals with robots, technology & the way society is run & it's judicial system in particular. Speaking of which the fantastic Robocop (1987) mixed it's violent action & clever social commentary brilliantly but CyberTracker doesn't even try to make any relevant social statement or try to portray any meaningful moral message about law enforcement, the script basically uses the concept to have robots & shoot outs which Robocop did as well but also managed to include a good story. There is very little in CyberTracker that I can say was entertaining & that's what films are about right?Director Pepin does OK but nothing stands out, it's all rather forgettable & it's not particularly exciting. The sci-fi elements are nothing more than the robot side of things & as a whole the film doesn't look that futuristic. The action scenes are alright, there's some exploding cars & some shoot outs but nothing spectacular.Technically CyberTracker is average, for a film supposedly set in the future it already looks dated & the special effects are poor. The acting was bad, I wonder if Don 'The Dragon' Wilson signs cheques with that name?CyberTracker was a waste of my time, there is nothing here original or exciting & the action is instantly forgettable. Poor & that's all that needs to be said, not recommended.","Let me get right to it, this movie is bad but it's one of those it's so bad it's good type of movies.I first seen this on DVD that I bought from a video store in the mall, I have to admit that this film is made this way on propose I think to be enjoyed as a silly Terminator knock-off.Don \"The Dragon\" Wilson is a bad actor but that's OK, I feel when he is given a decent script he does do a good job.The story of the film is alright, it's set some time in the near future where a corporation has built robots to do their bidding. I do feel that some ideas in this does work, it' not just nonsense. The fight scenes are alright but do at times feel a bit rushed. All the expositions are very good, impressive even but the visual effects have not dated that well, they do look dated including the film itself.But I guess that's the charm of it, I watched this with one of my friends and he said that it is pretty dated but he kinda liked it,he said it is also fun to make fun of it too and so did I but felt unsure about keeping it, eventually I decided to return it.When I look back I should of just kept it because now I think about from time to time, If I come across it again I'll keep it next time.Overall, I liked it, it is what it is, I know it's bad but It's so bad it's good and fun to watch.I give it a 3/10. It's mildly entertaining and a good laugh at how bad it is in parts but still fun.","It's Terminator 1/2 right down to the shooting off the arm, the bar scene, and the flexing.Throw in some clear Robocop homages, even down to the shots and locale, then sprinkle in some pre-Matrix Matrix-esque rebellion bits and pieces.Once you're done there, sprinkle in some explosions and a bullet-proof chrome dome, a bunch of mullets, a vaguely Australian guy, and Don Wilson inspiring the movie \"Her\" by simulating getting an AI system drunk and you've got yourself Cyber Tracker.That being said, it's a fun movie, and Pirates of the Caribbean ripped off the \"explode a guy by trapping explosives in him\" scene.","In the future, there's a new kind of cyborg police officer capable of catching the guilty and dealing out punishment. Senator Dilly is the main proponent behind the Cyber Trackers, but not everyone is on board. When security agent Eric (I don't know his last name) helps stop a plot to assassinate the Senator, he quickly regrets his actions when he learns what the Senator is actually up to. Eric is framed for a crime and finds himself the target of the Cyborg justice system. He joins forces with the same group of vigilantes he had previously fought to put a stop to the government corruption and overreach. I don't know if any of that plot summary makes sense because the movie doesn't make sense. The plot is utterly ridiculous. There's no real motivation for anyone and characters just come and go. I didn't care about anything that was happening. The whole thing is obviously a cheap Terminator rip-off without anything that made that movie so good. Weak plot, poor acting, cheap special effects, badly choreographed fight scenes, and a general lack of talent from top to bottom. Apparently, the producers were under the mistaken assumption that you could make a compelling movie based on Don \"The Dragon\" Wilson's roundhouse kick. As Cyber Tracker proves, you can't.","Brought to us by the redoubtable PM Entertainment Group -- namely, Joseph Merhi and Richard Pepin, would-be successors to Cannon's Golan and Globus -- this leaden rip-off of \"The Terminator\" and \"Robocop\" imagines a not-too-distant future in which the U.S. government has instituted a computerized justice system that is, of course, easily controlled by the megalomaniac head (an overblown Joseph Ruskin) of the corporation that developed it. The lack of imagination and sophistication of the political allegory this is vaguely trying to spin is best summed up by the Ayn Rand quote that pops up near the end, a quote that is as leaden as most of the rest of the film's dialogue.There are basically two assets here, both of which unfortunately are largely wasted. One is the bad guy's henchman Richard Norton, the usually entertaining action film stalwart who is given too little to do, save one half-way decent fight scene. (The fight choreography is by Art Camacho, who also appears as a protester.) The other is title character Jim Maniaci, a sort of cut-rate Arnold, who looks impressive but is allowed no personality and given no characteristics that might make him somewhat intriguing. The rest of the cast, including star Don \"The Dragon\" Wilson, is pretty awful. It's hard to tell if the dialogue is so bad that the actors are defeated by it or if the actors are so bad that they couldn't possibly bring off any dialogue that had more wit or sparkle. Fans of Wilson -- and I presume he had some, because he made a lot of movies -- may feel differently, but I found him thoroughly dull and unimpressive here, as in most of his films I've seen.Aside from the one decent fight amidst the abundance of uninspired action sequences, the only other aspect of this that held my interest is the low-budget 1994 ideas about what future technology might be like. It seems people have home computer assistants they can talk to and interact with almost as if they were human, but no cellphones. The coolest thing was a device that will let you go to sleep on command -- no more tossing and turning. Of course, if you really want to sleep, just queue up this movie.","I've never really warmed to Don 'The Dragon' Wilson as an action star. I think I remember seeing one of his early nineties flicks in my teens years and thought it was a cheap looking, badly acted affair with crappy fight scenes and then some!Mind you, I had been glued to the very best of Hong Kong action cinema since I was 6 years old, so it would take a lot to surpass that.In a nutshell - Cyber Tracker is a typical early nineties sci-fi B- movie, with crummy acting, bad fashion sense, and dodgy effects, but plenty of watchable fighting and gunplay that delivers lots of unintentional humour!In my opinion - Don Wilson is an odd looking man. That, along with his oddly shaped yet muscular body, can be very distracting when on screen. At times, he gets away with the acting side of things, but most times, fails to engage you with anyone he is portraying. None more so than in Cyber Tracker.But we don't usually watch these kind of movies for the acting right? Or the story? Right?Cyber Tracker came to us in the flood of early to mind nineties cyborg films, with the infamous Terminator franchise leading the way, and the fantastic Albert Pyun and Van-Damme feature, Cyborg, to name just a couple.Set in the near future, and shot on empty streets to give a more abandoned look, Cyber Tracker's main problem is its cast and their acting abilities, followed by the action and fight scenes. While not completely unwatchable, it just lacks a certain kind of choreography, especially with the martial talents of Wilson and the always wonderful Richard Norton on hand.Coming across as an opportunity wasted, the most of the action then turns to gunfire and explosions which passes the mark and helps get the viewer through to the end, offering a few more chuckles along the way.Cyber Tracker isn't great, but it ain't so bad either. Its a harmless mid nineties action flick that passes the time with a hint of nostalgia...","Dragon 'The Don' Wilson is a hardcase bodyguard working for OCP, I mean Cybercore, creators of Robocop, I mean Cyber Tracker, big robotic fellows who are definitely not like Terminators at all, who go around around executing (and definitely not terminating) convicted murderers. Turns out Cybercore, and the local senator guy, are all corrupt and stuff and are secretly executing some bunch of do-gooders protesting against the Trackers. This doesn't sit well with Don \"The Wilson\" Dragon, who becomes a turn coat and gets a tracker set on him as a result. All he wanted to do was pine after his departed wife while talking to his robot house, Agnes 4000 (Agnes?).So now The \"Dragon Don\" Wilson is being chased by a Robo-Tracker of the Cyber Cop variety, and that would be enough to put a dampner on someone's day, but he's also got another enemy on his tail: Richard Norton of City Hunter fame. Richard (great hair man, great hair) thinks that these cyber skinheads aren't too good (and he's right) and he also thinks that he would be better at kicking Dragon Ball 'W''s arse (and he's wrong), which leads to a bizarre half kickboxing, half rolling around on the floor fight.Full of cars and trucks exploding, people firing several tons worth of bullets at each other, kickboxing and evil company bosses, Cyber Tracker probably contains enough action to keep your mind off your life for an hour and a half. They even through in a shower scene with Dragson Won Ildon for those who like to see Kickboxing champions have a shower.Bears no resemblance at all to Robocop, Terminator, Cyborg Cop, Cyborg Cop 2, Cyborg, Atomic Cyborg or Gofrey Ho's Robo Vampire (where it all started, I believe).","In the Los Angeles of the future, crime is rampant. So to help clear up the overly clogged judicial system, Senator Dilly (Aprea) institutes the American Computerized Judicial System. This basically consists of a robot, or android, or cyborg, or whatever (actually called a Tracker), that metes out justice right there on the spot, which means he's just going to shoot you. Dilly's bodyguards are Phillips (Wilson) and Ross (Norton). An underground movement of anti-robot revolutionaries springs up named the Union for Human Rights, who protest all of Dilly's ideas and plans. When Phillips falls in with this crew, Ross feels he knows too much and the former co-workers become mortal enemies on opposite sides of the issues. What will become the nature of justice in America? Find out by letting CyberTracker tell you today!Here we have a cross between R.O.T.O.R (1988)., American Cyborg: Steel Warrior (1993), Abraxas (1990), and Future Force (1989), along with fellow PM vehicle Hologram Man (1995) and more mainstream fare such as Universal Soldier (1992), Terminator (1984), Terminator 2 (1991) and Robocop (1987). But since it's a PM, it has all the high-quality explosions and action/stunt setpieces they're known for. And the movie as a whole is well-shot, in the PM style. So that prevents it from being your average sci-fi slog. But, falling into a common trap of low-budget future movies, everything is written in \"future font\", so you KNOW you're in the future. Just see David Heavener's Twisted Justice (1990) for further proof. That being said, the film drags once Phillips gets involved with the Union for Human Rights, but this is quickly corrected by the final fight between fan-favorites Richard Norton and Don the Dragon. Together at last, it's really a fan's dream to see them together. Their final fight is certainly worth seeing. Both Norton and Wilson show their prowess well in this movie, and it's always fun to see that the many goons all think they can take down Don the Dragon.As the bodyguard of Senator Silly..er...I mean DILLY, Wilson looks especially like Lou Diamond Phillips here. And his character's name is Phillips? Could that possibly be a coincidence?While the bald \"judge jury and executioner\" of the Tracker is a bit too ROTOR-y for its own good, it was played by Jim Maniaci of Timebomb (1991) and Cartel (1990) fame. Of the protesters, whose big gripe is that \"Computers don't have hearts\", Art Camacho appears. Wait until these people get a load of Apple. Hey-Oh! (to quote Ed McMahon). In another weird parallel, Phillips has a computerized companion in his apartment with a female voice named Agnes 1000. This is a lot like what Ed Marinaro has in The Protector (1999).CyberTracker is a good chance to see two of the DTV genre's leading lights in an offering by one of the top companies. Does it fulfill all the promise that description holds? Maybe not entirely, but you should probably see this anyway.For more insanity, please visit: comeuppancereviews.com","I admit that I have a bit of a liking for B-Movies. Sure I like good ones like Spielberg and that as well, but I love a good no-brainer at times.  And CYBERTRACKER certainly falls into that category.I can see how this film could be considered a TERMINATOR rip-off. Hell, the Core Trackers even have an Arnie dress sense (black leather biker jacket.). But the story is very entertaining, and the action pretty good.  It's pretty obvious that Don Wilson and Richard Norton are going to have a showdown, because they're both martial artists.  As for their performances: well Wilson (who reminds me of a bulked-up Lou Diamond Phillips) is okay, as is Norton.  Jim Maniaci, who plays all the identical Core Trackers, is pretty menacing too.But a problem is, some of the characters are not too well-developed.  Case in point: Joseph Ruskin's character Rounds, head of Cybercare, is meant to be the main villain, but he just comes across as a typical BUH-HAH-HAH villain.  Also Steve Burton as Jared has little room to develop here. SPOILER WARNING: I haven't seen all of CYBERTRACKER 2 yet, but Jared turns up in it, despite having been apparently killed in this movie, and NO explanation is given for his survival.That said, the performances are all generally good, but they're the kind you might expect from a B-Movie.  Also, like a typical action movie, it seems that the bad guys only miss when they shoot at the hero, which can be a bit ridiculous.I love the two little twists at the end of the movie (what Operation Echo turns out to be and how Rounds gets his comeuppance).  I recommend this film if you're just looking for a good time.","First things first, I hate low budget Sci-Fi. When I think of low budget Sci-Fi, I think of Albert Pyun. Which is not a not a pleasant thought. In fact, in general I don't like much Sci-Fi at all with the likes of Terminator being one of the few exceptions. I was in a shop which sold second hand VHS and DVD when I stumbled upon this with the price tag of £2.99. Noticing it was a PM Entertainment production who've been responsible for some very good DTV action material and that it starred Don \"The Dragon\" Wilson who I've had a soft spot for after seeing Ring Of Fire 3: Lion Strike, I decided that to throw down £3 that could just as easily disappear on a couple of beers was probably worth it. And for what it was, in my mind it was certainly worth those three English pounds!I'm not quite sure when the setting of this movie is. The world it is based in, is not in the slightest bit futuristic bar all the computers. All of the vehicles are those of 80's/early 90's, so I'm guessing that it's set not long after it's present day and that computers have suddenly taken a huge leap in technology. In fairness though, computers in the 90's did advance hugely, with the sudden take off of the internet around 1995 and by now having grown into something which almost everyone I know has in their home. They just did not evolve *quite* as much in a short period of time as this movie may suggest. But anyway, even though the non futuristic world is probably due to the budget of the production, it certainly looks a lot less corny to look at nowadays than the world Timecop portrays as 2004, where you just tell a computer in your car where to go and it takes you home! Or the world that Escape From New York portrays as 1997, where Manhattan is one large high security prison!Granted, this is much more of an action flick than a Sci-Fi flick and all the better for it. Special effects are kept to a minimum and those that are there are certainly acceptable. It's hard to call it a Terminator rip off as it brings new things of it's own, even if they are rather basic, rather than machine vs machine. This time, we have a human targeted by the villains with machines called \"Cyber-Trackers\". Unfortunately for them though, our Cyber-Tracker is no T-1000, as it appears to be a rather basic machine without much of a brain which does nothing but fire directly at it's target therefore can be easily outsmarted and burnt out.The movie is full of your typically exaggerated PM Entertainment fiery action which is always a hell of a lot of fun. Some exciting car chases, shoot outs, and entertaining fight scenes are what keeps the movie going.As with most Don \"The Dragon\" Wilson flicks, the acting is mediocre at best, with him being probably the best actor here and if you're the type who's concerned about that kind of stuff, then this could be a huge drawback. But some excellent action scenes, good pacing and a rather entertaining finale, rise it above mediocrity.At the end of the day, it's not something that's going to change the weather or leave a huge impression on you after watching but it's fine entertainment, and is certainly light years above the Albert Pyun school of DTV Sci-Fi junk. Go in not expecting much, and you may just come out enjoying it like I did.Rating: 06/10","This is one more film in a long series started by Terminator, about overmuscled androids fighting righteous humans. It is certainly hard to achieve something close to what the big budget Hollywood machine can do in effects, directing, and buying good actors. However, CyberTracker is not that bad - it has some logic, avoids awful acting, or too cheap effects. I have seen much worse in this genre. 5 out of 10 on my personal scale.","Plot Synopsis: Los Angeles in the future. Crime is kept under control by Core Trackers, android assassins dispatched by the United States Computerized Judicial System to execute the guilty. Secret Service agent Eric Phillips prevents an attack on his boss, Senator Robert Dilly (the man who set up the USCJS), by the Union for Human Rights, a group of anti-machine activists. Dilly attempts to initiate Phillips into his private circle but the SS agent goes on the run after witnessing Dilly murder a UHR agent in cold blood. Dilly sends Core Trackers after him. Phillips joins the UHR group & helps them uncover a conspiracy involving Dilly.\"Cyber Tracker\" is the first of a number of sci-fi / action hybrids directed by Richard Pepin, co-founder of PM Entertainment, a powerhouse of action films during the 1990s. Other Pepin films include \"Hologram Man\", \"T-Force\", \"The Silencers\" & \"Dark Breed\". Pepin films typically start with a major action sequence which lasts about 10 minutes before allowing the plot to kick in. The script for this film has a few plot holes  it is never clear what the conspiracy the heroes are trying to stop actually is. As for the acting, Don \"The Dragon\" Wilson may be tough but cannot act for beans, with little charisma. His co-stars are a lot better. The film's best bet are the action scenes, which throw up some impressive artillery fire, a huge bodycount & not one but three moments where a vehicle flies through the air, flips & hits the ground, exploding. The visual effects border on the cheap side & the musical score is low-key & shrill.","Finally saw my very first Don \"The Dragon\" Wilson movie and I can only assume that his other movies are going to be this $#!++y so I can't wait to assimilate. Cybertracker is a very clumsy and a poorly made film. The main issue I have is that the action is sloppier than a mother******. Badly choreographed martial arts, retarded chase scenes I mean....ugh. Everything else cries mediocre (acting) to descent (cinematography) enough but the story did have some potential. I liked it but in a \"maybe once every three years I'll watch this stupid piece of $#!+\" type of like.","Those action mad loonies of PM Entertainment, Joseph Merhi and Richard Pepin deliver this somewhat fun Terminator rip off starring former kickboxing champ, Don 'The Dragon' Wilson.Funny thing is, despite his obvious skills in the ring, I have never much liked Wilson's on screen fights and this film proved no exception. Even the final fight against martial arts star Richard Norton – a fight which should have been awesome, proved to be decidedly mundane.But enough about the fights – what of the rest of the film you might ask?Well, it's derogative stuff at best and clearly knows it but with Merhi and Pepin on board, plots invariably play second fiddle to the action scenes at any rate. In this regards, there are some admittedly cool sequences on offer which really elevate the film.Acting wise? – Probably best not mentioned but overall a fairly fun little film that should keep action fans mildly amused for ninety or so minutes.","dannystringer","drdisque","fmarkland32","gridoon","Leofwine_draca","poolandrews","RoboRabbit89","captainsilverink","bensonmum2","michael-3204","george-844-384633","Bezenby","tarbosh22000","bannonanthony","aloep","dromasca","DigitalRevenantX7","ThyDavideth","HaemovoreRex","4 October 2007","12 March 2005","15 June 2006","12 May 2004","31 May 2016","9 December 2006","3 November 2017","25 June 2017","12 February 2017","16 August 2016","24 November 2014","4 February 2014","23 September 2011","31 August 2004","13 April 2004","3 January 2003","4 April 2008","30 November 2017","29 June 2010","1","2","3","5","4","3","3","3","2","2","5","5","6","5","4","5","5"," Worst film ever? I think so...\n"," Anooying quality details ruin movie\n"," The bland heroics of a kickboxing champion...\n"," Trivial \"Terminator\" rip-off.\n"," Plenty of action, but there's no originality or budget here\n"," Low budget sci-fi martial arts rubbish.\n"," A bad/good movie that is kinda fun.\n"," Robocopinator 2: Judgement Matrix\n"," Lame\n"," Cyber-schlock\n"," Cyber Quacker Entertains!\n"," Cyber Crapper\n"," The Dragon Vs. Norton!\n"," \"You are to be executed!\"\n"," No classic, but rather good for a low budget sci-fi flick!\n"," Could Have Been Worse\n"," Great action scenes.\n"," The Dragon Whoppin Dat Cyborg Booty\n"," Undemanding but fairly enjoyable\n"]}