{"primary":["Babylon 5: A Call to Arms (TV Movie 1999)","https://m.media-amazon.com/images/M/MV5BYWJmMzMwMzItYTc2OC00OTUxLThlYTMtYWY5NjMwODA3OWQ0XkEyXkFqcGdeQXVyMzYyMzU2OA@@._V1_UY1200_CR37,0,630,1200_AL_.jpg","http://www.imdb.com/title/tt0146455/reviews","tt0146455"],"secondary":["I've been watching Babylon 5 since it started years ago, and think its one of the best shows in American history. As for A call to the arms, it did the show justice in the sense that unlike some of the other TV movies done over the past years, it was a lot of fun, had a good plot, and a good script.  I highly recommend this to anyone out there.","Many seem to consider this the best of the movies. Even the creators themselves. I'm not really sure why.First of all, the music is horrible. Saying that may sound harsh, but then so does the movie. Music can make or break a movie, and here it almost manages to break it. It's plain bad. \"The Gathering\" had a similar problem with music. It's not even just that it's not Franke making the music, it's bad in both of the titles regardless of what you compare it to.Second, the plot doesn't seem that strong. Invasion of Earth with leftover shadow tech? Plausible, but not exactly groundbreaking. The whole thing is, overall, quite uneventful in its predictability. But that's not the worst point. I actually can't even say for certain what is, but overall the whole feel is slightly off (same goes for the whole short-lived Crusade series that followed this, actually). Also the new characters don't really have enough time to \"grow\" on you, and you don't have that many of the old B5 cast around, even though the performance of the few that are there is decent. I'd personally certainly rate this the weakest of the B5 movies, even though it still is decent. But I'd rate it more along the lines of some of the weakest B5 series episodes.Overall I'd probably give it a seven, if not for the atrocious music - considering that, it's a 6+. By comparison, In the Beginning would be 8,5, Thirdspace and River of Souls would be 8, and The Gathering 7.","Of all the movies \"A call to Arms\" is my favourite, \"In the beginning\" makes a wonderful prequel but generally only the very big fans of the show will really appreciate all the parts of the film. \"A call to Arms\" manages not only to please big fans of the show by featuring a very big event in the B5 universe, but also make a stunning stand-alone movie that anyone could enjoy.I thought Dobro and Woodward were absolutely excellent as Dureen and Galen, characters I am certainly looking forward to seeing more of in JMS's crusade.The music is...well, pretty bad on first listening. But eventually you'll get used to it and it does give the film a unique and different feeling to the rest of the B5 series. This is definetly the movie to watch if you want to watch one of the films to get into the series.","...within the \"modern-day\" B5 context (which excludes In the Beginning, a prequel of sorts).  Call to Arms leads neatly into the coming Crusade series, we're introduced to some of the important characters of that series (particularly the enigmatic Galen), we meet at least one other character who is played up but ultimately martyred, and unlike its two predecessors, Call to Arms gives us a menace directly out of the B5 \"mythos.\"  Boxleitner and Doyle take center stage for the final time.  The pieces are in place - now we can look forward to the series itself.","You can buy the first two movies (In the Beginning, The Gathering) separately, but in order to get all five B5 movies (the first two plus Thirdspace, The River of Souls, and A Call to Arms), you have to buy them in a box set. The first two movies are out of orderthey should be In the Beginning and then The Gathering. These movies are GREAT for background information. They really should be watched before watching the series. Thirdspace is a detached from the rest of the movies and series. It comes after the end of the Shadow War (season 4, episode 6), but then there is no mention of it again. If you never saw this movie, you wouldn't miss any continuity. The only thing it clears up is why Lyta Alexander and Zack Allen never got together. The River of Souls occurs in apx. Year 2263 and is less detached because B5 has encountered Soul Hunters before. This just gives more insight to them. It is like an extra episode in Season 5.A Call to Arms (Year 2267) is a prequel to the Crusade series. If you aren't planning to watch the Crusade series, there is no reason to watch this movie. Season 5 should go like this: 1. Season 5 Episode 21 \"Objects at Rest\" (Year 2262) 2. The River of Souls movie (Year 2263) 3. A Call to Arms and the Crusade Series (Year 2267)optional. I suggest these be watched separately from B5 series as they really don't enhance or expand on the B5 series. 4. The Lost TalesVoices in the Dark movie (Year 2271) 5. Season 5 Episode 22 \"Sleeping in Light.\" (Year 2280)6. The Legend of The Rangers: To Live and Die in Starlight (after the Year 2280)optional. Does not add nor detract from the series.","Nicely plotted, and working a good transition from B5 to the ill-fated Crusade spin-off not just in narrative but in mood - there's a general shift from politics towards mysticism (also adumbrated in Thirdspace, where the dream sequences were rather more powerful, even if they ultimately had nowhere much to go). This change of mood is underlined by Evan Chen's controversial scoring; personally I like his work for Crusade, but found his dry run here deeply mediocre.It's a measure of how Bruce Boxleitner's stature as Sheridan has grown over four seasons of B5 that he effortlessly and charismatically takes centre-stage here.  Jerry Doyle's Garibaldi is equally assured but doesn't in the end have that much to do. Of the newcomers, Carrie Dobro is probably the only one who can match up to the old timers, though Tony Todd is his usual professional self. Opinion is divided about Galen. Specifically it's divided between me and other sensible people who think Peter Woodward should have been drowned at birth, and people who aren't as sensible as me. To be fair, he's not as dreadful here as in the early episodes of Crusade. Be thankful for small mercies.","I loved this movie. No conditions, no comments or concerns. I just loved it. This film wrapped up some loose ends nicely - set a time frame for the Telepath War, provided a nice culmination of Sheridan's \"destroyer-scale White Star\" idea from Season 5, showed the return of the technomages, presented a \"clean and sober\" Garibaldi years after \"River of Souls,\" etc., etc., etc.","A Call to Arms is by far the best of the B5 movies. They had a great story, excellent effects and okay music. A Call to Arms acts like something as a send off to the old characters from B5. The movie also had a spine tingling ending that set the pace for Crusade, the B5 spin off TNT cancelled for no good reason. Thumbs way up on this one.","I had great expectations for this movie. And I wasn't disappointed, not at all... except for the atrocious soundtrack. Maybe if I wasn't a big fan of Babylon 5, it wouldn't bother me, but when I was used to the great music through the five series, and then I heard *this*, I mean, what's this for? A good soundtrack can promote a movie greatly, or diminish its feel. Anyway, this was the only bad thing about it. Sheridan was ace, same for the new ships! Good storyline, solid action, nice introduction to the Crusade series. I liked how the script tied all this to the Drakh, and that their nasty involvement is explored further. The new characters were great!All B5 fans must watch it!","This made for TV movie was actually made to set the stage for a Babylon 5 spin off series, CRUSADE. In this movie, a huge showdown with the evil minions of the Shadows (the Drakh) is about to occur with the Earth. However, no one is aware of this and the only clues to the impending holocaust are weird dreams and visions that are experienced by Sheridan and two others who he has never met. One is the captain of an Earthforce ship, the other is an annoying and difficult to like alien named Dureena. Dureena is a thief \"with an attitude\" (quite the cliché) and I never warmed to her character in this movie or on the nine episodes she was in on the show CRUSADE. In addition to these characters, Galen (a reappearing character on CRUSADE) also makes his first appearance. Unlike Dureena, his character did improve over time--so the idiots producing CRUSADE decided to take him off the show. In fact, after this excellent movie with an excellent premise, it seemed like TNT (who produced the series) did everything they could do to kill it, such as moving the show about, alienating the head writer and not bothering to publicize it. It's a shame--in seeing this movie, you have a good idea of what COULD have been had the series continued receiving network support.Overall, this movie is quite watchable and exciting, but many of the familiar characters (Delenn, Londo, Vir, others) are absent. Plus I don't know if I am being too picky, but during the big battle with the Drakh, things seemed to really drag and take forever--this part could have been tightened up a bit and would have resulted in a higher score.","I'd like to see Straczynski remaster this one and have Christopher Frankie redo the music. The music now just seems bland and gives the movie a very dull atmosphere.","\"A Call to Arms\" is a pretty good movie.  Sorry that sounds kind of blah, but it's true.  Entertaining, but not epic.  Guess I kinda got spoiled on \"In the Beginning\", a vastly more thought-provoking and involving movie than this.  But, I have to agree with a previous reviewer...the music was abysmal.  This \"The Fifth Element\"-esque dribble almost literally caused pain to my ears.  The music should complement and enhance the program, not distract from it, as this did.  I sincerely hope the upcoming series pays attention to what works:  a classical piece of some kind...something kind of dark and gloomy, since, after-all, the premise of the series is the death of mankind, with an uplifting fanfare for victories achieved by the crew.  Then again, Hanson vocals would have been better than what was chosen.  Change the music, and I'll watch as a devoted fan.","Ok, lets make this clear before there are any nasty words being thrown my way. I LOVE babylon 5 ok? But i felt disappointed with this movie :(The reason why i felt disapointed with this movie is because i think that you have to be *really* into Babylon 5 if u r to enjoy this movie! I admit, it had some class bits and the \"White star Destroyers\" were brilliant! But like alot of you have mentioned, the music drove me to destraction and also i felt that it \"took to long\" getting to the point!Sheridan was at his finest in this movie but i REALLY missed Delenn! I loved that girl! Galen and Durenna were also great actors, altho i still miss whats her name (I KNOW I'VE SPELT THEIR NAMES WRONG!!) Ivonnva, that girl had class! Not to mention a very sharp tongue! The story line, settings and design of this movie was first rate, but towards the end i was just thinking \"Blow up the stupid planet and lemme go!\" How poor was that?I'm not taking the mick outta this movie, i loved it! And it is alot more better than \"River of Souls\" but it doesn't appeal to me in a way such as \"Thirdspace\" did or even \"In the beginning\" did, i dunno, may be sometime in the near future i'll love it just as much but for now, i'll watch it bit by bit by bit...","This is a pretty good movie. Not the best but very good. The music on the other hand is abysmal. On top of that, they opt for no sound during dramatic moments *except* for the music.This is also the same type of music used in the B5 spin-off \"Crusade\". Now I'm not going to lay the blame for Crusade's failure solely on the music but it was definitely a contributing factor in my opinion. It just gives it a chintzy kinda feel. They could and should have done better for both this movie and the show.","Well this rates as one of my favorite B5 movies second only to In the Beginning. The movie does a fine job of setting up for the Crusade series. The scenes of Earth being attacked by the Drakh, and the Omega class destroyers along with the 2 ISA destroyer prototypes defending it is staggering. A must see if you are a B5 fan. Omega class destroyer fans will like this one.","This movie was the best out of all, as my personal opinion told me.I loved it...You know, I'm a big fan of Babylon 5, especially the huge fan of John Sheridan...Whoo...I just love his charismatic figure when he appeared on the screen.When I just see the charisma of President Sheridan, I think I want the time to be stopped forever...On the Scifi channel, they showed the whole series of B5 movies, and the episode 'A Call to Arms' was on it.The side characters were making the movie greater than it already was!Garibaldi, Galen, Lochley, and the others...I believe they were good too...\"The best episode out of all episodes...\"That's what I'd like to call this particular episode!It'll draw your attention right from the moment once you put your eyes onto the screen...And you know what?It won't let you go until you finish watching the movie...I highly recommend this movie to the ones who didn't see this yet, and I agree with the ones who commented about this movie that this movie WAS, and still IS the great movie I've ever seen in my whole life!!","I thought A Call To Arms was a great Babylon 5 movie. The plot was great and the acting good. I can not look past the horrible music though that offsets the rest of the movie in every way.","I'm a huge Zack Allan fan and was disappointed that he only got one scene in the movie. This was also my favourite scene where he confiscates a character's weapons and directs her to Down Below. Unfortunately unlike Thirdspace & River of Souls, most of the action took place off station. I didn't care much for Garibaldi after the first three seasons and think Sheridan is okay but no Sinclair. I like Lochley but she only had limited screen time. If you like Crusade or space battles you should enjoy it. Personally I can only give it 1/10.","I thought A Call To Arms was a superbly entertaining hour-and-a-half of television. Much, much better than Thirdspace, and far better paced and structured than the very good but very *flawed* In The Beginning.The much-criticised music was, in my opinion, excellent. It was perfectly in sync with the more cutting-edge, 'funkier' tone set by the visuals and script, both of which were noticeably different to B5's.Evan Chen certainly brings a new sound to the B5 universe, and gives ACtA and Crusade a whole new musical flavour. At times it was too intrusive, but that was partly down to JMS' tendency to always have the music too loud on the soundtrack. The casio-keyboard instrument was a bit irritating for a few seconds of the entire film...Generally, however, the music moved the film along wonderfully, giving it a very kinetic feel. This music has far more potential already than another classical score. As good as the Williams-Horner-Arnold scores are, do we really want *another* imitation?The B5/Crusade crew have tried something new. And it worked; not everywhere, but it worked. And it'll get better. And better.","The underlying problem of JMS's Babylon 5 universe is that the characters was always more interesting than the universe they lived in. Narns were fun, but they were never as cool as Klingons. You only cared about Narns because G'Kar was such a great character.Thus we have \"A Call to Arms\", an excuse to get a few of the regular B5 Characters to set up what was going to become \"Crusade\". Which might have been a great series in its own right, had TNT not blown it. (Like putting Season 5 episodes of B-5 up against new episodes of Star Trek Voyager).Overall plot line. Galen manipulates Sheridan into realizing the Drahk threat against Earth. He teams up with an Earthforce captain and a thief from a dead race. They take two prototype ships to confront the Drahk and the leftover Shadow Planet Killer.Bruce Boxleitner and Jerry Doyle do some good work here. But all they are doing is setting the table for a meal we never got to fully enjoy. TNT took away the meal somewhere around the soup or salad portion.God Save us From Basic Cable.","Sheridan and Garibaldi are in top form, the new ships are fabulous-looking, but--best of all--the new characters of Galen, the technomage, and Dureena, the \"thief,\" show great potential as main characters for the coming Crusade saga. A must for B5 fans, and of interest to sci-fi fans in general if only for the special effects. Unfortunately, the only thing missing was Delenn, who would have been too much competition for Lockley and Dureena.","I can clearly see the potential for an excellent series to arise out of this segue.  I would really not like to call it a pilot because it doesn't appear to have all of the principal cast members in place. That being said this movie rocked the house I can see a time with good writing and acting when this series may become as good as or better then b5","John-238","teppo-2","delenn-11","Gislef","bpeck13","Jeremy-93","caligula-5","Op_Prime","interfacetkr","MartinHafer","inika117","maestro-14","oogy_boogy","AttitudeInc","*Prometheus*","florence208","prophet-6","Cylex","Keena Films","JoeB131","xkalibr","adawg","4 January 1999","3 May 2009","24 June 1999","4 January 1999","8 October 2008","4 August 2000","5 January 1999","28 September 2000","27 December 2007","2 July 2007","4 June 2018","15 January 1999","7 November 2001","24 August 2018","4 January 1999","2 June 2002","5 January 1999","12 September 2003","22 January 1999","21 September 2010","23 January 1999","12 January 1999","6","10","8","7","10","7","8","6","8","10","7","1","7","10"," My feelings towards A Call to Arms\n"," Not entirely sure what to make of it\n"," The strongest of all the movies.\n"," The Best B5 Movie So Far...\n"," How to watch the B5 movies\n"," Good sign-off for Boxleitner, and decent overall\n"," Why I thought it kicked butt.\n"," The best of the lot\n"," Great movie - bad soundtrack\n"," It's a shame, but after this great start it all kinda fizzled after this film ended\n"," I'd like to see a remaster.\n"," the music sucked hard\n"," Going out on a limb here\n"," Love the movie, hate the music.\n"," wow\n"," What a magnificent movie!!!\n"," Great Movie, lousy music\n"," Not enough Zack! Or Lochley. Disappointing.\n"," Evan Chen has made a great musical debut.\n"," A not bad movie\n"," Definitely a nifty segue to Crusade.\n"," it's on now!!\n"]}