{"primary":["Totally Awesome (TV Movie 2006)","https://m.media-amazon.com/images/M/MV5BMTk2NzcxNTA2MF5BMl5BanBnXkFtZTcwNDc4MDkzMQ@@._V1_UY1200_CR111,0,630,1200_AL_.jpg","http://www.imdb.com/title/tt0485161/reviews","tt0485161"],"secondary":["This film wasn't bad, nor good. For me it was pretty average. A lot of the film included Scary Movie laughs involving silly plot lines including spoofing Teen Wolf, Sixteen Candles, and Dirty Dancing among others.This movie revolves around Charlie, a teen from another city who moves to a town in California where dancing is banned and the people are complete idiots. Adjusting to the change with him, his sister Lori (Dominique Swain) falls in love with a janitor (Chris Kattan) who happened to be the dance instructor of the school until dancing was banned. Lori's relationship with the janitor gets more heated after going to Gabriel's dance studio which is a kept secret from the town. The ban on dancing makes angst-full Lori furious of the dancing ban and plans with Gabriel to do a show at a decathlon where Charlie, with the help of his mentor, the gay Mr. Yamagashi (James Hong), will hopefully win after he makes a blindsided deal with the school bully, Kip (Joey Kern) that if he lost, he would move out and that Kip could kick his butt as much as he wanted. Along for the wild ride is Charlie's platonic best friend, Billie (Nicki Clyne) who has a secret crush on him, but can't seem to tell him. Also Kip's girlfriend, Kimberly (Brittany Daniel), who plays Charlie's love interest, does a pretty good job at using Charlie when he's at his weakest.This movie i had to admit was quite funny. Okay, hilarious! Although not as good as i thought it was going to be, the cast does the best they can to make the plot and stories fun to watch. I recommend this to all of you guys that just like to have fun and like to see stupid people do stupid things.","I watched the entire movie without stopping and deleting it from the DVR. That's about the best thing I can say about \"Totally Awesome\".The thing about spoofs is that they only work if they consistently satirize their targets. They need to find humor in parts of the original films that weren't \"funny\" and find humor in them. This is the biggest flaw of \"Totally Awesome\". The movie is just lame setups, horrendous overacting and a few interesting ideas that never quite hit the mark. There is very little actual satire. Mr. Miyagi got more laughs in the original Karate Kid than his \"spoof\" counterpart did during this entire train wreck of a movie. Dominique Swain is another big offender here. I'm sure she was directed to completely overact, but she completely blew past the line separating funny from downright annoying. With maybe one or two exceptions, I found her performance almost unbearable.It's not all doom and gloom, after all I did get through the whole thing without deleting it. I'm not normally a huge Tracy Morgan fan, but he completely stole the show with the brief role he was given. Even by spoof standards Joey Kern might have been a bit too over-the-top as the nemesis, but he did get me to laugh more than once. There were also some laughs to be found in some of the dancing scenes and the lead actor looked eerily like C.Thomas Howell from \"Soul Man\" when in black-face.I guess it's not a complete waste of 100 minutes, but it's not hard to realize why this script wound up as 'made for VH1' filler either. I have a sneaking suspicion that this was shot for theatrical release or possibly direct-to-DVD. The transfer is clearly cropped from some widescreen film format. It's pretty easy to see why it never made it that far. (Altho from what I hear, this is being released on DVD. Oh boy.) Anyways, this one misses far more than it hits. When you are constantly reminded how much superior the original 80's movies are instead of being inspired to laugh at their silliness, the makers of the spoof have dropped the ball.Who thought the movie \"Soul Man\" was a good idea? Apparently the same folks that thought \"Totally Awesome\" was a good idea.","This movie is what it is. A spoof movie. It's not supposed to be \"great\". For all those who say it sucked for lacking a plot I say to you, move along because you obviously do not know a hilarious movie when you see one. It's a great movie to watch when you're baked. The directed also directed \"Half Baked\" starring Dave Chapelle. If you wanna have lots of out loud laughs, watch this movie. If you are looking for a serious movie, then this is not for you. It's made by VH1 people, come on. It's supposed to be a joke. I personally enjoyed Dominique Swain's spazzy loud character. She was hilarious. So basically, if you are a stoner then you wont be disappointed.","i LOVE this movie! i had an 80s party and we watched all the classics like pretty in pink,sixteen candles, etc...and THIS. my friends and i were laughing soo hard we were rolling on the floor almost hyperventilating. even if you don't think this is the most awesome movie ever (which means you're absolutely crazy and don't understand the value of an 80s style movie) you can at least spice up your conversations by quoting random lines... this is the funnest thing ever like \"let abracado-this\" or \"you ever broke a Puerto Ricans's arm for sweatpants money\" try it if it doesn't break the ice then you really have failed as someone who lived in the 80s because i'm guessing you all have lived in the 80s and saw these movie in original version well guess what i was born in 92 and i understand the value of this movie and all 80s movies...if you disagree then stick to the history channel or whatever it is you boring people watch.","I know that some of you are like \"waah waah waah I think this movie ruins the original blah blah blah!\" Well, geniuses, that is what it's supposed to do. I don't understand why you people can freak out about it. IN MY OPINION it is the funniest movie I have ever seen, plus it has a happy and hilarious ending. And the person who was complaining about Yamagashi is just jealous, because he's possibly the funniest thing in the movie, which is a great thing to accomplish, and he's so old and wrinkly and Asian...STUPID! God, there is absolutely no reason to complain about this movie, and if you get the DVD, Wolf Love is a hilarious deleted scene! The only thing I have to complain about is stupid people who just want a reason to gripe, my advice to you retards is FIND SOMETHING ELSE TO DO BESIDES GRIPE ABOUT THIS WONDERFUL ACHIEVEMENT THAT SHOULD BE HAILED, NOT CRITICIZED!!!!!!!!!!!!!! Get the facts straight people! Now, if you want a hilarious, heart-warming gut-buster, then rent or buy this movie, you will NOT be disappointed. And for everyone else... either watch something else or shut up on the comments, because you, not my friend, are totally not awesome.thank you for your time!","It's a crime that so few people have heard of this movie, and that so many have SEEN Meet the Spartans and Date Movie. This is flick is on such a higher level! Tracy Morgan's walking techniques, Chris Kattan's dance routines, and way too many subtle throw-away lines to count, make this movie TOTALLY AWESOME! The director's latest movie, The Goods, I found to be only \"with its golden moments\". Honestly, if you're on your way out to see it, spend the time to track this movie down instead. You'll have many more LOLs, and all in the comfort of your living room with whatever snacks you want to bring in! I totally plan to talk about this on hotcakesPodcast dotcom sometime before episode 60! PS Small Computer, Broken Leg...Look forward!","I've seen spoof movies and decided to watch \"TOTALLY AWESOME\" on DVD. At first I thought it was really terrible even for a spoof....but I kept watching and it kinda grew on me. There were some surprising Laugh out Loud scenes. I think the dance (Flashdance-Dirty Dancing) side story probably seemed funnier on paper (the script) but didn't work. Brittany Daniel is listed as top bill and we didn't see nearly enough of her. KIP was hilarious at times. Not a \"TOTAL\" waste of time if you just want a few laughs while eating pizza! The \"Miagi\" spoof of being gay was very funny as well. I thought there could have been more sexiness...but hey--it's VH1 TV movie. Maybe they can't show too much.","Wow... I really liked this movie when I saw it last night. One reason for that is because I like 80's movies a lot. But I will say there are many things to make fun of about 80's movies. That's why it was perfect for a spoof. Basically, Totally Awesome provided my friends and I with movie quotes to shout out at random times for forever. It really made us have something to laugh about even when we weren't watching it. Also, if it means anything, I liked this movie so much that the second time it came on I hurried up and recorded it! Still, it gets away with a lot of funny things. I have to say that, since it's a spoof and isn't supposed to make sense, it was pretty good. =D","I will warn you ahead of time ... if you're looking a good plot line or great characters, this is NOT the movie for you; but then again, plot lines were TOTALLY \"OUT\" in the 80's.This movie is a good mix of kitschy fun mixed with 2 great ex-SNL-ers that totally made it worth the watch (I wish I had Chris Kattan's moves ... hahaha)...and Tracy Morgan ... c'mon THINK about it ... have YOU ever broken a Puerto Rican's arm for sweat pants money??? I know I haven't ... yet.This movie even touches on some lesser-known flicks (see if you can catch ALL the references the first time through!)It's TOTALLY AWESOME in such a TOTALLY bad way! Like, for sure!","In a take off of the horrible plot devices of the 80's \"Movies\" and i use the term lightly, \"Totally Awesome\" is just that AWESOME!!!! The conceit of the film is that it was a \"lost\" film from the 1980s, recently rediscovered in a vault in the Arizona desert and bought by VH1 because, according to narrator Ben Stein, VH1 \"didn't have enough 80's themed programming.\" Mikey Day plays Charlie, a young man who moves into a new town, where he is automatically dubbed the most unpopular senior at his high school. He falls for the prettiest and most popular girl at the school, Kimberly (Brittany Daniel), whose boyfriend Kipp (Joey Kern) is a stereotypical jock and bully. At first, Charlie attempts to woo Kimberly, seeking the help of a black man named Darnell (Tracy Morgan) in attempts to be cooler. Darnell teaches him how to talk, walk and act like a cool black man, though this attempt ultimately backfires.Charlie also meets a girl named Billie (Nicki Clyne), the class loser, who is poor and has very oily skin. She is the only one who understands Charlie and develops a crush on him. Charlie befriends Billie, though at first insists their relationship is platonic.After an altercation with Kipp, Charlie challenges Kipp to a Decathlon. To prepare, Charlie seeks the help of Yamagashi (James Hong), a wise, old, gay, Asian instructor (and parody of Mr. Miyagi from the Karate Kid series of movies). Charlie is told to do odd chores that are supposed to help him in the Decathlon like \"Sweep My Deck\" for pole vault, \"Jump For Apples\" for high jump, and \"Toss the Rock\" for shot put. When Charlie points out that Yamagashi has only taught him how to do three events, Yamagashi suggests killing Kipp to avoid the contest; when Charlie rejects homicide as a solution, Yamagashi tells him he must find a reason to drive him to succeed.In addition to Charlie's attempts to survive the new school and court the girl, the movie follows Charlie's sister Lori (Dominique Swain), a dancer who is in love with school janitor Gabriel (Chris Kattan). Gabriel was the dance teacher before dancing was outlawed in the town following an incident in which several dancing teenagers had their feet come loose (a reference to the 1980s film Footloose).In the end, Charlie wins the decathlon and falls in love with Billie, Lori brings dance back to town, and Gabriel gets his job back as the dance teacher and gets permission to have sex with teenage girls. Kipp the bully gets eaten by a werewolf.","Especially with all of that big name talent. As the synopsis states, \"loaded with the typical formula, clichés, bad fashions, and stereotypical characters\". It already been done a hundred times before, except those movies were funny back in that time. This film tries way too hard to be funny, but the dialogue sucks and the characters are so assembly line created. I suppose you can't really blame the actors. After all, they can only go so far with bad writing. Honestly, there are ways to make a retro film fresh and engaging. This certainly is NOT a good example of that. Old ideas, old production tricks, old dialogue repackaged and regurgitated. If you are looking for this type of nostalgic comedy, then rent one from that era.Sorry, but it's just not that funny. My friends and I have to ask, why spend all this time and money only to come up with a lame product. We don't hate it but we certainly don't like it either. It should have been a low budget indie. At least then you aren't expecting much. There are far better low budget films out there that are much funnier.I do have to give a honourable mention to the wardrobe however. At least an honest effort was made there.","This movie was sooo bad. It wasn't even funny at all. Not even the sarcastic scenes were funny. Oh man, bad, so bad. Thumbs down. Spoofed, Karate Kid, Teen Wolf, Footloose, Dirty Dancing, Some Kind of Wonderful, Soul Man, and probably another or two. Chris Kattan at his very worst as the high school janitor who is a talented dancer, who runs a dance studio in a warehouse. He has a jealous girlfriend, who breaks her ankle and her dance spot goes to the cute blonde newcomer who Chris has eyes for. I thought the acting was really bad. I like laugh out loud comedies, this was not one. \"Not Another Teen Movie\" wasn't funny, but had a lot more funny scenes than Totally Awesome. \"Scary Movie\" is suuuper funny. I always laugh when I watch those, super enjoyable. This movie, not funny.","I've just watched this movie on TV, and it seems to me a sad attempt at pointing fun at the 80's, but fails miserable.\"Not Another Teen Movie\" wasn't amazing, but at least it nailed the bad 90's teen movies and put some humor into it.This movie is about a brother,Charlie, (Mikey Day) and sister ,Lori, (Dominique Swain) who move to a new town in California from Pittsburg. The sister loves to dance and trained as a ballerina, so naturally she's crushed when she discovers she can't dance in this new town. The guy is ranked bottom of his senior class in 'coolness' on his first day and makes some feeble attempts to \"rise against the cool people.\"There's the unattainable hot chick, the jerky popular guy who makes no sense and the freaks. There's also Charlie's best 'freak friend', Billie (Nicki Clyne), who has a hopefully crush on him and can't admit it (Sixteen Candles right there).The movie progresses with bad references to \"Dirty Dancing\", \"Teen Wolf\" and the like.I won't give away anymore, but I wouldn't recommend this movie unless it's 3am and nothing else but infomercials are on.It's not nearly stupid enough to be considered \"so stupid it's funny\" and it's not interesting enough to have any sort of cult following.(And then there's the creepy janitor (who's an ex-dancer) and the principal who doesn't give a hoot.)","I'm making the bold prediction that this movie will, in time, become a cult classic for those who \"get it\" much like Office Space. Many reviewers, professional and not, dismiss this movie out of hand, again like Office Space. They clearly don't fall into the \"getting it\" crowd. Those who enjoy twisted reference and a plethora of quotable lines will fall hard for this picture. I can't stress enough that you and whoever you watch this movie with will be trading lines via text messaging within minutes of the credits rolling. This is a tribute to primary writer Neal Brennan's (Chappelle's Show, Half Baked) script. Brennan does a great job crafting a very clever homage (not entirely a spoof) to 80's flicks. Centering around the Gunderson family that moves from Pittsburgh to California, Totally Awesome finds siblings Charlie (Mikey Day) and his sister Lori (Dominque Swain) trying to adapt to their new surroundings. The family is rounded out by genius younger brother Max (Trevor Heins) and optimistically clueless parents (Greg Kean and Teryl Rothery). Immediately things go wrong for Charlie and Lori as their worlds are turned upside down. As the new kid, Charlie finds himself dead last in the school coolness rankings and dance aficionado Lori can't practice her trade due to some dubious local legislation. What sets Totally Awesome apart from other 80's referencing films, such as Not Another Teen Movie, is that the main characters and many of the surrounding cast are composites rather than direct references to characters from classic 80's movies. Standouts include Joey Kern as smirking king of the High School, Kipp Vanderhoff and Tracey Morgan in a role that relied heavily on his ad-libbing abilities. Chris Kattan does a respectable job as the smarmy 35 year old school janitor Gabriel, as does Lucie Guest as his scorned girlfriend Deb. Granted, Guest's performance is facial expression heavy, but the casting was perfect! A refreshing change to this film is the lack of gross-out humor (perhaps we are spared this due to its production for television) that seems to the status quo for movies that fall into this genre (think Wayans).The soundtrack is expectedly laden with 80's classics, however the score is part of the fun here. The music for the dance numbers and the emotional synth filling the background of Billie and Charlie scenes perfectly set the mood. Occasionally the film does fall flat particularly it's thankfully brief and over the top Teen Wolf references, however its positives more than outweigh these scenes.","My friends and I watched this together the night it came out and we seriously could not stop laughing. It was so awkward and funny and weird and after it was over we kept quoting it. It was a really great movie to watch with friends.The spoofs on 80's movies were funny and the actors were great. Our favorite characters were the black guys who tried to teach Charlie how to walk and talk. Gabriel and Lori's kissing scenes were hysterical and the parts that made fun of Karate Kid were great. This may not be the best plotted movie but it is a great movie to watch if you just feel like laughing and not really having to pay attention and understand a plot.","From its 80's feel to its stupid humour that makes you laugh out loud. The movie is about a boy and girl who move from Pittsburg into a town that has completely banned dancing but when the girl rebels against that and meets the Janitor ( played by the hilarious Chris Katten) and in another plot the boy of the group competes against the coolest kid in school in a decathlon to prove he is better then them and along the way he meets Yakomosho or something a Chinese decathlon. This movie is very funny and proves that the spoof industry is still up and running. Overall you should this movie if you either like the 80's, were in the 80's or just like spoofs. I rate this fantastic movie a very accurate 83%.","I was born in 1986, so, yeah, I wasn't old enough to be a part of everything like some of you guys were, but, as I did get older, I did rent or watch all the 80's movies on TV. I also love 80's music and own a bunch of 80's cd's and listen to 80's weekend on 94.3 OK, now to the movie. I loved it. Was there things that were miss? Yes. Was there things that were hit? Most definitely. More than there were miss. The only things I didn't like about the movie was the character of Max. The movie would have held better without him as he wasn't needed at all and wasn't funny. The second thing was the soundtrack. They played awesome 80's songs, but, there were only like 7 80's songs in the film. I felt like they could have used a good 15-20 songs from the 80's and it would have made a great Totally Awesome soundtrack to buy on cd. Other than that, for the songs they did use, it was awesome. The styles were also quite awesome. And, the spoofs were just hilarious. The TV spots didn't do the movie justice as it was way funny. I bought the DVD on the day it came out, which was today. And, it's unrated, and, for a TV movie, the DVD isn't vanilla at all. There looks to be some decent special features, though, I have yet to watch them. So, be sure to at least rent and watch this movie if you haven't seen it on VH1 yet, because, you'll love it if you're a child of the 80's or before. Heck, I'm sure you'll want to buy the DVD even.","It's a sad sign of the times that many movies today pass themselves off as parodies when they are, in fact, just riding the coattails of the movies they are \"parodying.\" Remember \"Airplane\"? Guess what! It's still funny! But just presenting people in loud, ugly clothes, pointing out obvious clichés and using silly phrases from the 80's doesn't make this an 80's parody; without those things it would just be a forgettable teen film about a nerd who wants to be a winner. There are tons of movies like that from the 80's already and most of them are at least as good, or no worse, than this. Sort of like how \"The Wedding Singer\" didn't really need to be set in the 80's at all either.This would've worked as a real entry into the dumb 80's teen flick genre--movies that were made for no money, were not funny, were mildly entertaining and are only remembered now as a genre BECAUSE they were so lousy (and had all those awful hair and clothes fashions in them, as well as a lot of tinny \"set it and forget it\" music scores). There were a handful of good ones that have achieved classic status for being good films (the films of John Hughes), a slew of bad ones that were so bad they're still remembered today (\"Mannequin\" and the like), then movies that were like this one--silly, fluffy, mindless pablum hastily thrown together and playing on cable endlessly because they were cheap to purchase. Perhaps that's a compliment--the makers of this movie have succeeded in creating something exactly as it would've been in the 80's, with no wit or commentary added at all. Like those real 80's movies, there are a few laughs here, but it's not really worth the hassle.The end credits show that the actors are generally more funny, and having more fun, in real life than in this movie. It's not the worst thing ever committed to film, but this makes \"Not Another Teen Movie\" look like genius comedy by comparison, and that's remarkable in itself. Chris Kattan, who can be a really funny guy, isn't funny here and embarrasses himself pretty good in this, as usual. And it's always a bad idea to have Ben Stein explaining the jokes along the way; Ben stopped being funny the minute we realized he was in on the joke of his Ferris Bueller cameo.","i pretty much stopped watching the movie when the oily girl introduces the new guy to \"freaks\". whoever their 2006 fact-checker was he/she did a crap job. a \"freak\" in the 80's wasn't really a bad thing. freaks were generally people who did drugs and were heavily into music and partying to extremes -- including extreme styles that went with it, i.e. deadheads - people who followed the band the Grateful Dead; people who dropped acid a lot; people who were usually stoned. freaks were generally cool, as in truly cool, and many people chose freaks over jocks because freaks had the nerve to be who they are. very individualistic people, not at all conformist. a lot of artists were freaks. the people oily girl introduced the new kid to would have been called \"geeks\" in the 1980's and most people avoided geeks of all sorts, computer geeks, science geeks, Trekkie geeks etc. if a movie can't even spend to hire a decent fact-checker to look up proper definitions of slang of a particular decade the misrepresentation is too great, too bogus and not worth anyone's time. the movie seemed to suck anyway and the people playing the leads all looked 25, not 17.","Yes, I know it was silly beyond belief, but this one is going down as a classic. There are so many one-liners in this movie. This is going to live on in cult form.I am old because I grew up in the 80's and have seen all the movies they spoofed. This is why it cracks me up so much. Maybe the people who don't find it funny are not from the 80's. I mean, you just had to live in that decade to realize how hysterical everything was. I was a teenager at the time, but looking back at it, that decade blows my mind.I mean... c'mon-- Soul Man? (I actually liked that movie) But could you ever imagine a movie like that being made now???It's just the absurdity of the 80's. You just have to look back and laugh at it-- big hair, big makeup, over-the-top fashion and all!PS-- I'm buying the DVD now!","Ben Stein tells the audience that VH1 found a yet unreleased 1986 movie. Charlie (Mikey Day) and Lori (Dominique Swain) are brother and sister new to the school. Their family has just moved from Pittsburg to California. Lori aspires to dance but dancing has been outlawed in the town. Charlie is ranked last in popularity with outcast Billie (Nicki Clyne). On the other hand, Kimberly (Brittany Daniel) is ranked most popular. Gabriel (Chris Kattan) is the former dance instructor turned janitor.It's a poorly made spoof. It's a bunch of skid ideas and underdeveloped concepts smashed together. It more miss than hit. Most of the ideas are just simply pointing out of something ridiculous without a joke to back it up. Dominique Swain is going crazy yelling and screaming which makes Mikey Day oddly quiet in comparison. Tracy Morgan has some of the funniest moments and is the best thing in the movie. In general,there aren't enough funny jokes.","This has got to be one of the worst spoofs ever, just a little better than Epic Movie. Having grown up in the 80s, I look back with a certain fondness at some things from the period, and cringe at others -- some of the music and the 'fashion'. The scriptwriters seem to have thrown together the plot lines of 80s movies with abandon, and just amplified the most irritating parts -- hormonal teenage girls, obnoxious jocks etc. It comes across less as a spoof than a slap in the face to the 80s.Perhaps taking a little more time to develop character motivation would have helped, but that is sacrificed just to squeeze in more un-funny scenes. Don't get me wrong, I enjoy a good spoof -- Galaxy Quest and Airplane come to mind -- this just isn't one of them.The funniest moments and lines were reserved mainly for the minor characters - the principal, the jock and Tracy Morgan. The principal characters (in particular Dominique Swain) overact, and make it all too clear they're in a spoof. Really sad.","If this was the average youth in the USA 80 years is not surprising that the situation in that country has become. As much character comedy that has no less a reflection of the increasing stupidity of the student that one day should manage the destiny of that nation. Poorly educated, boastfulness, violent, mocking the weakest and the poorest ... I can not believe, no kidding, that people were so student, but now seeing in 2008 as mortgage banks has deceived the people and have been able to elect the president more stupid, pointless and bloody history does not I think to think that something that exists. Unfortunately, a dishonest movie, a filth, rubbish, to which should not have access to children 60 years or only highly trained people and never, never, no way was seen by the young of this age is more dangerous than a rude movie sex hard, since it is aimed as a missile to attitudes that are being formed.","This movie was too hilarious to be only shown on TV/DVD release. Not only did it smartly, yet stupidly, poke fun at popular 80's films, it had an AMAZING cast! Dominique Swain was a lot like Kevin Bacon in Footloose, and played the part well. The way she did horrible acting, yet made it seem so talented, was wonderful. Chris Kattan was hilarious as the dance instructor/janitor. And with the disturbing kiss him and Dominique shared, you tried to look away, but you knew you wanted to watch. Joey Kern played the rich, blonde, tan, cocky guy everyone saw in the 80's films. He did it well too. Tracy Morgan also gave a funny performance. Although I don't know them all well, all of the cast was smartly chosen and did well.The plot was like all teen spoof plots. A geeky guy only trying to bring the popular guy down and get the popular girl's heart. But, it was smartly made. It had it's random, stupid moments. But I couldn't help but laugh. This film was hilarious, and I will be sure to buy the DVD. I give it a 10, for making me laugh like I never had in spoofs.","devonlutzenberger","nunyerbiz","emichael83-2","woodwm","free_palmer","teezeCrost","clubimpossible","xXdrowningkittenXx","Jessilyn737","wolfmano23","filmgirl007","sortega777","polkadotprude","hobo_ent","oakley098","dobbin-4","liono86","TonyDood","spcafosteradoptprogram","artychika","SnoopyStyle","ed-804","magullon","smgfanever18","5 November 2006","7 November 2006","26 January 2007","17 November 2006","13 November 2006","22 August 2009","2 January 2007","5 November 2006","5 November 2006","8 November 2006","29 December 2008","4 November 2006","6 November 2006","28 December 2006","7 November 2006","15 December 2007","7 November 2006","19 March 2008","9 August 2007","5 November 2006","30 August 2014","4 January 2009","25 December 2008","5 November 2006","6","4","10","10","10","9","10","8","10","4","1","3","9","9","8","7","2","1","10","5","3","1","10"," Pretty Funny\n"," I made it all the way to the end....\n"," Totally Awesome Stoner Flick\n"," this movie is absolutely useful\n"," oh my gosh frickin people, this movie is Totally Awesome! : )\n"," Much better than other spoof movies\n"," At first you want to rank on it.....then...\n"," This movie was indeed \"Totally Awesome.\"\n"," If you love the 80's, you'll love this movie\n"," So funny!!!!!\n"," Bland at best...\n"," Oh man, so bad...\n"," A desperate attempt to be witty.\n"," Bound for Glory\n"," amaaazing\n"," Totally Awesome is Totally Awesome\n"," If it wasn't cliché, I'd say \"Totally Awesome\" is Totally Awesome!\n"," Sad Sign Of The Times\n"," awful movie\n"," This movie was AWESOME!\n"," Jokes not funny enough\n"," Another pointless spoof\n"," Do you really that stupid that they were in the 80s?\n"," A Totally Awesome Spoof.\n"]}