{"primary":["Volver (2006)","https://m.media-amazon.com/images/M/MV5BMjA0NTUxMjY1OV5BMl5BanBnXkFtZTcwNjI2OTMzMQ@@._V1_UY1200_CR90,0,630,1200_AL_.jpg","http://www.imdb.com/title/tt0441909/reviews","tt0441909"],"secondary":["I'm not going to tell you what the film is about because what was about for me it may not be for you and one of the many pleasures of the film is to find yourself there. Just let me say that after the Sahara, Vanilla Sky and Captain Corelli's Mandolin's adventures in Hollywood, I had discarded Penelope Cruz as an actress, completely. Well, \"Volver\" made me swallow my judgment. She is, quite simply, spectacular. A sort of Sophia Loren when Sophia worked with Vittorio De Sica. She is a mass of contradictions and not for a moment she tries to play for sympathy.Her emotion is contagious and makes us comprehend the incomprehensible. Carmen Maura makes a chilling, beautiful and unique entrance into this sublime Almodovar film based on his most scrumptious screenplay. The women stick together for each other's sake, they may even cross unspeakable boundaries for sheer compassion. The film uplifted me in a way that no other film has done in a long, long time.","'Volver' starts at a cemetery where the women are cleaning the graves on a windy day. Young mother Raimunda (Cruz), who after attending her mother's grave, finds herself widowed, thanks to her daughter. Her sister, Sole (Lola Duenas) sees a ghost of her dead mother and their battling-with-cancer friend Augustina is in search of her own truth about her mother. Almodovar's colourful canvas is a wonderful portrait of women in Spain. Though it is a colourful portrait, it's dark but somewhat humorous and appealing. Almodovar tells the story in a sensible but somewhat simpler tone. There are some shocking revelations but 'Volver' does not dwell on any one particular incident. It's the story of the women.Penelope Cruz gives one of her finest performances. It's been evident in her recent film choices (that also include 'Bandidas' that she's experimenting with different roles. As Raimunda, she speaks her mind, she's energetic, she's brave and a risk taker but at the same time she's vulnerable and is hiding a dark 'shameful' secret. Lola Duenas's Sole is a loner (but she loves her sister and niece). She's independent and satisfied with her life. The actress does nothing short of a great job. Carmen Maura is equally great as the 'ghost' bringing lots of laughter but even during Irene's own vulnerable sad moments she is outstanding. Portillo's Agustina, is a quieter lonely character who loves the sisters. The actress skillfully underplays her part and her immense talent is especially evident in the darkly humorous and somewhat sad talk-show scene. Like Almodovar's 'Todo Sobre Mi Madre', 'Volver' is about distinctive female characters and the viewer loves these women and feel involved in their stories.Like most Almodovar's films, the soundtrack is part of the narration that adds to his slightly weird chaotic world. Similarly, Iglesias's score brings out the richness of the atmosphere created by the wonderful cinematography (thanks to excellent photography). The Spanish streets, the vivacious culture is just presented in Almodovar's unique style.'Volver' is witty, warm, funny, colourful, disturbing, uplifting and lightly dark with a well told story and lovable characters portrayed wonderfully by the actresses.","An extremely kind, compassionate and tender film noir, from Spain's most internationally acclaimed filmmaker, might lack some of the suspense his other movies are famous for, but still it keeps the spectator thrilled and anxious until the very last moments. Anyone who likes Almodovar movies should see this one, and you can bring your family along, for a change (kids and grandmas alike).Indeed, the movie lacks some of the usual Almodovar suspense, and whatever mysteries it contains, are generally solved by the viewer some 20 minutes before they are explicitly and verbally elaborated on screen. It looks like Almodovar lost some of his interest in the telltale part of his movies, paying more attention to acting and emotions. Well, acting is fully worth the shift.Penelope Cruz is predictably brilliant and gorgeous, but performance by other ladies (from the elderly Chuz Lampreave to teenage Cobo) is also worth applause.","A wonderful movie,a masterpiece. Whether or not it's the summit of the director's output so far will be a matter of taste, but it's definitely up there with Hable Con Ella and All About My Mother.The story is dazzlingly well told. Even though it has the trappings of soap-operatic melodrama, sheer pace prevents any of the characters descending into self-pity. The emotional courage of these women (there are only four men with speaking parts in the entire movie, as far as I can remember, with not one of them being a major character) is what marks them out. Their complete involvement in life and, particularly in this film, death.The photography is excellent. Beautiful shots suddenly throw an event into weird relief, such as the funeral cortège framed between the sides of a narrow street, or the landscape suddenly resonating poetically with the hypnotic turning of windmills.The rhythmic editing is a trademark of Almodovar's. He's like a great jazz musician. Talking of which, his use of and sensitivity to music is another of his defining characteristics, and the score here, highly reminiscent of the same composer's work on Hable Con Ella, is again wonderfully melodic and romantic, matching the inner fire of the superb actors.Penelope Cruz lights up the screen. As others have remarked, her performance seems to be something of an homage to Sophia Loren - but Cruz is her own woman: she dazzles in a to-die-for role. However, this is far from being a star-plus-the-rest movie: the entire cast is in every way up to the mark, not least the great Maura, who herself seems to be invoking another Italian cinematic icon - Giulietta Massina.Unmissable.","Pedro Almodovar's 2004 Hitchcockian effort, Bad Education, proved to be a polarizing force. Volver found plaudits amongst nearly every critic, and that is because amongst the father-stabbing, singalongs and appearances of ghosts, Almodovar has truly found his niche.Penelope Cruz plays the put-upon mother Raimunda, who, straight after attending the dusty town of La Mancha to attend to her mother's grave, finds herself husbandless, thanks to her own daughter. So far, so convoluted. But there's more. Her sister, Sole (Lola Deunas) thinks she's seeing the ghost of her dead mother, and their friend Augustina tries to find out the truth about her own mother, before time runs out and cancer gets the best of her.In his deftly-weaved, beautifully portrait of the fairer sex, Almodovar's touches are bold and brilliant, every scene resonating a vibrancy and unforgettable soul that is very appealing. In the lead role, Penelope Cruz gives one of the best performances of the year. As Raimunda, she is outspoken, risk-taking, and harbours a troubled secret about her daughter. The plot turns, suffice to say are as audacious as that of any Alomodovarian plot, but Volver impacts for its huge heart. You will love this women and care about their every move.The melodramatic, offbeat style that the film is made suits it perfectly, and Cruz, Duenas, Maura and Portillo give performances that impress and involve. Although the film, written specially for Cruz, essentially belongs to her and the independent, individual character of Raimunda, Maura, as the ghostly figure of her mother, is sad and funny, and perfectly in control of a performance that could easily slip into farce. Portillo is as impressive, and in a key scene involving a decision made on live TV, every nuance of her acting is effective in the heart-wrenching scene.Regular Almodovar collaborator, Alberto Iglesias, tunes his musical skills to perfection, and, through pizzicato-led interludes and frames saturated with colour, Almodovar's canny direction shines. He presents us a story as big-hearted and loving as many you're likely to find this year, and, despite there being some shocking plot twists, you'll still come out of Volver with a positive outlook on life. There's a lot of ground covered here, from severing drinks to parental atonement, but every scene has something great to it, thanks to a lovely screenplay that is by turns witty, bright, disturbing and heartbreaking. Mature, beautifully told and wonderfully acted, Volver is worth returning to.","This is simple story about 3 generations of women: the grandmother Irene(Carmen Maura), her daughters Raimunda (Penélope Cruz)and Sole (Lola Dueñas) and her granddaughter Paula(Yohana Cobo). It takes place mainly in Madrid, in a neighbourhood where various ethnic groups and people from the different provinces of Spain live, people who went to Madrid looking for a better tomorrow. Raimunda, Sole and Paula have to go back to their home town to praise the dead and meet one of their aunts, Tia Paula (Chus Lampreave). Soon the old aunt dies and unleashes a serious of mysterious events, their dead mother re-appears to settle some unresolved issues with her daughters and with her neighbour, Augustina (Blanca Portillo), revealing a past until then unknown. This is movie about the Spanish culture, homesickness, the culture of the death and the struggle of 4 women with strong character and strong personality traits to survive wind, fire and death. It is extremely well produced and has great photography as well as an unmatchable soundtrack. It is a very nice movie, filled with laughter and emotions and with a beautiful simplicity . If you are waiting for a Hollywood romance, a Hollywood comedy or a twisting complex plot, this might not be what you are looking for.","EPIC COMEDY If we get to forget the delirious and delicious comedy side of the film, we find an epic story of what the second half of the past century was for so many women in Spain. Moving from the town to the city(from La Mancha to Madrid, from great patio houses full of architectural wisdom to terrific social housing apartments in the suburbs of the city), fighting against the elements(fire that burns down like love, wind that drives you crazy, water that used to fill our rivers and now is gone), having bad luck with men as the only possible fate, exercising companionship, imagination, tenderness and shrewdness as their only weapons for surviving. Keeping dignity untouched inside them.ACTRESSES Pedro Almodovar in this film is like a top ten chef reinventing the most popular dishes of his own culture! The movie is a tasting menu of the greatest playing actresses with the best possible direction. The wild instinct of Penelope to construct a suburban animal, with strong links to Italian mommas, the touching interpretation of Blanca Portillo, simply mind blowing, the master lesson from Chus Lampreave that fills the theater with rivers of affection, the young actress Yohana Cobo that achieves success in some of the most difficult takes in the film, and Lola Dueñas that gets the plainest part and gives it a huge dimension with high level performance for comedy. And Carmen Maura, that stars the story like a Japanese terror movie star, she is like the Obi-Wan Kenobi of La Mancha.DENSITY AND GRATITUDE So we have an epic story, great actresses, and a refined comedy that fills the spectator with gratitude, at least that is my case. I just have no defense in front of a film like this, that tells me a great story, makes me laugh, and has the highest detail density in objects colors, comments, views, gestures, references, movements and subplots. That is probably the only trouble with it, more than one view is necessary to catch it all, if possible!","I now can say I have seen a Pedro Almodóvar film in the theatre. Sure I saw five of the eight films included in ¡Viva Pedro!, but those were DVD projections, while Volver was the real thing (as evidenced by it catching fire causing the six or so of us watching to wait a bit before seeing the final twenty minutes). I will admit, while enjoying Pedro's lighter, earlier fare, it is the dramatic and dark films I really have an affinity for. Carne trémula and Hable con ella are brilliant movies that left an indelible mark on me once they concluded. Volver has moments of true emotional resonance, but there is a bit too much playfulness and an inconsistent tone that prevented it from being the masterpiece most critics are calling it, for me at least. I was captivated by the performances and the seemingly slight storyline, trying to figure out where it was going. However, a lot goes on that, while pulling a Usual Suspects twist, really is a series of McGuffins. Like that movie did for me, Volver proves that a great 180-degree flip at the end does not make a great film out of the hour and a half before it. Pedro definitely had something here, and while a very good film, just didn't quite seem to know how serious to take it.Even if the film was utter crap, I would still have given it a good rating based on the phenomenal performance from Penélope Cruz. She has always been panned as an English- speaking actress, yet hailed as one of the best when in her native language. It's trueI have not seen a really great role from her in English, (Vanilla Sky was good, but knowing that she was in the Spanish original, I have to hold judgment until seeing Abre los ojos), and the foreign movies I've seen with her showed a more confident skilled professional. Both times seeing Cruz in her natural element were in Pedro films, but unlike Carne trémula and Todo sobre mi madre, where she played somewhat shy women, relying on her friends, here in Volver, she has an almost sexual awakening from those previous roles. One could say that this film is a vehicle for Cruz's gorgeous figure as much as the story being told. She is simply beautiful throughout, and it's that beauty and self-assuredness that makes the touching moments of poignancy that much more effective. She goes through all emotions here, and I believe if Pedro allowed the film to stay true to the dramatic elements rather than playing some serious moments as comedic, her performance would have been elevated even higher.The supporting characters all do great work as well. Lola Dueñas is great as the sister whose secret knowledge of their mother's return from the afterlife constantly keeps her on her toes. The facial expressions are priceless when trying to keep her stories straight with her sister and hairstyle customers. With her role here and in the fantastic Mar adentro, (coincidentally directed by Alejandro Amenábar who did the aforementioned Abre los ojos), I really hope more of the hugely successful Spanish directors today utilize her immense talents. As for the ghost of a mother, Carmen Maura, Pedro's old muse, returns in front of his camera. She plays the part perfectly where you can never quite see if she is a ghost or really there. Her comedic timing is precisely on the mark each instance needed, but again I feel it could have been better used in a different film. I also must mention Chus Lampreave with her distinctive voice and delivery, shining again in a small role. Almost every Pedro film I've seen has had her involved.My review here might seem a bit harsh, but let me say I really enjoyed the film. It is just the knowledge of what Almodóvar can do with a dramatic piece of work that makes me think of how much more the movie could have been. No one does female-driven stories of family, love, and grief better, and it is just a shame many Americans don't have a clue about him. Hopefully Pedro will never sellout and do an English language film unless it's necessary for the story; he is too good at showing the culture of his home country of Spain. I have no clue if what he displays is true Spanish culture, but the opening scenes, with the tombstone cleaning, the funeral stories, and the non-stop kissing-greetings, make me feel totally surrounded by this foreign land.","I saw this film yesterday and it got me thinking well after I had left the cinema. It made me cry and it made me laugh. It is a choral film where women (as usual with Almodóvar) have the upper hand. I'm not a big fan of Penélope but I must admit she's really up to scratch this time. She has clearly fed on Sofia Loren to come up with the very credible character of Raimunda: tight skirts, high heels and generous cleavage. Carmen Maura and Lola Dueñas are simply magnificent. Also Chus Lampreave as Tía Paula (even in a too-short appearance inspired in Almodóvar's mother) is superb. Almodóvar himself has admitted that this is one of his most personal films, set in his home region of La Mancha and full of memories of his own childhood. Great music too. The moment of the tango (\"Volver\" by C. Gardel) turned into flamenco really makes you break in goose pimples. However, it is not Penélope's voice, but flamenco-star Estrella Morente's. If you like Almodóvar, you will certainly like this film.","The minute Volver opens we know we're in for a strange ride. A rural cemetery is a hive of activity - women cheerily cleaning the headstones with almost festive enthusiasm. It could be a song and dance number, though we observe that the music is overlaid, the women aren't actually singing and, on closer inspection, the scene is strangely normal - if a little unusual. As Raimunda (Penelope Cruz), Sole and young Paula depart the gates, we are swept along into a fast moving story that cuts through moral boundaries with an unerring surety.This film is mostly about women, girls sticking together across generations, separations and misunderstandings, bonding and being able to rely on each other. But, this being an Almodóvar story, don't expect a cosy little tale where people follow a yellow brick road to happiness; Paula's father ogles then tries to rape her and gets himself accidentally murdered, more and more dirty linen gradually falls out of the cupboard, and an exceedingly realistic ghost (played by Carmen Maura from Almodóvar's early success, Women on the Verge of a Nervous Breakdown) provides a constant element of unpredictability. It is the first time Almodóvar has included a supernatural theme and he handles it with great panache.Comedic elements are added not just by hiding the ghost under the bed, but by a scintillating script which includes gems from a quick-thinking Raimunda. \"Are you hurt?\" asks an ex-boss solicitously (there is blood on Penelope Cruz's neck.) \"No,\" she answers gaily, \"women's troubles,\" although we know he has disturbed her in the process of disposing of a dead body.Her performance here is undoubtedly one of the high points of Cruz' career. She radiates from centre stage in most scenes, bouncing between being a wounded woman who puts on a dazzlingly brave face, to a dazzling screen icon as she slips into character when wooed by the local film crew for whom she is preparing lunch. Almodóvar also takes an occasional outing from a capable verité approach to show off cinematic artistry, with an unexpected overhead shot as Sole is surrounded by mourners, framing Cruz photogenically with mint leaves and cocktails, or zooming in to make the act of chopping red peppers a work of art that you almost want to frame and put on the wall.Diversions are provided by moments of flamenco guitar (to which Cruz lip-synchs beautifully), the simple beauty of the old Spanish streets, and the hilarious interrogation by the friendly whore who doesn't know what Raimunda wants her to do (assuming it must be something sexual when it's not, although perhaps even more nefarious).The plot develops with such dizzying speed you never know what's going to happen next, but as Almodóvar approaches his finale he ties everything up with Hitchcock-like revelations. Volver takes the fantastic and makes it seem not only believable but matter-of-fact. It is colourful, vivacious, and by turns full of warm comedy and deep, genuine emotion. If you only once see a subtitled movie this year, you could do much worse than Volver.","It's when you stumble out of the cinema and dive into the nearest coffee shop to greet the assistant in a language you only use on holiday that the power of this movie becomes evident. This is incredibly powerful stuff...and done in a way only Pedro Almodovar knows how. Cruz is absolutely magnificent in a finely nuanced performance. This an incredible mix of gritty realism and absolute fantasy. The dialogue is clipped and aggressive....wonderful...none of that Hollywood psychobabble and truly down to earth. This is a film about the lives of people who won't see it, if they even get an opportunity...subtitled films are the preserve of the chattering classes right? How many independent cinemas are to be found in working class areas? Can't see this being shown at the local flea pit ...a real shame really, it's a must see for all.","This is only the fourth Almodovar film I've watched, even though the local DVD rental store has practically all his work readily available! Since Luis Bunuel is my all-time favorite director, it might seem strange that I have stayed away from the most celebrated film-maker to emerge from this country in recent years but who has gradually turned himself into the Spanish Fellini (incidentally, I find the Italian maestro overrated).Anyway, Almodovar's latest  despite having been nominated for a great number of international awards, winning several of them  is essentially a charmingly humanistic film but, perhaps, too slight to be a masterpiece. Curiously, even if his work often involves crime and assorted transgressions (mercifully toned down here), to my eyes it remains obstinately mundane. The film starts out a ghostly black comedy and, even if eventually abandoning this supernatural territory half-way through, it still satisfies overall. Penelope Cruz is certainly at the top of her game here, and she even gets to sing in one scene; Almodovar regular Carmen Maura is also quite amusing as her troubled mother.","I've been surprised by the enthusiastic response to this film. It seemed dull to me, much as I enjoyed looking at Penelope Cruz, and the plot details often poorly worked out. It also seemed like an intensely sexist film: if the gender roles were reversed, almost everyone with any sense would be up in arms complaining the movie is intensely misogynist. It's not just that both the principal males are portrayed as complete jerks and sexual predators, but also that the women are portrayed as almost flawless, forming a utopian community which lacks conflict of any kind and which rests on relentless generosity and good humor. Utopias are notoriously dull and this one turns out to be no exception. But it's also interesting to notice what happens (and here comes the plot giveaway, though it refers to a very early scene) when the teenage daughter kills her father. (1) Her mother rushes to take responsibility for it and(2) the daughter seems to suffer almost no remorse (and in fact her emotional life then disappears from the film). It's not quite a glorified killing, though Aldomovar's camera lingers on the blood in a bloodthirsty way, as though it makes an attractive painting, and then it's soaked up and out of sight without bloodying either daughter or mom, neither materially nor emotionally. Later the film reveals another killing, again by a woman of a man, , and once again it is a killing which the film implicitly endorses.In short, Volver is an ideologically-driven film with an unpleasant and in fact a repugnant ideology, and so I write an ideological critique. But apart from that, it's just not very interesting. It has none of the depth of, say, Aldomovar's Talk to Her, which I loved.","I'm a huge fan of Pedro Almodovar and this movie was no disappointment.I mean if you would just read the script it looks like a telenovela but it's directed in such a way that it becomes this very human drama that leaves you in a void after watching.I would definitely suggest you watching this if you're into dramas with great acting and of course, Pedro Almodovar.Very real, human and emotional.8/10.","Great movie Pedro!!!Volver is by far one of the best movies of Almodovar. The way he narrates the story with the camera is just perfect: gently and with character. You will see how feelings and emotions are driven smoothly by a great group of actresses (Penélope does a GREAT job along with Carmen Maura) which perfectly understand what the director wants to deliver and how to do it.It is another of those twisted bitter stories of life that Almodovar knows well and enjoys developing and producing them. Don't miss it. One side note: I read that Penélope had to place some cushion to make her rear bigger according to the character!!","A quite attractive portrait of local customs and manners that rings true. Although sure to get laughs when viewed from other cultures; the characters are developed and interpreted with affection. Several stunning images stay with the viewer after the movie is over the circle of women receiving Sole at the wake, the body in the kitchen, the cutting board but this story uses less visual and colour metaphor than recent past films and instead focuses in on the actor's renditions. We see people from a village behaving and doing as they typically do.The script does seem to wander about pursuing things that don't necessarily tie in but all the events are included to maximise the \"mannerist\" picture and flesh out the characters' dysfunctions. The grandmother Carmen Maura plays isn't merely comic relief but a super realist example of how far an intrusive society can push its members into hiding as well as a symbol of the below board justice that was for so long practiced in villages outside the direct reach of authorities.Like LA MALA EDUCACION, the script centres on a subject that would have been taboo for open discussion for Spanish society not fifteen years ago. More so if it was to take place in a small village where everyone treats other people's business as public domain. It is interesting to note that for many decades under Spanish criminal law a blood relationship (especially that of a father to a daughter) with a rape victim is considered a mitigating factor in sentencing. Thus, Raimunda's attitudes and motivations are explained perfectly when viewed in light of what she lived through. Penelope Cruz's interpretation was fantastic in my opinion, in that is showed all the locked up rage, sorrow, distance and detachment that is typical in people who have suffered such childhood experiences.I found it extremely gratifying to see a movie treat this subject matter without falling into morbid clichés or sappy after school special type emotional dialogue. I find it especially gratifying that this film has finally given Almodovar the recognition he deserves in his home country: Goyas for Best Picture, Best Director, Best Actress and Best Supporting Actress (Maura)","Raimunda (Penélope Cruz), her daughter Paula (Yohana Cobo) and her sister Sole (Lola Dueñas) travel from Madrid to the windy and superstitious village of Alcanfor de las Infantas to visit the grave of their mother and aunt Irene (Carmen Maura), who died years ago in a fire with her husband. Then they visit Irene's sister Paula (Chus Lampreave), an old senile aunt that raised Raimunda after the death of her parents that insists to tell them that Irene is alive and living with her; later, they go to the house of her neighbor and friend Agustina (Blanca Portillo), who gives a support to Paula. They return to Madrid, and after a hard day of work, Raimunda meets her daughter completely disturbed in the bus stop waiting for her. When they arrive home, Paula tells that she killed her unemployed father Paco (Antonio de la Torre), who was completely drunk and tried to rape her. While Raimunda is hiding his body, Sole calls her to tell that their beloved aunt Paula had died. On the next morning, Sole travels alone to the funeral, and when she returns to Madrid, she finds her mother hided in the truck of her car. She brings Irene to her apartment, where secrets from the past are disclosed. \"Volver\" is another great movie of this awesome director Pedro Almodóvar, who explores the emotions of the characters in a mysterious and traumatic situation. It is visible that Almodóvar changed his original aggressive style to a more commercial and less anarchic one, keeping his trademark with the usual bright colors, but without the usual references to the Catholic church or homosexual and bizarre characters, maybe because he is more experienced now. Nevertheless, it is impressive how Penélope Cruz is a stunning actress when she works in her home country, and Almodóvar achieves a magnificent performance not only from her, but from this wonderful cast. My vote is eight.Title (Brazil): \"Volver\"","A film by Almodovar- sends a tingle down my spine every time. The capitalized print which opens the Spanish auteur's latest feature instantly induces memories of salacious nuns, gentle necrophiliacs, wisecracking transsexualsand I haven't even got as far as the infant-terrible's critically reviled early work. And after a beautiful opening montage, with the camera roving across a wind-swept graveyard animated by a hoard of widows feverishly scrubbing tombstones, I thought Pedro had me again under his wicked spell.Yet once my nostalgia had subsided, there was very little to fill its place. For a director who revels in bringing humanity to assassins and rapists, he does a very poor job at finding any emotional depth or endearing quality in his women. Penelope Cruz is Raimunda, a headstrong housewife whose life is complicated by her daughter's accidental killing of her abusive husband. Thankfully she lives in Almodovar's Spain where your friends will quite happily help to dispose of a corpse for the offer of a round of cocktails. Add to the melting-pot the ghost of Raimunda's mother and a host of other eccentrically warm-hearted matriarchs. \"Volver\" means literally to return, and Pedro does appear to be recycling old material. The sub-plot of incest feels as though it were tacked-on as the obligatory \"taboo\". Instead of commenting on or subverting the issue, as with his treatment of paedophilia in Bad Education, it feels forced and unconvincing amid the film's chick-flick sentimentality. I suggest Almodovar call his next film Salir (to move on).","Good film including interesting drama , colorful cinematography , sensitive score and nice interpretations by all Spanish cast . Offbeat black drama/suspense movie about an occupied housewife called Raimunda (Penélope Cruz) becomes involved with family problems . She lives in Madrid with her daughter Paula (Yohana Cobo) and her hubby Paco (Antonio De La Torre) , a drunken and violent man . The housewife's spinster sister Sole (Lola Dueñas) is increasingly convinced that their mom has returned from the dead . The two sisters lost their parents in a fire in the village of Alcanfor de las Infantas (La Mancha) , their birth location , years ago . Their aunt, Paula (Chus Lampreave) , still lives in the Mancha and goes on to believe her sister Irene (Carmen Maura) , mother of the two sisters , has returned from the dead as if she were still alive . When the old aunt dies the situation changes and the happenings go wrong . Then , a self-defense murder takes place and Raimunda has to hide the body . Later on , Sole works clandestinely as a hairstylist for women helped by a mysterious person . After that , the movie shifts into a more profound register as the roles haunted by various ghosts are systematically disturbed and the past returns. Enjoyable film incorporating serious-comic effects about the theme of maternal love , full of feeling , outlandish characters , haunting mood-pieces , Spanish Neo-realism , fun scenes, strange humor , and a totally satisfactory sense of style . The picture deals with mysterious drama , off-the-wall comedy , absurdities familiar , plenty of twists of mystery and suspense and many other things ; featuring a feminist heroine of classical proportions . For the first half , the movie goes agreeable and amiable with flashy brilliance along its jaunty way , pausing for serious thought until when occurs a killing . The picture is pretty well , it turns out to be superior to Almodovar's previous and subsequent entries . Filmmaker piles up on the contrivances , turns and twisted events so that the picture to have success . The result is undiluted scabrous drama , sharp images and a crazy strings of plots . It's a piquant look at lower classes involving twists and an intrigue about killings , disappearance and keeping the spectator intriguing and amazing . Flawless story with a quartet of sensational protagonists , including an unforgettable Penelope Cruz , she parades sexily at her best and more relaxed and enticing than ever . The hit of the show is undoubtedly for the fetching Penelope who gives one of the best screen acting . She sings marvelously a lovely rendition of the Carlos Gardel tango of the movie's title . I liked everyone in the excellent cast, and the male and female actors , especially Penelope Cruz , were all very attractive , she became the first Spanish actress ever to be nominated for Best Lead Actress at the Oscars . According to Pedro Almodóvar, there's only one fake element in Raimunda/Penélope Cruz body : the bottom . He said that this kind of characters are usually big-bottomed people, and that Cruz is just too stylized . Support cast is frankly well such as Blanca Portillo , Yohana Cobo , Chus Lampreave , Pepa Arniote , Antonio de la Torre and other delightfully played roles . Special mention for Carmen Maura , this was first movie of Pedro Almodóvar and Carmen Maura together in 18 years ; heir friendship broke after shooting \"Women on the Verge of a Nervous Breakdown\" . Emotive soundtrack by Alberto Iglesias , Almodoval's usual . Glamorous and brilliant cinematography by Jose Luis Alcaine . Alcaine was first cinematographer to use fluorescent tube as \"key\" lightning and deemed to be one of the best Spanish cameramen . Alcaine frequently works with Pedro Almodóvar , Bigas Luna and Vicente Aranda , he has photographed a lot of successes . The motion picture was realized in his peculiar style by Pedro Almodovar ; he often uses symbolism and metaphorical techniques to portray circular story lines though here he directs a special melodrama , including his ordinary touches . Almodovar directs throughout with splendid zip and he usually portrays strong female characters and transsexuals and along his career getting some important international prizes . His first feature film, Pepi, Luci, Bom (1980), was made in 16 mm and blown-up to 35 mm for public release . In 1987, he and his brother Agustín Almodóvar established their own production company : El Deseo, S. A. The \"Almodóvar phenomenon\" has reached all over the world , making his films very popular in many countries . Oscar-winning Spanish director Pedro Almodovar who made successes such as Labyrinth of passions , Law of desire , Women on the verge of a nervous breakdown , Bad education , All about my mother , Talk to her , Broken embraces , The Skin I Live In and many others . The latest from acclaimed Spanish director , Pedro Almodovar's I'm So Excited (Los Amantes Pasajeros) competing for the inaugural best European comedy honor during the upcoming 26th edition of the European Film Awards ; the latter however , being a flop and badly paced comedy .","This movie was quite interesting until right after the murder scene, and when Cruz threw the guy in the cooler. It appeared the movie was going to head in the direction of an interesting murder mystery...why did she do it and would she get caught?? Then it took a strange course about family relationships that I personally found very dull. Kinda like Desperate Housewives for the nursing home set. Penelope Cruz has never looked more gorgeous, and I don't think I ever appreciated what a terrific actress she is. She is special. All the performances were excellent although I found the characters, ex Penelope, fairly unlikeable. Tough to stay awake in this movie for me, I kept watching myself watching the clock for the ending which was OK, but not worth the wait. I simply found the relationships between the family members very uninteresting.","There was nothing in this film which even began to interest my intellect or emotion and I could see every \"twist\" coming from a mile away. I'll never understand why in stories like these the characters just don't come out with the truth and tell everyone so all can be okay, but then I guess you've got no story and no reason to make your film (which is what I felt should have been done in the first case). Expect no action, lots of \"secretive\" dialogue (which anyone with a knowledge of subtext will figure out in the first five minutes), overwrought camera work, and gratuitous \"I'm so beautiful but this has nothing to do with the story\" shots of Penelope Cruz. Or just save yourself the time and money and don't watch it...","Raimunda is a hardworking mother who has the teenage Paula and husband Emilio to look after. She also cares for her elderly aunt in a nearby village. Raimunda cannot understand how her aunt can look after herself so well considering her age and sight but believes that neighbour Agustina is the hep, ignoring her aunt's babbling about Raimunda's long-dead mother looking after her. Their aunt dying brings Raimunda's sister Sole back to the village while Raimunda has another crisis of her own. When Sole is confronted by the ghost of her mother, she takes her into her house to allow her to take care of the unfinished business she left behind.Lacking the graphic nature and challenging material of some of his other films, this film is perhaps a more accessible Almodóvar film for a wider audience base. It is a shame though that this appears to have happened at the expense of the narrative drive and the film's passion  hell, since when has incest been so light-hearted? Despite lacking bite and major emotional impact, the narrative is still a solid flow from start to finish, built on future and past echoes through the three generations of women from the same family. For the first half a lot happens and the story flies along however in the second half the emphasis comes off the story a little because you can see where things are going generally long before they get there. This knocked the mystery and intrigue out of it but the interest in the characters was still there and this help me till the end. The film deals with some dark subjects but again Almodóvar seems unwilling to shock or push things because the subject is played out in the characters past rather than the present. The usual streak of well-observed humour also makes it feel lighter than perhaps it is as Almodóvar writes humour into the dialogue and also puts nice visual touches into the film that have hints of absurdity.The film may not generally be as strong as I would have liked but in terms of performances it is impressively strong. Cruz has been rightly praised for her turn because she is natural, convincing and delivers a range of emotions. She is very attractive here and it speaks volumes about her performance that I rarely saw her on this superficial level. However the praise lavished on her in professional reviews has meant that her co-stars have been ignored even though several are just as good. Maura is good in her role although the script gives her a very stable base in comparison to the others. She works well with Dueñas and the pair bring out a gentle relationship with nice humour between the two of them. Portillo is strangely asexual and that distracted me for a while but otherwise she gives a good performance although it was a shame that the script didn't do more with her. Cobo was wonderful  natural and totally convincing for a girl who has grown up with a very friendly and close mother/daughter relationship.Overall this is a good film but I can understand why some Almodóvar fans will feel like it is lacking somewhat. Indeed it is strange that the subject of incest is handled without being more gutting or shocking, however the story and the characters are good enough to carry the film even though any mystery burns out long before the end. Well worth a look for reasons beyond and including the roundly strong performances.","This film didn't really know what it was. It was slow and despite its length undeveloped, punctuated with subplots that went nowhere. The idea of the spirits of our ancestors could have been developed to provide a neat twist at the end. Imagine if the mother had really turned out to be a ghost and just disappeared to the amazement of everyone concerned. As it is we are left with the absurd notion that after being assumed dead for years, the mother is going to slip back into society as if nothing had happened. Well that would fit in with the Almodovar's world where a convenient blind eye is turned in every direction.The lack of any sense of contact with the real world in the form of the forces of law and order threatening to expose the truth meant that it failed to thrill and provide any moments of great suspense. Neither was there any sense of horror at the start of the film to justify the events that followed.The guy who shows up to buy the restaurant is written out in less than a minute. The young man from the film crew who is attracted to miss Cruz is dismissed. She buys rope and tape and a shovel and attracts no suspicion. The visitor who notices blood on her neck accepts her dismissal that it's down to women's problems as though it's the most natural thing in the world. The line is funny but this film is not a comedy unless in its absurdity. So cut the scenes. This film is littered with meaningless red herrings that drag it out to its ultimate death.So why cast Penelope Cruz? Her attractiveness is irrelevant to the plot. If her beauty had been used to draw attention to her when she needed to be invisible and unhindered in her actions it might have been put to good use. In the end she's only there to attract the punters through the door.And where is the emotion in this film, the angst and guilt that Cruz's daughter must have felt, especially on finding out that the man she had killed was not her father. Like another reviewer I am amazed that a film that touches on such powerful and emotive issues should leave me so unemotionally affected.And finally that poster. The 60's flowers? Sorry as a graphic designer I have to say it was way off the mark, and don't accuse me of judging a book by its cover.","I would classify almost all of the films I have seen by Pedro Almodovar as some of my favourite movies of all time. \"Volver\" is one of those beautiful films. I love Almodovar's use of colour in all his movies. I love how his main character is almost always a strong, incredible woman, except in the instances where Antonio Banderas leads or in films like \"Mala Educacion\". \"Volver\" is a beautiful story, so wonderfully original, creative, and interesting. How many movies out there feature such an amazing plot? Penelope Cruz, too, was an excellent actress in this film. She is one of my favourite Spanish actresses and I think it's great that she has received a lot of fame from Hollywood, especially within the last decade. This is a great film, definitely worth watching. It is absolutely enthralling.","Volver (2006)For, By, About, and Involving Women, with Wit and GutsPerky, and presented with a glossy, not gritty, realism, most of the very enjoyable Volver is too clever and yet too routine by half. I liked it, and the acting is full of life. I followed the events with interest. The filming, the photography and editing, however, struck me as routine, and the plot, with its twists, depended on familiar twists. So it didn't work itself past being a very well made, very enjoyable movie.Luckily the last half hour mostly redeems the rest (and certainly the end wouldn't work without what preceded). Yet even here, there is a feeling of contrivance. The meat of it--the changing of their histories as the characters learn what really happened, and new feelings grow for one another--becomes truly touching. And as much as it makes you want to weep and wish we could all have it so, it also makes you laugh. In a way, it reminds me of Woody Allen's later films, with little improbabilities and odd characters saying funny things, but layered with something tragic or painful or at least truly pathetic.Much like life itself, come to think of it.I do think Penelope Cruz as the frantic and astute mother and lead actress has a special way of inhabiting the screen, some star power thing. The other actresses (almost entirely) are strong in their own ways, but really supportive of Cruz, most of all, the character rife with interesting failings within her glisten. The slightly out-of-place friend played by Bianca Portillo overtly takes on a confident independence and the mother, with her ascending position, is a model of survival, for sure. But Cruz shows us a different, more modern kind of strength--based on necessity, surely, but rising to the occasion without missing a beat.In that sense, Volver is about women triumphing. The fact that director Piedro Almodovar is a man is a slight problem--his films give women power, for sure, but too often from a very male and somewhat voyeuristic point of view, with a male gaze built into many scenes. Or so it seems from this man's perspective. But there is hardly a scene with a man, which I like, and many moments (like moving heavy things) where a man might have seemed handy. So in all the movie is empowering all around, to the viewer as well, because by the end you feel good about everything. There is a justice to even the worst crimes. It's comforting more than disturbing to think that women really can survive without us.","marcosaguado","Chrysanthepop","dolboeb","gsygsy","PizzicatoFishCrouch","inesv","jartcrouge","jaredmobarak","markus_ria","Chris_Docker","PipAndSqueak","Bunuel1976","swkap","sarahilayda1","juanma2001","jogrant","claudio_carvalho","DuplexPenthouse","ma-cortes","bueny","hinfinityl","bob the moo","simonvcolley","jamariana","secondtake","7 July 2006","14 September 2007","17 July 2006","28 August 2006","19 September 2006","8 February 2007","20 March 2006","21 January 2007","19 March 2006","25 July 2006","9 September 2006","28 March 2007","19 January 2007","25 September 2017","27 May 2006","20 March 2006","20 July 2007","15 December 2006","27 May 2015","17 December 2006","9 April 2007","25 October 2006","23 September 2006","12 July 2017","17 July 2009","10","9","9","9","8","9","8","8","9","10","7","4","8","8","8","8","2","7","2","3","3","9","7"," The Magic Of Compassion\n"," Vivacious, Heartbreaking, Funny, Colourful & Wonderful\n"," Almodovar, but no carnal episodes\n"," magnificent\n"," Heart-warming stuff.\n"," The story of 3 generations of women and their struggle to survive wind, fire and death\n"," the town and the city\n"," A vision of forgiveness beyond the graveVolver\n"," 100% Almodóvar\n"," A colourful, vivacious movie, full of sex, love, death and genuine emotion\n"," Superb must see\n"," VOLVER (Pedro Almodovar, 2006) ***\n"," A film both dull and man-hating.\n"," A telenovela in script, a masterpiece in screen.\n"," Almodovar like wine, the older the better\n"," Squared and moving forward\n"," Ghosts Do not Cry\n"," a Return to Bad Habits\n"," Dramatic and intense Almodovar movie full of mystery , intrigue and twisted events\n"," Penelope looked great, acting superb. But DULL movie.\n"," Slow, Gratuitous, and Predictable\n"," Perhaps not Almodóvar's best but engaging and interesting with roundly excellent performances\n"," Over rated and full of missed opportunities\n"," Powerful film by Almodovar\n"," For, By, About, and Involving Women, with Wit and Guts\n"]}